康诺亚生物医药科技（成都）有限公司 未查到写死特殊逻辑
北京吉因加医学检验实验室有限公司	未查到写死特殊逻辑
先声药业有限公司					未查到写死特殊逻辑
神州细胞工程有限公司				未查到写死特殊逻辑
江苏先声药业有限公司     			未查到写死特殊逻辑
上海罗氏制药有限公司  			未查到写死特殊逻辑
东曜药业有限公司-商业药           未查到写死特殊逻辑
东曜药业有限公司  				未查到写死特殊逻辑
上海复宏汉霖生物制药有限公司     	未查到写死特殊逻辑
山东新时代药业有限公司 			 未查到写死特殊逻辑
杭州中美华东制药有限公司           未查到写死特殊逻辑 修改有推送暂时未开启开关
杭州博之锐生物制药有限公司 		 未查到写死特殊逻辑 修改有推送暂时未开启开关
厦门艾德生物技术研究中心有限公司    客户端特殊逻辑 货物信息：产品长代码等
江苏恒瑞医药股份有限公司制剂分公司  恒瑞 都处理了
江苏恒瑞医药股份有限公司-袁志敏    恒瑞 都处理了
江苏恒瑞医药股份有限公司-研究院  	恒瑞 都处理了
恒瑞源正（上海）生物科技有限公司	 恒瑞 都处理了
上海君实生物医药科技股份有限公司   订单详情 附件显示
深圳信立泰药业股份有限公司        临床药品 出库 下单必须选实验中心\
科济生物医药（上海）有限公司   	预派时间 必填   没有预派日期为空的情况了 
北京泛生子医学检验实验室有限公司   不显示 常温6~30℃ 运输温度
北京普祺医药科技股份有限公司       
重庆宸安生物制药有限公司 			





201207536	上海君实生物医药科技股份有限公司  订单详情 附件显示
201900742	上海复宏汉霖生物制药有限公司   未查到写死特殊逻辑
20120780	上海罗氏制药有限公司    未查到写死特殊逻辑
201207356	东曜药业有限公司         未查到写死特殊逻辑
202101782	东曜药业有限公司-商业药    未查到写死特殊逻辑
201207954	先声药业有限公司				未查到写死特殊逻辑
202000714	北京吉因加医学检验实验室有限公司   未查到写死特殊逻辑
202000423	北京普祺医药科技股份有限公司   待审核 查询列表
202001156	北京泛生子医学检验实验室有限公司    不显示 常温6~30℃ 运输温度



201207746	厦门艾德生物技术研究中心有限公司      客户端特殊逻辑 货物信息：产品长代码等
201207063	山东新时代药业有限公司      未查到写死特殊逻辑
201207859	康诺亚生物医药科技（成都）有限公司   未查到写死特殊逻辑
202000926	恒瑞源正（上海）生物科技有限公司    恒瑞 都处理了
201600058	杭州中美华东制药有限公司  			未查到写死特殊逻辑 修改有推送暂时未开启开关
201901027	杭州博之锐生物制药有限公司 		未查到写死特殊逻辑 修改有推送暂时未开启开关
201207104	江苏先声药业有限公司 				未查到写死特殊逻辑
202102754	江苏恒瑞医药股份有限公司-研究院	恒瑞 都处理了
202101026	江苏恒瑞医药股份有限公司制剂分公司  恒瑞 都处理了
201207249	深圳信立泰药业股份有限公司  		下单必须选实验中心
201207685	神州细胞工程有限公司				未查到写死特殊逻辑
202000262	重庆宸安生物制药有限公司      待审核 查询列表


20120770	苏州泽璟生物制药股份有限公司
202001301	上海勃林格殷格翰药业有限公司    广州、长春 支持 选药品

202000187	凌科药业（杭州）有限公司      crc 不显示 临床药品
202100841	浙江博锐生物制药有限公司      crc 不显示 临床药品



20120412	江苏恒瑞医药股份有限公司-袁志敏

20120890	勃林格殷格翰动物保健（中国）有限公司
20120773	正大天晴药业集团股份有限公司-其它


201207536|201900742|20120780|201207356|202101782|201207954|20120890|202000714|202000423|202001156|201207746|201207063|201207859|202000926|201600058|201901027|20120773|201207104|202102754|202101026|201207249|201207685|202000262|20120412


预派时间 必填   没有预派日期为空的情况了 
201900162	上海科济制药有限公司
201207722	科济生物医药（上海）有限公司





201206985	诺和诺德（中国）制药有限公司   可选随货物资  dtp



202001281	国药器械上海有限公司  到付金额 、到付方式 


温控IVD运输


201207300	正大天晴药业集团股份有限公司  已做



 服务号支持 不选温度下单

201207741	江苏恒瑞医药股份有限公司-非肿瘤临床研究部 
20120010	江苏恒瑞医药股份有限公司-肿瘤临床研究部
20120504	上海恒瑞医药有限公司
202000110	江苏恒瑞医药股份有限公司-中央医学事务部






201207741|20120010|20120504|202000110

        if (($cu_data['cu_id'] == 20120010 || $cu_data['cu_id'] == 20120504 || $cu_data['cu_id'] == 202000110 || $cu_data['cu_id'] == 20120206 || $cu_data['cu_id'] == 202100384 || ($cu_data['cu_id'] == 201207741 && $post['cp_id'] == 16812)) && !empty($post['cp_id']) && $post['to_business_type'] == 2 && $post['to_goodstype'] == 3) {


20120010        江苏恒瑞医药股份有限公司-肿瘤临床研究部
20120206        广东东阳光药业股份有限公司
20120504        上海恒瑞医药有限公司
201900710        江苏恒瑞医药股份有限公司-综合产品事业部
202000110        江苏恒瑞医药股份有限公司-中央医学事务部
202001201        歌礼生物科技（杭州）有限公司
202100384        诺合泰生物科技（重庆）有限公司

201207741        江苏恒瑞医药股份有限公司-非肿瘤临床研究部
下项目




  'to_goodstype_cuid' => [
        [
            "cu_id" => [201206985,202104308],//诺和诺德（中国）制药有限公司
            "goods_id" => [11=>'样品']
        ],
        [
            "cu_id" => [201900151],
            "goods_id" => [12 => '稀释液']
        ],
[
            "cu_id" => [202100508],
            "goods_id" => [13 => '体外诊断试剂']
        ],
[
            "cu_id" => [202105449],
            "goods_id" => [14 => '细胞制剂']
        ],
[
            "cu_id" => [20120272,201900296],
            "goods_id" => [15 => '原料药']
        ],
    ],





    202100068	广州金墁利医药科技有限公司   修改订单、下单提醒 登录成功提醒一次  规则 当前时间不在  8:30到17:30 提醒



202000180	臻和精准医学检验实验室无锡有限公司 
2936 	基因检测样本运输  （线上项目：	genecast-sslogistics-20200703	商检&委托送检）    默认 无温度计













201207536	上海君实生物医药科技股份有限公司
202000453	上海君实生物工程有限公司
202001256	上海君实生物医药科技股份有限公司-医学事务部
202101396	上海君实生物工程有限公司—QC
202102664	上海君实生物工程有限公司—药理部
202103160	君实润佳（上海）医药科技有限公司
202103841	上海君实生物医药科技股份有限公司-DTP
202106851	君实润佳（徐州）医药科技有限公司

201207536|202000453|202001256|202101396|202102664|202103160|202103841|202106851




20120796	上海复宏汉霖生物技术股份有限公司
201207208	上海复宏汉霖生物技术股份有限公司-仓储
201900742	上海复宏汉霖生物制药有限公司
202104353	上海复宏汉霖生物医药有限公司
202107296	上海复宏瑞霖生物技术有限公司


20120796|201207208|201900742|202104353|202107296



20120780	上海罗氏制药有限公司
201207405	罗氏诊断产品（上海）有限公司
202100002	罗氏诊断产品（苏州）有限公司
202100244	罗氏研发（中国）有限公司
202100274	罗氏（中国）投资有限公司

20120780|201207405|202100002|202100244|202100274


202000714	北京吉因加医学检验实验室有限公司
202100928	苏州吉因加生物医学工程有限公司
202104777	广州贝奥吉因生物科技股份有限公司




201207356	东曜药业有限公司
202101782	东曜药业有限公司-商业药
202101848	东曜药业有限公司-零散



201207356|202101782|202101848




201207104	江苏先声药业有限公司
201207573	山东先声生物制药有限公司
201207954	先声药业有限公司
201601349	海南先声药业有限公司
201601486	南京先声生物医药科技有限公司
201601577	南京先声东元制药有限公司
201900579	停用-南京先声医学检验有限公司
202100038	先声生物医药科技有限公司
202100098	江苏先声医疗器械有限公司
202100099	停用-南京先声医学检测有限公司
202101071	江苏先声药业有限公司-医学部/市场部
202101319	南京先声医学检验实验室有限公司
202101906	南京先声诊断技术有限公司
202102352	江苏先声生物制药有限公司
202102364	江苏先声医学诊断有限公司
202103600	江苏先声药业有限公司-其他
202103727	江苏先声再明医药有限公司
202104140	先声再明医药有限公司
202104141	上海先声生物医药有限公司
202104143	北京先声再明医药有限公司
202105675	北京先声祥瑞生物制品股份有限公司




201207104|201207573|201207954|201601349|201601486|201601577|201900579|202100038|202100098|202100099|202101071|202101319|202101906|202102352|202102364|202103600|202103727|202104140|202104141|202104143|202105675



202000714	北京吉因加医学检验实验室有限公司
202100928	苏州吉因加生物医学工程有限公司
202104777	广州贝奥吉因生物科技股份有限公司



202100129	北京泛生子基因科技有限公司



202101696	天津泛生子有限公司


202001156|202100129|202100374|202101696


201207746	厦门艾德生物技术研究中心有限公司
201601187	北京艾德费斯医疗科技有限公司
201900999	厦门艾德生物医药科技股份有限公司
202000722	厦门艾德生物医药科技股份有限公司（试剂发货组）
202100939	新疆艾德森生物科技有限公司
202103046	北京艾德摩医学检验实验室有限公司
202104939	南京艾德加生物制药科技有限公司
202105008	南京艾德凯腾生物医药有限责任公司




201207746|201601187|201900999|202000722|202100939|202103046|202104939|202105008




20120724	山东新时代药业有限公司-暂停使用
201207063	山东新时代药业有限公司
201207064	山东新时代药业有限公司-邵杰



20120724|201207063|201207064




201207859	康诺亚生物医药科技（成都）有限公司
202103892	康诺亚生物医药科技（成都）有限公司-非临床



201207859|202103892




201207274	中美冠科生物技术（北京）有限公司
201207275	中美冠科生物技术（太仓）有限公司
201600058	杭州中美华东制药有限公司
201600093	中美福源生物技术（北京）股份有限公司
201601098	中美瑞康核酸技术（南通）研究院有限公司
201601543	中美华世通生物医药科技（武汉）股份有限公司
201900940	杭州中美华东药学服务总公司
201901045	中美冠科生物技术（中山）有限公司
202101524	成都中美瑞辰健康管理有限公司
202103045	中美新生医疗有限公司
202106070	杭州中美华东制药江东有限公司
202106292	北京中美奥奇生物科技有限公司




201901027	杭州博之锐生物制药有限公司
202000504	杭州博之锐生物制药有限公司-成品

201901027|202000504



20120763	成都信立邦生物制药有限公司
201207249	深圳信立泰药业股份有限公司
201600704	惠州信立泰药业有限公司
201601487	信立泰（苏州）药业有限公司
201900110	深圳信立泰药业股份有限公司（国际）
201900428	信立泰（成都）生物技术有限公司
202000033	信立泰（苏州）药业有限公司-成品药
202000071	深圳市信立泰生物医疗工程有限公司
202001168	广州信立康生物科技有限公司
202100763	山东信立泰药业有限公司
202102370	北京信立泰医疗器械有限公司
202104005	深圳信立泰医疗器械股份有限公司


20120763|201207249|201600704|201601487|201900110|201900428|202000033|202000071|202001168|202100763|202102370|202104005



20120854	百济神州（北京）生物科技有限公司
201207017	山东步长神州制药有限公司
201207581	北京艺妙神州医疗科技有限公司
201207685	神州细胞工程有限公司
201600184	百济神州（苏州）生物科技有限公司
201600482	北京义翘神州科技股份有限公司
201900233	北京艺妙神州医药科技有限公司
201900959	广州百济神州生物制药有限公司
202000053	百济神州（上海）生物科技有限公司
202000393	百济神州（广州）生物科技有限公司
202001331	百济神州（上海）医药研发有限公司
202101275	杭州康德乐神州百济药店
202102059	百济神州（广州）创新科技有限公司
202103066	北京神州远见科技有限公司
202104147	百济神州（上海）生物医药技术有限公司
202104148	百济神州生物药业有限公司
202104149	百济神州（广州）医药有限公司
202104151	百济神州（上海）企业管理咨询有限公司
202104925	义翘神州（苏州）生物技术有限公司
202107304	广州百济神州生物制药有限公司上海分公司



20120854|201207017|201207581|201207685|201600184|201600482|201900233|201900959|202000053|202000393|202001331|202101275|202102059|202103066|202104147|202104148|202104149|202104151|202104925|202107304