return [ 
	'su_type' => [1=>'外协', 2=>'一般供应商', 3=>'承运商'],
        'push_to_no_cuid'=>[20120083],
	'co_type' => [1=>'外协', 2=>'一般供应商', 3=>'承运商', 4=>'客户'],
	'ur_type' => [5=>'员工', 1=>'外协', 2=>'一般供应商', 3=>'承运商', 4=>'客户'],
	// 账号管理页面去掉客户账号管理
	'ur_type1' => [5=>'员工', 1=>'外协', 2=>'一般供应商', 3=>'承运商'],
	'bi_type' => [5=>'员工', 1=>'外协', 2=>'一般供应商', 3=>'承运商', 4=>'客户'],
	//-----------------附件----------------------
	'at_type' => [201=>'客户', 202=>'项目', 203=>'供应商', 204=>'入库单', 205=>'出库单', 206=>'采购单', 207=>'运输订单', 208=>'调度单', 209=>'对账单',
	211=>'仓储设备',212=>'质控文件', 213=>'调拨文件','214'=>'温度文件','215'=>'移库文件',216=>'异常文件',217=>'外协文件'],
	//运输附件
	'at_to_type' => [207=>'运输订单', 208=>'调度单'],
	//客户附件
	'at_type1' => [204=>'入库单', 205=>'出库单', 207=>'运输订单',],
	//客户附件子类型 
	'at_subtype1' => [201001 => '证照文件', 201002 => '合同文件', 201003 => '调查评审文件', 201004 => '报价文件','201005' => '仓储合同'],

	//项目附件子类型 
	'at_subtype2' => [202001 => '项目要求', 202002 => '项目操作SOP', 202003 => '其他附件',],
	//供应商附件子类型 
	'at_subtype3' => [203001 => '证照文件', 203002 => '合同文件', 203003 => '调查评审文件', 203004 => '其他附件',],
	//入库单附件子类型 
	'at_subtype4' => [204001 => '客户交接单', 204002 => '入库单', 204003 => '随货文件', 204004 => '货物拍照', 204005 => '其他附件',],
	//出库单附件子类型 
	'at_subtype5' => [205001 => '客户交接单', 205002 => '出库单', 205003 => '随货文件', 205004 => '货物拍照', 205005 => '其他附件',],
	//采购单附件子类型 
	'at_subtype6' => [206001 => '货物交接单', 206002 => '采购合同', 206003 => '发票扫描', 206004 => '其他附件',],
	//订单附件子类型 
	'at_subtype7' => [207001 => '签收单据', 207002 => '现场拍照', 207003 => '温度数据', 207004 => '保险单据', 207006 => '校准证书', 207007=>'交接单据', 207008=>'药检报告', 207005 => '其他附件',],
	//调度单附件子类型 51
	'at_subtype8' => [208001 => '发货单据', 208002 => '提货单据', 208003 => '其他附件',],
	//对账单附件子类型
	'at_subtype9' => [209001 => '电子对账单', 209002 => '发票扫描件', 209003 => '其他附件'],
	//设备检修附件子类型
	'at_subtype11' => [211001 => '现场拍照', 211002 => '检查记录', 211003 => '维修记录', 211004 => '其他附件',],
	//质控文件子附件
	'at_subtype12' => [212001 => '校准证书', 212002=>'温度计模板'],
	//调拨文件子附件
	'at_subtype13' => [213001 => '调拨文件',],
    //温度文件
    'at_subtype14' => [214001 => '仓库温度文件',],
    'at_subtype15' => [215001 => '移库文件',],
    'at_subtype17' => [217001 => '外协身份证',],
	//-----------------备注日志---------------
	'remark_type' => [ 101 => '调度单', 102 => '运输订单', 103 => '入库单', 104 => '出库单',105 => '采购单', 106 =>'对账单' , 107 =>'开票单' , 108 => '收款' ,109 => '操作表',110 => '物资明细表',111 =>'路由管理', 112 => '客户管理', 113 => '移库单',114=>'耗材交接',115=>'报价单',116=>'客户合同',117=>'预警单'],
	//调度单备注操作子类型
	'remark_subtype1' => [101001=>'生成调度单', 101002=>'修改调度单', 101003=>'指派调度单', 101004=>'修改调度单备注',
						  101005=>'回退调度单', 101006=>'关闭调度单', 101007=>'取消调度单', 101008=>'调度单发货', 101009=>'调度单提货', 101010=>'二次调度',101012=>'提货成功',101011=>'踢出运单'],
	//订单备注操作子类型					
	'remark_subtype2' => [102001 => '生成订单', 102002 => '修改订单', 102003 => '确认订单', 102004 => '指派订单', 
						  102005 => '取件备注', 102006 => '回退订单', 102007 => '关闭订单', 102008 => '取消订单', 
						  102009 => '预约取件', 102010 => '实际取件', 102011 => '修改耗材', 102012 => '实际派件',
						  102013 => '上传附件', 102014 => '调度发货', 102015 => '签收反馈', 102016 => '费用结算',
						  102017 => '拆分订单', 102018 => '订单绩效', 102019 => '修改客户备注', 
						  102020 => '提货成功', 102021 => '修改取派备注',102022 => '派件备注',
						  102023 => "操作费用", 102024 => '数据反馈', 102025 =>'更新方案',
						  102026 => '修改项目', 102027 => '耗材绑定', 102028 => '耗材归还', 102029 => '中转换箱',
						  102030 =>'创建工作单',102031 =>'指派组长',	102032=>'指派操作',102033=>'审核订单',
                          102034=>'生成耗材调拨',102035=>'单号绑定',102036 =>'修改工作单',102037 =>'指派调度单',
                          102038 => '打标签',102039=>'批量上传',102040=>'修改取件',102041=>'修改派件',102042=>'删除数据',
                          102043 =>'工作单交接',102044=>'订单存货',102045=>'发货成功',102046=>'修改调度单',102047=>'删除调度',
                          102048 =>'订单删除',102049=>'申请修改','102050'=>'申请取消','102051'=>'处理申请',102052=>'温度检查',102053=>'方案调拨',102054=>'订单打印',
                          102055=>'批量结算',102056=>'辅助结算',102057=>'自动结算',102058=>'添加/修改运输成本',102059=>'添加异常',
                          102060=>'合并订单',102061=>'拆除订单',102062=>'确认到达',102063=>'时效换箱',102064=>'暂存换箱',102065=>'添加干冰',
                          102066=>'删除编号',102067=>'生成预警单',102068=>'子单耗材解绑',102069=>'专人专车绩效补充',102070=>'取消工作单',
                          102093=>'生成子血订单',102094=>'取消子血订单'
                        ],
    //客户订单查询类型
    'search_subtype3'=>[102001=>'生成订单',102003=>'确认订单',102033=>'审核订单',102010=>'取件完成',102014=>'发货成功',102020=>'提货成功',102012=>'派件完成'],
	//客户物流信息
	'remark_custsubtype' => [
							102001 => '生成订单', 102002 => '修改订单', 102003 => '确认订单', 102007 => '关闭订单', 102008 => '取消订单',
							102010 => '取件完成', 102012 => '派件完成',
						 	102014 => '调度发货', 102015 => '反馈信息', 102016 => '费用结算', 102019 => '修改备注',102020 => '提货成功',102024 => '反馈数据',102033 =>'审核订单',
                            102045 => '发货成功', 102049 => '申请修改', 102050 => '申请取消', 102051 => '处理申请'
						  ],
	//入库单备注操作子类型
	'remark_subtype3' => [103001 => '生成入库单', 103002 => '修改入库单', 103003 => '指派入库单', 103004 => '修改入库单备注',
						  103005 => '回退入库单', 103006 => '关闭入库单', 103007 => '取消入库单', 103008 => '实际入库',103009 => '附件上传',103010 => '附件删除',],
	//出库单备注操作子类型
	'remark_subtype4' => [104001 => '生成出库单', 104002 => '修改出库单', 104003 => '指派出库单', 104004 => '修改出库单备注',
						  104005 => '回退出库单', 104006 => '关闭出库单', 104007 => '取消出库单', 104008 => '实际出库',104009 => '附件上传',104010 => '附件删除',104011=>'出库单捡药',104012=>'出库单核药',],
	//采购单备注操作子类型
	'remark_subtype5' => [105001 => '生成采购单', 105002 => '修改采购单', 105003 => '审核采购单', 105004 => '指派采购单',    
						  105005 => '修改采购单备注', 105006 => '回退采购单', 105007 => '关闭采购单', 105008 => '取消采购单',
                          105009 => '供应商下单',105010 => '到货确认',105011 => '报账',105012 => '批量审批',105013 => '批量下单'],
	//对账单备注操作子类型
	'remark_subtype6' => [106001 => '生成对账单', 106002 => '修改对账单', 106003 => '指派对账单', 106004 => '修改备注', 106005 => '取消对账单', 106006 => '指派开票',106007=>'作废开票，状态回退',106008 => '踢出结算单',106009 => '获取不含税金额',106010 => '调整税率','106011'=>'发送对账单','106012'=>'确认对账单','106013'=>'发送在线对账单','106014'=>'在线对账客户确认','106015'=>'在线对账客户驳回'],
	//开票单备注操作子类型
	'remark_subtype7' => [107001 => '生成开票单', 107002 => '修改开票单', 107003 => '指派开票单', 107004 => '备注开票单', 107005 => '取消开票单',107006 => '销账',107007 => '确认开票',107008 =>'作废开票',107009 =>'踢除对账单'],
	//收款记录备注子类型
	'remark_subtype8' => [108001 => '生成收款单' , 108002 => '修改收款', 108003 => '指派确认', 108004 => '备注收款', 108005 => '取消收款', 108006 => '清账',108007 =>'审核收款单'],
	//操作表备注子类型
	'remark_opntype' => [109001 => '费用录入' , 109002 => '费用审核', 109003 => '费用批准', 109004 => '费用复核', 109005 => '费用支付',109006 =>'审核不通过'],
	//物资明细操作类型
	'remark_subtype9' => [110001 => '物资录入' , 110002 => '证书上传', 110003 =>'证书删除'],

	//路由管理备注操作子类型
	'remark_subtype10' => [111001 => '录入路由' , 111002 => '审核路由', 111003 =>'修改路由',111004 => '关闭路由'],
	//客户管理备注操作子类型
	'remark_subtype11' => [112001 => '新增客户' , 112002 => '审核客户', 112003 =>'修改客户信息'],
    //移库单备注操作子类型
	'remark_subtype12' => [113001 => '生成移库单' , 113002 => '修改移库单', 113003 =>'移库', 113004 =>'修改备注', 113005 =>'取消移库单', 113006 =>'附件上传'],

	//耗材交接
    'remark_subtype13' => [114001 => '耗材交接' ],


    //报价管理子类型
    'remark_subtype14' => [115001 => '生成报价单',115002=>'修改报价单',115003=>'新增关联客户',115004=>'修改关联信息',115005=>'新增报价明细',115006=>'修改报价明细'],

    //客户合同子类型
    'remark_subtype15'=>[116001=>'添加合同',116002=>'修改合同',116003=>'审核合同'],

    //委托订单修改
    'remark_subtype17'=>[118001 =>'新增委托订单',118002=>'修改委托订单',118003=>'订单取消'],


	//----------------订单配置-------------------204
    //订单类型
	'to_type' => [0 => '标准运输',1=>'耗材订单',2=>'脐血订单',3=>'石药订单',4=>'麦迪郎杰订单'],
    //货物类型
//    'to_goodstype' => [1=>'血样', 2=>'样本' ,3=>'药品', 4=>'其他', ],
    'to_goodstype' => [1=>'临床样本',2=>'回收药',3=>'临床药品',5=>'商业成品药',6=>'脐带血',7=>'细胞CAR-T',8=>'IVD试剂(器械)',9=>'特检普检',10=>'科研样本',4=>'其他物品',11=>'样品'],
    //订单来源
    'to_source' => [1=>'oms系统', 2=>'客户oms系统' ,3=>'微信服务号', 4=>'API接口', 5=>'国际系统',6=>'迈迪朗杰API'],
    //客户系统订单来源
    'to_source2' => [1=>'生生客服',2=>'客户系统' ,3=>'微信服务号', 4=>'第三方系统'],
    //运送时限
	//'to_timelimit' => [1=>'12小时', 2=>'24小时', 3=>'36小时', 4=>'48小时', 6=>'72小时'],
    'to_timelimit' => [1 => '当日达', 2 => '次日达', 4 => '隔日达', 6 => '三日达', 7 => '三日以上'],
    //签单返回状态
    'oi_status' => [1 => '未返回', 2 => '已返回',3 => '已接收',4 => '已签收',5 => '已删除',6=>'已超时'],

	//时效报警（营销监控）   必须与上面运输时限一致
	'to_timelimit_siren' => [1=>2, 2=>4, 3=>6, 4=>8, 6=>10, 7 => 12],
	//运送时限，用于预派时间计算
	'to_timelimitint' => [1=>12, 2=>24, 3=>36, 4=>48, 6=>72, 7 => 96],
    //订单等级
	'to_important' => [0=>'正常', 1=>'精益', 4=>'项目'],
    //运输要求
	   //运输要求
	'to_address' => [1=>'发件地址',2=>'收件地址'],
	'to_trequirement' => [0=>'正常', 2=>'专人(额外收费)', 3=>'专车(额外收费)',4=>'冷藏车专车'],
        'to_business_type' => [2 => '生生仓库出货',0 => '非生生仓库出货'], // 出货仓库配置
    //预取时间选择
    'ol_time_select'=>[
        1=>[0=>'08:00',1=>'10:00',2=>'08:00 ~ 10:00'],
        2=>[0=>'10:00',1=>'12:00',2=>'10:00 ~ 12:00'],
        3=>[0=>'12:00',1=>'14:00',2=>'12:00 ~ 14:00'],
        4=>[0=>'14:00',1=>'16:00',2=>'14:00 ~ 16:00'],
        5=>[0=>'16:00',1=>'18:00',2=>'16:00 ~ 18:00'],
        6=>[0=>'08:00',1=>'12:00',2=>'08:00 ~ 12:00'],
        7=>[0=>'12:00',1=>'18:00',2=>'12:00 ~ 18:00'],
        0=>[0=>'',1=>'',2=>'指定时间'],
    ],
	//运输单，运输温度
	//'to_temperature'=>[11=>'常温',12=>'常温2~20℃',21=>'恒温10~30℃',22=>'恒温15~25℃',23=>'恒温18~30℃',24=>'恒温20~25℃',25=>'恒温10~20℃',26=>'恒温15~30℃',31=>'蓝冰2~8℃',41=>'低温-15~-25℃',51=>'干冰-20~-100℃',61=>'超低温-60~-100℃',71=>'液氮-150~-200℃', 99=>'其他'],

	// 20190331温度范围变更后使用
    'to_temperature'=>[91=>'无温度要求',11=>'常温0~30℃',12=>'常温2~20℃',13=>'常温6~30℃',14=>'常温1~44℃', 31=>'蓝冰2~8℃', 25=>'恒温10~20℃', 21=>'恒温10~30℃',22=>'恒温15~25℃',23=>'恒温18~30℃',24=>'恒温20~25℃',26=>'恒温4~25℃',27=>'恒温8~20℃',28=>'恒温20~30℃',41=>'低温-15~-25℃',51=>'干冰-20~-100℃',61=>'超低温-60~-100℃',71=>'液氮-150~-200℃', 99=>'其他温度要求'],
	// 
	//'to_temperature'=>[11=>'常温0~30℃',12=>'常温2~20℃',21=>'恒温10~30℃',22=>'恒温15~25℃',23=>'恒温18~30℃',24=>'恒温20~25℃',25=>'恒温10~20℃',26=>'恒温15~30℃',31=>'蓝冰2~8℃',32=>'蓝冰0~5℃',41=>'低温-15~-25℃',42=>'低温-10~-30℃',51=>'干冰-20~-90℃',61=>'超低温-60~-90℃',71=>'液氮-90~-200℃', 0=>'其他'],
	//子仓库 仓储温度`to_id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT '运输单序号',
	//'subware_temperature' => [1=>'CW0-30', 2=>'HW15-25', 3=>'HW10-30', 4=>'LC2-8', 5=>'DW-25', 6=>'CDW-70', 7=>'YD-150'],
	//温度计
     'to_thermometer' => [1 => '无温度计', 2 => '生生温度计', 3 => '客户记录仪', 4 => '客户和生生温度计', 5 => '生生+GPS温度计',6 => '生生国际专用温度计',7=>'迈迪朗杰专用温度计',8=>'生生国内+国际温度计',9=>'宴嘉冷链专用温度计','10'=>'生生温湿度计','11'=>'生生国内+质量温度计'],
	//湿度计
	'to_hygrometer' => [1 => '无湿度计', 2 => '生生湿度计', 3 => '客户湿度计', 4 => '客户和生生湿度计', ],
	//工作单打印 温度计简写
	'ow_ther' => [1 => '无', 2 => '生温', 3 => '客温', 4 => '生客', 5=>'生G'],
	//运输单，运输单状态
	'to_status' => [0 => '待确认', 1 => '已确认', 2 => '已取件', 3 => '已发货', 4 => '已提货', 5 => '已派件', 6 => '已反馈', 7 => '已取消', 8 => '已关闭',9=>'已删除'],
    //客户审核状态
    'to_check_status' => [0 => '待审核',1 => '一审', 2 => '二审',5 => '终审'],
	'to_mt_status' => [1 => '已审核',2=>'已取件',3=>'已发货', 5 => '已派件',7 => '已取消', 8 => '已关闭',],
	//派件结存状态
    'to_inbox_status' => [0 => '未结存', 1 => '已结存',],
	//取件结存状态
    'to_outbox_status' => [0 => '未结存', 1 => '已结存',],
	//开票状态
    'to_invoice_status' => [0 => '未开票', 1 => '已开票',],
    //结算状态
    'to_settlement_status' => [0 => '未结算', 1 => '已结算',],
	//是否投保
    'to_insure' => [0 => '不投保', 1 => '投保', ],
	//付款方式 查询和展示
    'to_getcash' => [0 => '有协议月结', 4 => '扫码付现', 1 => '发货方现金', 2 => '收货方现金', 3=>'他方付款'],
    //付款方式 添加
    'to_getcash_2' => [0 => '有协议月结',4 => '扫码付现'],
	//是否开票
    'to_invoice' => [0 => '否', 1 => '是',],
    //温度数据附件状态
    'to_temprecord_status' => [0 => '未上传', 1 => '已上传', ],
    //运输单，核销状态
	'to_verification_status' => [ 0 => '未核销',1 => '核销中',2 => '已核销', ],
	//绩效状态
	'to_performance_status' => [0 => '未绩效', 1 => '异常', 2 => '投诉', 3 => '索赔', 4 => '奖励', ],
	//运输物流信息，货物状态
	'to_goods_status' => [0 => '货物完好',1 => '货物破损',2 => '货物丢失',3 => '货物超温',4 => '货物延时',5 =>'数量不符'],
	//货物类型
	'to_goods_type' => [1 => '临床药品', 2 => '生物样本', 3 => '器械试剂', 4 => '其他货物',],
	//附件上传状态
	'to_file_upload' => [0 => '未上传',1 => '已上传',2 => '签收单据未上传',3 => '温度数据未上传',4=>'校准证书未上传'],
	//仓储，存储温度
	'save_temperature' => [11=>'CW0-30',12=>'CW2-20',21=>'HW10-30',22=>'HW20-30',23=>'HW15-25',24=>'HW15-20',25=>'HW20-25',31=>'LB2-8',41=>'DW-20--30',42 =>'DW-15--25',61=>'CDW-60--90',71=>'YD-90--200',0=>'Others',],
	//'save_temperature' => [0=>'Others', 1=>'CW0-30', 2=>'HW10-30',3=>'HW15-25',4=>'LC2-8',5=>'DW-25',6=>'CDW-70',7=>'YD-150',],
	//运单取消原因
	'cancel_source' => [1 => '客户取消', 2 => '重复订单',],
	'to_receipt' => [1 => '本人签收', 2 => '他人代收'],
	'last_time' => [0 => '超时', 2 => '0-2小时', 4 => '2-4小时'],

	//-------------------采购配置---------------
	//采购类型
	'purchase_type' => [0 => '业务采购', 1 => '元廷采购', 2 => '办公采购', 3 =>'元廷办公采购'],
	//采购单状态
	'purchase_status' => [0 => '新建' , 1 => '已审核', 2 => '已取消', 3 => '已关闭', 4 => '已下单', 5 => '已到货', 6 => '已报账'],
	
	//-------------------出入库配置---------------
	//出入库状态
	'in_iostatus' => [0 => '新建' , 1 => '已取消', 2 =>'已关闭'],
	'out_iostatus' => [0 => '新建' , 1 => '已取消', 2 =>'已关闭'],

    'transport_time' => [1 => '临时' , 2 => '24H' , 3 => '48H' , 4 => '超48H'],


	//出入库类型
    //药品出入库类型
	'in_subtype' => [2 => '常规入库', 4=> '其它入库'],
//	'in_subtype' => [1 => '采购入库', 2 => '常规入库', 3 => '结存入库', 4=> '其它入库', 11=>'盘点入库', 9=>'调拨入库'],
//	'out_subtype' => [5 => '常规出库', 6 => '结存出库', 7 => '报损出库', 8 => '其它出库', 15=>'盘点出库', 10=>'调拨出库'],
	'out_subtype' => [5 => '常规出库', 8 => '其它出库'],

    //耗材出入库类型
    'material_in_subtype' => [1 => '采购入库', 4=> '其它入库'],
    'material_out_subtype' => [7 => '报损出库', 16=> '销售出库' , 17=>'盘亏出库'],

    'detail_subtype' => [1 => '采购入库', 2 => '常规入库', 3 => '领取入库', 4=> '其它入库', 5 => '常规出库', 6 => '领取出库', 7 => '报损出库', 8 => '其它出库',  9=>'调拨入库', 10=>'调拨出库', 11=>'盘点入库', 12=>'归还出库', 13=>'归还入库', 16=> '销售出库' , 17=>'盘亏出库','18'=>'移出出库','19'=>'移入入库'],

    // //其他费用列表的
	'ots_feetype' => [1 => '证件代办费', 2 => '仓储管理费', 3 => '设备耗材费',4 => '劳务支出费', 5 => '其他费用'],
	//------------------对账单配置------------------
	'monthly_statement_type' => [0 =>'未开票', 1 =>'已开票', 2 =>'取消'], 
	'ourbank' => [1 => '工商银行', 2 =>'外币收入' , 3 =>'财务现金',4 =>'其他坏账',5 =>'招商银行',7 => '汇兑损益',8=>'支付宝',9=>'微信'],

	//------------------工作单表表配置------------------
	'ow_type'=>[1=>'取件',2=>'发货',3=>'派件',4=>'提派',5=>'提发',6=>'取派',7=>'提货','8'=>'取存','9'=>'提存','10'=>'存货','11'=>'取发','12'=>'方案调拨'],
	//------------------操作表配置------------------
	'opn_type'=>[1=>'取件',2=>'派件',3=>'发货',4=>'提货'],
	'opn_status'=>[0=>'未录入',1=>'已录入',2=>'已审核',3=>'已批准',4=>'已复核',5=>'已支付',6=>'不通过'],
	//----------------子仓类型配置----------------------

	'sub_type'=>[1=>'耗材仓',2=>'药品仓',5=>'样本仓'],
	//--------------------开票单配置-----------------------
	//开票单所属类型
	'realbill_type' => [0=>'普票', 1=>'专票',2=>'电子发票' ],
	//--------------------其他结算单配置-----------------------
	'ots_feetypes' => [ 1 =>'证件代办费',2 => '仓储管理费', 3 =>'设备耗材费', 4=> '劳务支出费',6=>'免单理赔费',7=>'折扣调整费', 8=>'贴标费用',9=>'验证费用',  5=> '其他费用'],
	'ots_feetype' => [ 1 =>'证件代办费', 3 =>'设备耗材费', 4=> '劳务支出费',6=>'免单理赔费',7=>'折扣调整费', 8=>'贴标费用',9=>'验证费用',  5=> '其他费用'],

	//--------------------税率配置-----------------------
	'tax_rate' => [ 1 =>0, 2 => 0.06, 3 =>0.1, 4 =>0.16, 5 =>0.13, 6 =>0.09],

    //--------------------开票服务类型-----------------------
     //百旺用开票服务
	'rb_type' => [ 1 =>'冷链科技物流服务', 2 => '医药冷链配送服务', 3 =>'仓储费' , 4 =>'租赁费' ,5 =>'销售', 6 => '国际冷链物流', 7 =>'冷链科技物流服务' ,8 =>'仓储费', 9 => '销售', 10 => '租赁费'],
	//管理用开票服务
	'rb_typeoms' => [ 1 =>'冷链科技物流服务 10%', 2 => '医药冷链配送服务 6%', 3 =>'仓储费 6%' , 4 =>'租赁费 16%' , 5 => '销售 16%' , 6 => '国际冷链物流 0%',7 =>'冷链科技物流服务 9%' ,8 =>'仓储费 13%', 9 => '销售 13%', 10 => '租赁费 13%'],
	//开票所用的快递名称
    'rb_express' => [ 1 =>'圆通', 2 => '顺丰'],
    //短信发送状态
    'sl_status' => [1 =>'发送成功', 2 => '发送失败'],
    //管理用申请开票税率
	'rb_rateoms' => [ 1 => 0.1, 2 => 0.06, 3 => 0.06 , 4 => 0.16 , 5 => 0.16, 6=>0, 7 => 0.09 ,8 => 0.13, 9=>0.13,10 => 0.13],

	//--------------------实开发票配置-----------------------
    //实开发票状态
	// 'invoice_status' => [ 1 =>'待开票', 2 => '已开票', 3 =>'预开票' , 4 =>'已作废' ,5 =>'已删除',6=>'已销账'],
	'invoice_status' => [ 1 =>'待开票', 2 => '已开票',  4 =>'已作废' ,5 =>'已删除',6=>'已销账'],
	//开票方式
	'invoice_type' => [ 1 =>'金税开票', 2 => '冲预开票', 3 =>'不开票' ,4=>'电子开票'],
	
	//--------------------质控文件管理配置-----------------------
	//  校准证书有效期配置
	'indate_type' => [ 1 =>'1个月', 2 => '3个月', 3 =>'6个月', 4=> '12个月', 5=> '24个月'],

	//--------------------客户微信账号配置-----------------------
	//  绑定状态
	'we_chat_stutas' => [ 1 =>'已绑定', 2 => '已解绑', 3 =>'待审核'],

		//--------------------外勤操作类型-----------------------
	//  操作类型
	// 'server_type' => [ 1 =>'电脑操作', 2 => 'm3操作', 3 =>'服务号',4 =>'操作号'],
	'server_type' => [ 1 =>'oms系统', 2 => 'm3', 3 =>'微信服务号',4 =>'微信操作号',5 =>'客户oms系统',6=>'API接口',7=>'操作端APP'],
    //外协设备
    'equipment'=>[1=>'冰箱',2=>'恒温箱',3=>'斯特林机',4=>'仓库',5=>'其他'],
	//--------------------用户账号状态-----------------------
	//  用户状态  
	'ur_status' => [ 0 =>'正常', 1 => '锁定'],

	//--------------------外协结算方式-----------------------
	//  外协结算方式
	'oper_type' => [ 0 =>'日结', 1 => '周结', 2 => '运满满',3=>'云南外包'],

    //--------------------办事处配置-----------------------
    'office_type' => [0 => '创建办事处支出',1=>'办事处支出审核',3=>'办事处支出修改',4=>'办事处支出删除',5=>'创建办事处收入',6=>'办事处收入修改',7=>'办事处收入删除',8=>'办事处结转'],

    //--------------------存货配置-----------------------
    'sto_type'=>[ 3010 =>'添加存货',3011=>"修改存货",3012=>'删除存货'],

    //--------------------仓库配置-----------------------
    'house_type'=>[4001=>'修改仓库',
        4002=>'创建一级子仓',4003=>'修改一级子仓',4004=>'冻结一级子仓',
        4005=>'创建二级子仓',4006=>'修改二级子仓',4007=>'冻结二级子仓',
        4008=>'创建三级子仓', 4009=>'修改三级子仓',4010=>'冻结三级子仓'
    ],


    //--------------------指派联系人权限范围-----------------------
	//角色对应关系  25 运营操作主管  13 运营操作专员 30 运营操作组长 36 运营站点操作专员 37 运营站点操作组长
	//  指派给组长角色范围  
	'assign_dr_arr' => [25,30,37],
	//  指派给操作员角色范围  
	'assign_op_arr' => [ 13,25,30,36,37],
	
	// 营销项目角色
	'customer_emp_user' =>  [15,47,55],

	// 投保价值监控额度
	'insure_value'=>50000,
	//短信模板
	'sms' => [ array('title' => '送达通知', 'content' => '您好！[%s]您从%s城市发往%s城市的冷链货物已于%s由%s安全签收，生生物流4000-121-321。') ],

    //邮件模板
    'email' => [
        array('title' => '[%s]送达通知', 
			'content' => '<p>尊敬的客户，您好！<br/> 您%s从%s发往%s的冷链货物已于%s由%s安全签收!<br/> [运输单号：%s]<br/>[项目编号：%s]</p>', 
			'signname' => '<p>如您有任何疑问欢迎致电生生物流.<br/>祝：工作愉快！<br/>客服中心-[%s]<br/>上海生生物流有限公司<br/>客服电话：4000-121-321/021-54296788<br/>接单邮箱：cs@ashsh.cn<br/>服务生物医药，专注冷链物流</p>'
			), 
    ],
	//邮件模板	
    'email2' => [
        array('title' => '[%s]温度数据', 
			'content' => '<p>尊敬的客户，您好！<br/>[项目编号：%s]<br/> 您%s从%s发往%s的物流订单的温度数据如下：</p>', 
			'signname' => '<p>如您有任何疑问欢迎致电生生物流.<br/>祝：工作愉快！<br/>客服中心-[%s]<br/>上海生生物流有限公司<br/>客服电话：4000-121-321/021-54296788<br/>接单邮箱：cs@ashsh.cn<br/>服务生物医药，专注冷链物流</p>'
			), 
    ],
    'time_month'=>array(
			date("Ym")=>date("Ym"),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)+1,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)+1,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)+2,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)+2,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-1,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-1,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-2,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-2,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-3,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-3,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-4,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-4,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-5,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-5,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-6,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-6,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-7,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-7,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-8,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-8,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-9,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-9,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-10,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-10,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-11,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-11,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-12,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-12,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-13,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-13,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-14,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-14,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-15,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-15,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-16,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-16,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-17,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-17,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-18,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-18,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-19,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-19,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-20,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-20,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-21,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-21,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-22,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-22,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-23,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-23,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-24,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-24,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-25,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-25,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-26,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-26,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-27,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-27,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-28,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-28,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-29,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-29,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-30,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-30,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-31,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-31,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-32,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-32,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-33,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-33,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-34,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-34,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-35,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-35,1,substr(date("Ym"),0,4))),
			date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-36,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-36,1,substr(date("Ym"),0,4)))
		),
    //校准机构类型
    'at_mechanism' => [1=>'生生内校',2=>'厂家校准',3=>'第三方校准-检测机构',4=>'第三方校准-计量院'],
    'relation_status' => [0=>'待确认',1=>'正常',2=>'锁定'],
    //客户领域
    'customer_area' => [1=>'科研',2=>'商业'],
    //城市类别
    'city_category' => [1=>'一类',2=>'二类',3=>'三类',4=>'四类',5=>'五类',6=>'特类',7=>'省内',8=>'同城'],

    //-------------------质控异常分类-------------------
    //一级异常
    'qc_one_ab' => [1 => '温度数据异常', 2 => '丢破异常', 3 => '出入库异常'],
    //二级异常
    'qc_two_ab' => [
        1 => [
             2 => '包装不规范', 3 => '换箱不规范',  5 => '开启超温', 4 => '干冰波动大', 6 => '开启后超温', 10 => '取件不规范',
            11 => '未正常开启',8 => '派件不规范', 9 => '未正常关闭', 7 => '模板错误',   12 => '数据丢失',  13 => '温度计异常', 
            14 => '湿度超标',1 => 'SOP不合格', 15 => '其他'
        ],
        2 => [1 => '丢失', 2 => '破损'],
        3 => [1 => '出库', 2 => '入库']
    ],
    //三级异常
    'qc_thr_ab' => [
        1 => [
            2 =>  [1 => '前期超温', 2 => '后期超温', 3 => '全程超温', 4 =>'包装时开启温度计'],
            3 =>  [1 => '换箱高温', 2 => '换箱低温', 3 => '未换箱'],
            4 =>  [1 => '取件波动', 2 => '路由波动', 3 => '派件波动'],
            5 =>  [1 => '开启高温', 2 => '开启低温'],
            6 =>  [1 => '药品',     2 => '样本'],
            7 =>  [1 => '温区', 	   2 => '记录间隔', 3 => '标题' , 4 => '时间'],
            9 =>  [1 => '早关',     2 => '晚关'],
            10 => [1 => '提前开温度计', 2 => '运单信息填写错误'],
            8 =>  [1 => '关闭超温', 2 => '运单信息填写错误'],
            11 => [1 => '未开',    2 => '晚开',     3 =>'开启后关闭'],
            13 => [1 => '序列号不符', 2 => '波动异常', 3 => '提前关闭ERR', 4 => '提前关闭无ERR', 5 => '白屏', 6 => '其他']
        ],
        2 => [
            1 => [1 => '药品', 2 => '样本', 3 => '客户文件']
        ],
    ],
    //异常操作日志
    'qc_log_type' => [101 => '异常', 101 => '理赔', 102 => '投诉'],
    'qc_log_subtype' => [
            101 => [ 1 => '创建异常', 2 => '异常调查', 3 => '责任部门', 4 => '质量中心', 5 => '修改调查', 6 => '数据上传', 7 => '关闭异常'],
    ],
    //客户级别
    'customer_level'=>[
        1=>'A重要',
        2=>'B普通',
        3=>'BA潜力',
    ],
    //客户结算类型
    'knot_type'=>[
        1=>'现结',
        2=>'月结',
        // 3=>'季结',
        // 4=>'其他',
    ],
    //合同类型
    'contract_type'=>[
        1=>'物流',
        2=>'仓储',
        3=>'销毁',
        5=>'冷链服务',
        6=>'补充协议',
        7=>'报价表',
        8=>'货运',
        9=>'保险',
        10=>'采购',
        11=>'保密协议',
        12=>'赔偿',
        13=>'租赁合同',
        14=>'质量',
        4=>'其他',
    ],
    //活动类型
    'activity_type'=>[
        1=>'展商参会',
        2=>'个人参会',
        3=>'网络广告营销',
    ],
    //活动状态
    'activity_status'=>[
        1=>'计划中',
        2=>'已购买',
        3=>'已结束',
        4=>'已取消',
    ],
    //工作类型
    'work_type'=>[
        1=>'开发新客户',
        2=>'开发老客户新项目',
        3=>'维护客情关系',
        4=>'维护对账回款',
        5=>'维护投诉协调',
        6=>'活动参加展会',
        7=>'其他事宜',
    ],
    //客户来源
    'customer_source'=>[
        1=>'自己开发',
        2=>'公司分配',
        3=>'一线反馈',
    ],
    //客户状态
    'customer_status'=>[
        1=>'需求确定',
        2=>'方案报价',
        3=>'谈判审核',
        4=>'已签合约',
        5=>'正常合作',
    ],
    //收费类型
    'charge_type'=>[
        1=>'温度记录',
        2=>'法定假日',
        3=>'操作空跑',
        4=>'超长等待',
        5=>'超远距离',
        6=>'签单返回',
    ],
    //温度记录类型货物类型
    'temperature_record_type'=>[
        1=>'2-8℃',
        2=>'10-15℃',
    ],
    //费用类型
    'cost_type'=>[
        1=>'普通',
        2=>'特殊',
    ],
    //鼎为温度计升级编号设定
    'ding_number'=>[
        'T21600E7','T215002E','T2150058','T2160017','T216010E','T0170039'
    ],
'duty_push_key'=>'9f2ff9a5-c167-4b82-92df-f971ebf6b8e0',
    //嘉和部门分类
    'ol_static_class'=>[
        1 => '上游工艺部（USP）',
        2 => '下游工艺部 （DSP）',
        3 => '质量控制部（QC）',
        4 => '分析与制剂开发部(ASF)',
        5 => '新药研发部（PR&D）',
        6 => '临床生产部（PR)',
        7 => '临床医学部'
    ],
    //计划箱型类型,1.VIP类 2 EP类  3.液氮类 4.其他
    'odplboxs'=>[
        '0'=>['sto_id'=>'200648','sto_name'=>'VIP6N保温箱','type'=>'1'],
        '1'=>['sto_id'=>'27','sto_name'=>'VIP12保温箱','type'=>'1'],
        '2'=>['sto_id'=>'25','sto_name'=>'VIP16保温箱','type'=>'1'],
        '3'=>['sto_id'=>'24','sto_name'=>'VIP28保温箱','type'=>'1'],
        '4'=>['sto_id'=>'200646','sto_name'=>'VIP36保温箱','type'=>'1'],
        '5'=>['sto_id'=>'20','sto_name'=>'VIP56保温箱','type'=>'1'],
        '6'=>['sto_id'=>'21','sto_name'=>'VIP96保温箱','type'=>'1'],
        '7'=>['sto_id'=>'201417','sto_name'=>'VIP100保温箱','type'=>'1'],
        '8'=>['sto_id'=>'201418','sto_name'=>'VIP168保温箱','type'=>'1'],
        '9'=>['sto_id'=>'205996','sto_name'=>'VIP28保温箱-套箱','type'=>'1'],
        '10'=>['sto_id'=>'205997','sto_name'=>'VIP56保温箱-套箱','type'=>'1'],
        '11'=>['sto_id'=>'205998','sto_name'=>'VIP96保温箱-套箱','type'=>'1'],
        '12'=>['sto_id'=>'205465','sto_name'=>'VIP6N保温箱-外显','type'=>'1'],
        '13'=>['sto_id'=>'205466','sto_name'=>'VIP16保温箱-外显','type'=>'1'],
        '14'=>['sto_id'=>'205467','sto_name'=>'VIP28保温箱-外显','type'=>'1'],
        '15'=>['sto_id'=>'205468','sto_name'=>'VIP36保温箱-外显','type'=>'1'],
        '16'=>['sto_id'=>'205469','sto_name'=>'VIP56保温箱-外显','type'=>'1'],
        '17'=>['sto_id'=>'205261','sto_name'=>'VIP96保温箱-外显','type'=>'1'],
        '18'=>['sto_id'=>'205262','sto_name'=>'VIP100保温箱-外显','type'=>'1'],
        '19'=>['sto_id'=>'204956','sto_name'=>'EP6泡沫箱','type'=>'2'],
        '20'=>['sto_id'=>'204957','sto_name'=>'EP15泡沫箱','type'=>'2'],
        '21'=>['sto_id'=>'204958','sto_name'=>'EP25泡沫箱','type'=>'2'],
        '22'=>['sto_id'=>'205263','sto_name'=>'EP53泡沫箱','type'=>'2'],
        '23'=>['sto_id'=>'205264','sto_name'=>'EP133泡沫箱','type'=>'2'],
        '24'=>['sto_id'=>'202874','sto_name'=>'液氮罐','type'=>'3'],
        '25'=>['sto_id'=>'206112','sto_name'=>'脐血库专用','type'=>'4'],
        '26'=>['sto_id'=>'202758','sto_name'=>'客户包装','type'=>'4'],
        '30'=>['sto_id'=>'207378','sto_name'=>'客户包装-托盘','type'=>'4'],
        '31'=>['sto_id'=>'207379','sto_name'=>'客户包装-非托盘','type'=>'4'],
        '27'=>['sto_id'=>'206869','sto_name'=>'合件专用包装','type'=>'4'],
        '28'=>['sto_id'=>'206860','sto_name'=>'协和发酵专用套箱-大号','type'=>'5'],
        '29'=>['sto_id'=>'206861','sto_name'=>'协和发酵专用套箱-小号','type'=>'5'],
    ],
	//工单类型
	'work_order_type'=>[
		'1' => '温度异常',
		'2' => '运输时效',
		'3' => '运输要求',
        '4' => '其他',
		'5' => '投保'
	],

    //城市规定时效
    'Prescribedtime' => [
        1=> ['name'=>'北京市','time'=>'48'],
        2=> ['name'=>'天津市','time'=>'48'],
        3=> ['name'=>'上海市','time'=>'72'],
        4=> ['name'=>'重庆市','time'=>'48'],
        5=> ['name'=>'安庆市','time'=>'96'],
        6=> ['name'=>'蚌埠市','time'=>'96'],
        7=> ['name'=>'亳州市','time'=>'96'],
        8=> ['name'=>'巢湖市','time'=>'96'],
        9=> ['name'=>'马鞍山市','time'=>'96'],
        10=> ['name'=>'池州市','time'=>'96'],
        11=> ['name'=>'滁州市','time'=>'96'],
        12=> ['name'=>'丹阳市','time'=>'96'],
        13=> ['name'=>'阜阳市','time'=>'96'],
        14=> ['name'=>'山南市','time'=>'96'],
        15=> ['name'=>'宿州市','time'=>'96'],
        16=> ['name'=>'太和市','time'=>'96'],
        17=> ['name'=>'合肥市','time'=>'96'],
        18=> ['name'=>'淮北市','time'=>'96'],
        19=> ['name'=>'淮南市','time'=>'96'],
        20=> ['name'=>'黄山市','time'=>'96'],
        21=> ['name'=>'铜陵市','time'=>'96'],
        22=> ['name'=>'芜湖市','time'=>'96'],
        23=> ['name'=>'界首市','time'=>'96'],
        24=> ['name'=>'六安市','time'=>'96'],
        25=> ['name'=>'宣城市','time'=>'96'],
      //  26=> ['name'=>'阜南县市','time'=>'96'],
       // 27=> ['name'=>'寿县市','time'=>'96'],
        28=> ['name'=>'龙岩市','time'=>'96'],
        29=> ['name'=>'南平市','time'=>'96'],
        30=> ['name'=>'宁德市','time'=>'96'],
        31=> ['name'=>'莆田市','time'=>'96'],
        32=> ['name'=>'福州市','time'=>'72'],
        33=> ['name'=>'泉州市','time'=>'96'],
        34=> ['name'=>'三明市','time'=>'96'],
        35=> ['name'=>'邵武市','time'=>'96'],
        36=> ['name'=>'厦门市','time'=>'72'],
        37=> ['name'=>'漳州市','time'=>'96'],
        38=> ['name'=>'建瓯市','time'=>'96'],
        39=> ['name'=>'古田市','time'=>'96'],
        40=> ['name'=>'白银市','time'=>'96'],
        41=> ['name'=>'陇南市','time'=>'96'],
        42=> ['name'=>'平凉市','time'=>'96'],
        43=> ['name'=>'定西市','time'=>'96'],
        44=> ['name'=>'甘南市','time'=>'96'],
        45=> ['name'=>'皋兰县市','time'=>'96'],
        46=> ['name'=>'嘉峪关市','time'=>'96'],
        47=> ['name'=>'天水市','time'=>'96'],
        48=> ['name'=>'武威市','time'=>'96'],
        49=> ['name'=>'庆阳市','time'=>'96'],
        50=> ['name'=>'金昌市','time'=>'96'],
        51=> ['name'=>'酒泉市','time'=>'96'],
        52=> ['name'=>'兰州市','time'=>'72'],
        53=> ['name'=>'临夏市','time'=>'96'],
        54=> ['name'=>'张掖市','time'=>'96'],
      //  55=> ['name'=>'榆中县市','time'=>'96'],
        56=> ['name'=>'潮州市','time'=>'72'],
        57=> ['name'=>'茂名市','time'=>'72'],
        58=> ['name'=>'梅州市','time'=>'96'],
        59=> ['name'=>'普宁市','time'=>'96'],
        60=> ['name'=>'清远市','time'=>'72'],
        61=> ['name'=>'东莞市','time'=>'72'],
        62=> ['name'=>'佛山市','time'=>'72'],
        63=> ['name'=>'汕头市','time'=>'96'],
        64=> ['name'=>'汕尾市','time'=>'96'],
        65=> ['name'=>'韶关市','time'=>'96'],
        66=> ['name'=>'深圳市','time'=>'72'],
        67=> ['name'=>'四会市','time'=>'72'],
        68=> ['name'=>'中山市','time'=>'72'],
        69=> ['name'=>'河源市','time'=>'96'],
        70=> ['name'=>'惠州市','time'=>'72'],
        71=> ['name'=>'珠海市','time'=>'72'],
        72=> ['name'=>'广州市','time'=>'72'],
        73=> ['name'=>'江门市','time'=>'72'],
        74=> ['name'=>'揭阳市','time'=>'96'],
        75=> ['name'=>'阳江市','time'=>'96'],
        76=> ['name'=>'云浮市','time'=>'96'],
        77=> ['name'=>'湛江市','time'=>'72'],
        78=> ['name'=>'肇庆市','time'=>'72'],
        79=> ['name'=>'增城市市','time'=>'72'],
        80=> ['name'=>'百色市','time'=>'96'],
        81=> ['name'=>'北海市','time'=>'96'],
        82=> ['name'=>'南宁市','time'=>'72'],
        83=> ['name'=>'钦州市','time'=>'96'],
        84=> ['name'=>'崇左市','time'=>'96'],
        85=> ['name'=>'防城港市','time'=>'96'],
        86=> ['name'=>'河池市','time'=>'96'],
        87=> ['name'=>'贺州市','time'=>'96'],
        88=> ['name'=>'梧州市','time'=>'96'],
        89=> ['name'=>'桂林市','time'=>'96'],
        90=> ['name'=>'贵港市','time'=>'96'],
        91=> ['name'=>'来宾市','time'=>'96'],
        92=> ['name'=>'玉林市','time'=>'96'],
        93=> ['name'=>'柳州市','time'=>'72'],
        94=> ['name'=>'宜春市','time'=>'96'],
       // 95=> ['name'=>'柳江县市','time'=>'96'],
        96=> ['name'=>'安顺市','time'=>'96'],
        97=> ['name'=>'毕节市','time'=>'96'],
        98=> ['name'=>'黔东南苗族侗族自治州','time'=>'96'],
        99=> ['name'=>'黔南布依族苗族自治州','time'=>'96'],
        //100=> ['name'=>'黔西南市','time'=>'96'],
        101=> ['name'=>'遵义市','time'=>'96'],
        102=> ['name'=>'贵阳市','time'=>'72'],
        103=> ['name'=>'铜仁市','time'=>'96'],
        104=> ['name'=>'六盘水市','time'=>'96'],
        105=> ['name'=>'白沙市','time'=>'96'],
        106=> ['name'=>'保亭市','time'=>'96'],
        107=> ['name'=>'儋州市','time'=>'96'],
        108=> ['name'=>'定安市','time'=>'96'],
        109=> ['name'=>'东方市','time'=>'96'],
        110=> ['name'=>'三亚市','time'=>'72'],
        111=> ['name'=>'澄迈市','time'=>'96'],
        112=> ['name'=>'海口市','time'=>'72'],
        113=> ['name'=>'屯昌市','time'=>'96'],
        114=> ['name'=>'万宁市','time'=>'96'],
        115=> ['name'=>'文昌市','time'=>'96'],
        116=> ['name'=>'乐东市','time'=>'96'],
        117=> ['name'=>'临高市','time'=>'96'],
        118=> ['name'=>'陵水市','time'=>'96'],
        119=> ['name'=>'琼中市','time'=>'96'],
        120=> ['name'=>'琼海市','time'=>'96'],
        121=> ['name'=>'保定市','time'=>'72'],
        122=> ['name'=>'沧州市','time'=>'72'],
        123=> ['name'=>'秦皇岛市','time'=>'72'],
        124=> ['name'=>'唐山市','time'=>'72'],
        125=> ['name'=>'承德市','time'=>'72'],
        126=> ['name'=>'任丘市','time'=>'72'],
        127=> ['name'=>'石家庄市','time'=>'72'],
       // 128=> ['name'=>'正定县市','time'=>'72'],
        129=> ['name'=>'邯郸市','time'=>'72'],
        130=> ['name'=>'衡水市','time'=>'72'],
        //131=> ['name'=>'望都县市','time'=>'96'],
        132=> ['name'=>'廊坊市','time'=>'72'],
        133=> ['name'=>'邢台市','time'=>'72'],
        134=> ['name'=>'张家口市','time'=>'72'],
        135=> ['name'=>'迁安市','time'=>'72'],
        136=> ['name'=>'衡水市','time'=>'72'],
        //137=> ['name'=>'宁晋县市','time'=>'72'],
        138=> ['name'=>'平乡市','time'=>'72'],
        139=> ['name'=>'安阳市','time'=>'96'],
        140=> ['name'=>'洛阳市','time'=>'96'],
        141=> ['name'=>'漯河市','time'=>'96'],
        142=> ['name'=>'南阳市','time'=>'96'],
        143=> ['name'=>'平顶山市','time'=>'96'],
        144=> ['name'=>'濮阳市','time'=>'96'],
        145=> ['name'=>'信阳市','time'=>'96'],
        146=> ['name'=>'周口市','time'=>'96'],
        147=> ['name'=>'郑州市','time'=>'72'],
        148=> ['name'=>'三门峡市','time'=>'96'],
        149=> ['name'=>'商丘市','time'=>'96'],
        150=> ['name'=>'鹤壁市','time'=>'96'],
        151=> ['name'=>'济源市','time'=>'96'],
        152=> ['name'=>'驻马店市','time'=>'96'],
        153=> ['name'=>'焦作市','time'=>'96'],
        154=> ['name'=>'开封市','time'=>'96'],
        155=> ['name'=>'许昌市','time'=>'96'],
        156=> ['name'=>'新乡市','time'=>'96'],
        157=> ['name'=>'牡丹江市','time'=>'48'],
        158=> ['name'=>'七台河市','time'=>'48'],
        159=> ['name'=>'齐齐哈尔市','time'=>'48'],
        160=> ['name'=>'大庆市','time'=>'48'],
        161=> ['name'=>'大兴安岭市','time'=>'72'],
        162=> ['name'=>'双鸭山市','time'=>'48'],
        163=> ['name'=>'绥化市','time'=>'48'],
        164=> ['name'=>'哈尔滨市','time'=>'24'],
        165=> ['name'=>'鹤岗市','time'=>'48'],
        166=> ['name'=>'黑河市','time'=>'48'],
        167=> ['name'=>'鸡西市','time'=>'48'],
        168=> ['name'=>'佳木斯市','time'=>'48'],
        169=> ['name'=>'伊春市','time'=>'48'],
        170=> ['name'=>'富锦市','time'=>'72'],
        171=> ['name'=>'潜江市','time'=>'96'],
        172=> ['name'=>'当阳市','time'=>'120'],
        173=> ['name'=>'鄂州市','time'=>'96'],
        174=> ['name'=>'恩施市','time'=>'120'],
        175=> ['name'=>'神农架市','time'=>'96'],
        176=> ['name'=>'十堰市','time'=>'96'],
        177=> ['name'=>'随州市','time'=>'96'],
        178=> ['name'=>'黄冈市','time'=>'96'],
        179=> ['name'=>'黄石市','time'=>'96'],
        180=> ['name'=>'天门市','time'=>'96'],
        181=> ['name'=>'武汉市','time'=>'72'],
        182=> ['name'=>'仙桃市','time'=>'96'],
        183=> ['name'=>'咸宁市','time'=>'96'],
        184=> ['name'=>'襄阳市','time'=>'96'],
        185=> ['name'=>'襄樊市','time'=>'96'],
        186=> ['name'=>'孝感市','time'=>'96'],
       // 187=> ['name'=>'京山县市','time'=>'120'],
        188=> ['name'=>'荆门市','time'=>'96'],
        189=> ['name'=>'荆州市','time'=>'96'],
        190=> ['name'=>'宜昌市','time'=>'72'],
        191=> ['name'=>'竹溪市','time'=>'120'],
        192=> ['name'=>'长沙市','time'=>'72'],
        193=> ['name'=>'常德市','time'=>'96'],
        194=> ['name'=>'娄底市','time'=>'96'],
        195=> ['name'=>'株洲市','time'=>'96'],
        196=> ['name'=>'郴州市','time'=>'96'],
        197=> ['name'=>'邵阳市','time'=>'96'],
        198=> ['name'=>'衡阳市','time'=>'96'],
        199=> ['name'=>'怀化市','time'=>'96'],
        200=> ['name'=>'湘潭市','time'=>'96'],
        201=> ['name'=>'湘西市','time'=>'96'],
        202=> ['name'=>'浏阳市','time'=>'96'],
        203=> ['name'=>'益阳市','time'=>'96'],
        204=> ['name'=>'永州市','time'=>'96'],
        205=> ['name'=>'岳阳市','time'=>'96'],
        206=> ['name'=>'张家界市','time'=>'96'],
        207=> ['name'=>'吉首市','time'=>'96'],
        208=> ['name'=>'白城市','time'=>'24'],
        209=> ['name'=>'白山市','time'=>'48'],
        210=> ['name'=>'长春市','time'=>'12'],
        211=> ['name'=>'四平市','time'=>'24'],
        212=> ['name'=>'松原市','time'=>'24'],
        213=> ['name'=>'吉林市','time'=>'24'],
        214=> ['name'=>'通化市','time'=>'48'],
        215=> ['name'=>'辽源市','time'=>'24'],
        216=> ['name'=>'延边市','time'=>'48'],
        217=> ['name'=>'梅河市','time'=>'48'],
        218=> ['name'=>'常州市','time'=>'72'],
        219=> ['name'=>'兴化市','time'=>'96'],
        220=> ['name'=>'泰州市','time'=>'96'],
        221=> ['name'=>'南京市','time'=>'48'],
        222=> ['name'=>'南通市','time'=>'72'],
        223=> ['name'=>'如皋市市','time'=>'96'],
       // 224=> ['name'=>'泗阳县市','time'=>'96'],
        225=> ['name'=>'苏州市','time'=>'72'],
        226=> ['name'=>'宿迁市','time'=>'96'],
        227=> ['name'=>'镇江市','time'=>'96'],
        228=> ['name'=>'淮安市','time'=>'96'],
        229=> ['name'=>'江阴市','time'=>'96'],
        230=> ['name'=>'无锡市','time'=>'96'],
        231=> ['name'=>'吴江市','time'=>'96'],
        232=> ['name'=>'响水市','time'=>'96'],
        233=> ['name'=>'金湖市','time'=>'96'],
        234=> ['name'=>'连云港市','time'=>'96'],
        235=> ['name'=>'溧阳市市','time'=>'96'],
        236=> ['name'=>'徐州市','time'=>'96'],
        237=> ['name'=>'盐城市','time'=>'72'],
        238=> ['name'=>'扬州市','time'=>'96'],
       // 239=> ['name'=>'扬州宝应县市','time'=>'96'],
        240=> ['name'=>'仪征市','time'=>'96'],
        241=> ['name'=>'太仓市','time'=>'96'],
        242=> ['name'=>'常熟市','time'=>'96'],
        243=> ['name'=>'沐阳县市','time'=>'96'],
        244=> ['name'=>'昌江市','time'=>'96'],
        245=> ['name'=>'新余市','time'=>'96'],
        246=> ['name'=>'南昌市','time'=>'72'],
        247=> ['name'=>'萍乡市','time'=>'96'],
        248=> ['name'=>'抚州市','time'=>'96'],
        249=> ['name'=>'赣州市','time'=>'96'],
        250=> ['name'=>'上饶市','time'=>'96'],
        251=> ['name'=>'吉安市','time'=>'96'],
        252=> ['name'=>'景德镇市','time'=>'96'],
        253=> ['name'=>'九江市','time'=>'96'],
        254=> ['name'=>'宜春市','time'=>'96'],
        255=> ['name'=>'鹰潭市','time'=>'96'],
        256=> ['name'=>'樟树市','time'=>'96'],
        257=> ['name'=>'德兴市','time'=>'96'],
        258=> ['name'=>'鞍山市','time'=>'48'],
        259=> ['name'=>'本溪市','time'=>'48'],
        260=> ['name'=>'朝阳市','time'=>'48'],
        261=> ['name'=>'盘锦市','time'=>'48'],
        262=> ['name'=>'大连市','time'=>'48'],
        263=> ['name'=>'丹东市','time'=>'48'],
        264=> ['name'=>'抚顺市','time'=>'48'],
        265=> ['name'=>'阜新市','time'=>'48'],
        266=> ['name'=>'沈阳市','time'=>'24'],
        267=> ['name'=>'葫芦岛市','time'=>'48'],
        268=> ['name'=>'铁岭市','time'=>'48'],
        269=> ['name'=>'锦州市','time'=>'48'],
        270=> ['name'=>'辽阳市','time'=>'48'],
        271=> ['name'=>'营口市','time'=>'48'],
        272=> ['name'=>'阿拉善盟','time'=>'96'],
        273=> ['name'=>'巴彦淖尔','time'=>'96'],
        274=> ['name'=>'包头市','time'=>'72'],
        275=> ['name'=>'赤峰市','time'=>'96'],
        276=> ['name'=>'鄂尔多斯市','time'=>'96'],
        277=> ['name'=>'海西蒙古族藏族自治州','time'=>'96'],
        278=> ['name'=>'呼和浩特市','time'=>'72'],
        279=> ['name'=>'呼伦贝尔市','time'=>'96'],
        280=> ['name'=>'通辽市','time'=>'72'],
        281=> ['name'=>'乌海市','time'=>'96'],
        282=> ['name'=>'乌兰察布市','time'=>'96'],
        283=> ['name'=>'锡林郭勒盟','time'=>'96'],
        284=> ['name'=>'兴安盟','time'=>'96'],
        285=> ['name'=>'伊犁哈萨克自治州','time'=>'96'],
        286=> ['name'=>'乌兰浩特市','time'=>'96'],
        287=> ['name'=>'固原市','time'=>'96'],
        288=> ['name'=>'中卫市','time'=>'96'],
        289=> ['name'=>'石嘴山市','time'=>'96'],
        290=> ['name'=>'吴忠市','time'=>'96'],
        291=> ['name'=>'银川市','time'=>'72'],
        292=> ['name'=>'格尔木市','time'=>'96'],
        293=> ['name'=>'果洛市','time'=>'96'],
        294=> ['name'=>'海北市','time'=>'96'],
        295=> ['name'=>'海东市','time'=>'96'],
        296=> ['name'=>'黄南市','time'=>'96'],
        297=> ['name'=>'西宁市','time'=>'72'],
        298=> ['name'=>'玉树市','time'=>'96'],
        299=> ['name'=>'滨州市','time'=>'72'],
        300=> ['name'=>'博州市','time'=>'72'],
        301=> ['name'=>'青岛市','time'=>'72'],
        302=> ['name'=>'泰安市','time'=>'72'],
        303=> ['name'=>'德州市','time'=>'72'],
        304=> ['name'=>'东营市','time'=>'72'],
        305=> ['name'=>'日照市','time'=>'72'],
        306=> ['name'=>'河泽市','time'=>'72'],
        307=> ['name'=>'济南市','time'=>'72'],
        308=> ['name'=>'济宁市','time'=>'72'],
        309=> ['name'=>'威海市','time'=>'72'],
        310=> ['name'=>'潍坊市','time'=>'72'],
        311=> ['name'=>'莱芜市','time'=>'72'],
        312=> ['name'=>'聊城市','time'=>'72'],
        313=> ['name'=>'临沂市','time'=>'72'],
        314=> ['name'=>'淄博市','time'=>'72'],
        315=> ['name'=>'烟台市','time'=>'72'],
        316=> ['name'=>'枣庄市','time'=>'72'],
        317=> ['name'=>'滕州市','time'=>'72'],
        318=> ['name'=>'长治市','time'=>'72'],
        319=> ['name'=>'吕梁市','time'=>'72'],
        320=> ['name'=>'大同市','time'=>'72'],
        321=> ['name'=>'朔州市','time'=>'72'],
        322=> ['name'=>'太原市','time'=>'48'],
        323=> ['name'=>'忻州市','time'=>'72'],
        324=> ['name'=>'晋城市','time'=>'72'],
        325=> ['name'=>'晋中市','time'=>'72'],
        326=> ['name'=>'临汾市','time'=>'72'],
        327=> ['name'=>'阳泉市','time'=>'72'],
        328=> ['name'=>'运城市','time'=>'72'],
        329=> ['name'=>'安康市','time'=>'96'],
        330=> ['name'=>'宝鸡市','time'=>'96'],
        331=> ['name'=>'商洛市','time'=>'96'],
        332=> ['name'=>'汉中市','time'=>'96'],
        333=> ['name'=>'铜川市','time'=>'96'],
        334=> ['name'=>'渭南市','time'=>'96'],
        335=> ['name'=>'西安市','time'=>'48'],
        336=> ['name'=>'咸阳市','time'=>'72'],
        337=> ['name'=>'延安市','time'=>'72'],
        338=> ['name'=>'杨凌市','time'=>'96'],
        339=> ['name'=>'榆林市','time'=>'96'],
        340=> ['name'=>'阿坝市','time'=>'96'],
        341=> ['name'=>'巴中市','time'=>'96'],
        342=> ['name'=>'巴州市','time'=>'96'],
        343=> ['name'=>'泸州市','time'=>'96'],
        344=> ['name'=>'眉山市','time'=>'96'],
        345=> ['name'=>'绵阳市','time'=>'72'],
        346=> ['name'=>'内江市','time'=>'96'],
        347=> ['name'=>'南充市','time'=>'96'],
        348=> ['name'=>'攀枝花市','time'=>'96'],
        349=> ['name'=>'自贡市','time'=>'96'],
        350=> ['name'=>'达州市','time'=>'96'],
        351=> ['name'=>'德阳市','time'=>'96'],
        352=> ['name'=>'甘孜市','time'=>'96'],
        353=> ['name'=>'广汉市','time'=>'96'],
        354=> ['name'=>'广安市','time'=>'96'],
        355=> ['name'=>'广元市','time'=>'96'],
        356=> ['name'=>'遂宁市','time'=>'96'],
        357=> ['name'=>'成都市','time'=>'48'],
        358=> ['name'=>'西昌市','time'=>'96'],
        359=> ['name'=>'乐山市','time'=>'96'],
        360=> ['name'=>'凉山市','time'=>'96'],
        361=> ['name'=>'资阳市','time'=>'96'],
        362=> ['name'=>'雅安市','time'=>'96'],
        363=> ['name'=>'宜宾市','time'=>'96'],
        364=> ['name'=>'阿里市','time'=>'96'],
        365=> ['name'=>'昌都市','time'=>'96'],
        366=> ['name'=>'那曲市','time'=>'96'],
        367=> ['name'=>'日喀则地区','time'=>'96'],
        368=> ['name'=>'拉萨市','time'=>'72'],
        369=> ['name'=>'林芝地区','time'=>'96'],
        370=> ['name'=>'阿克苏地区','time'=>'96'],
        371=> ['name'=>'阿拉尔市','time'=>'96'],
        372=> ['name'=>'阿勒泰地区','time'=>'96'],
        373=> ['name'=>'昌吉回族自治州','time'=>'96'],
        374=> ['name'=>'石河子市','time'=>'96'],
        375=> ['name'=>'塔城地区','time'=>'96'],
        376=> ['name'=>'哈密地区','time'=>'96'],
        377=> ['name'=>'和田地区','time'=>'96'],
        378=> ['name'=>'吐鲁番地区','time'=>'96'],
        379=> ['name'=>'乌鲁木齐市','time'=>'72'],
        380=> ['name'=>'喀什地区','time'=>'96'],
        381=> ['name'=>'库尔勒市','time'=>'96'],
        382=> ['name'=>'克拉玛依市','time'=>'96'],
        383=> ['name'=>'克孜勒苏柯尔克孜自治州','time'=>'96'],
        384=> ['name'=>'保山市','time'=>'96'],
        385=> ['name'=>'怒江傈僳族自治州','time'=>'96'],
        386=> ['name'=>'普洱市','time'=>'96'],
        387=> ['name'=>'楚雄彝族自治州','time'=>'96'],
        388=> ['name'=>'大理市','time'=>'96'],
       // 389=> ['name'=>'德宏州芒市','time'=>'96'],
        390=> ['name'=>'德宏傣族景颇族自治州','time'=>'96'],
        391=> ['name'=>'迪庆藏族自治州','time'=>'96'],
        392=> ['name'=>'红河哈尼族彝族自治州','time'=>'96'],
        393=> ['name'=>'文山壮族苗族自治州','time'=>'96'],
        394=> ['name'=>'西双版纳傣族自治州','time'=>'96'],
        395=> ['name'=>'昆明市','time'=>'72'],
        396=> ['name'=>'丽江市','time'=>'96'],
        397=> ['name'=>'临沧市','time'=>'96'],
        //398=> ['name'=>'砚山县市','time'=>'96'],
        399=> ['name'=>'玉溪市','time'=>'96'],
        400=> ['name'=>'昭通市','time'=>'96'],
        401=> ['name'=>'曲靖市','time'=>'96'],
        402=> ['name'=>'舟山市','time'=>'72'],
        403=> ['name'=>'宁波市','time'=>'72'],
        404=> ['name'=>'衢州市','time'=>'96'],
        405=> ['name'=>'瑞安市','time'=>'72'],
        406=> ['name'=>'绍兴市','time'=>'72'],
        407=> ['name'=>'台州市','time'=>'72'],
        408=> ['name'=>'杭州市','time'=>'72'],
        409=> ['name'=>'湖州市','time'=>'72'],
        410=> ['name'=>'嘉兴市','time'=>'72'],
        411=> ['name'=>'温州市','time'=>'72'],
        412=> ['name'=>'金华市','time'=>'72'],
        413=> ['name'=>'丽水市','time'=>'72'],
        414=> ['name'=>'临海市','time'=>'72'],
        415=> ['name'=>'永康市','time'=>'96'],
        416=> ['name'=>'慈溪市','time'=>'96'],
        417=> ['name'=>'东阳市','time'=>'72'],
        //418=> ['name'=>'义乌市','time'=>'72'],
        419=> ['name'=>'海盐县市','time'=>'96'],
        420=> ['name'=>'兰溪市','time'=>'96'],
        421=> ['name'=>'温岭市','time'=>'96'],
        422=> ['name'=>'诸暨市','time'=>'96'],
    ],
    //专人专车公里价格配置 4.专人 5.专车
     'zrcachievements'=>[
          '4'=>'0.05',
          '5'=>'0.1'
     ],
    'ac_type'=>['0'=>'取件','1'=>'发货','2'=>'提货','3'=>'派件','4'=>'专人','5'=>'专车','6'=>'方案调拨'],
    //温度计数量
    'to_the_num' => [1=>'单温度计', 2=>'双温度计'],
    //客户配置
    'customer_config' => [
        1 => '签收自动反馈',
        2 => '温度自动反馈',
        3 => '客户货物标准化信息',
        4 => '自动发送催款短信',
        5 => '支持批量上传温度数据',
        6 => '项目订单',
        7 => '代签短信提醒',
        8 => '选择部门',
        9 => '客户端交接单据上传',
        10 => 'CRA、CRC下单，发件地址绑定医院地址',
        11=> '打印运单时将货物名称打印在运单上',
    ],


    //校准证书-温度校准配置
    'temperature_calibration'=>[
        1=>'0℃,5℃,20℃,40℃',
        2=>'-25℃,0℃,5℃,50℃',
        3=>'-80℃,-50℃,-20℃,0℃',
        4=>'-196℃'
    ],
    //校准证书-湿度校准配置
    'humidity_calibration'=>[
        1=>'35%,75%',
        2=>'20%,80%',
        3=>'无'
    ],

    'added_limit' => [
        "0"=> 0,
        "1"=> 1,
        "2"=> 2,
        "3"=> 3,
        "4"=> 4,
        "1,2"=> 5,
        "1,3"=> 6,
        "1,4"=> 7,
        "2,3"=> 8,
        "2,4"=> 9,
        "3,4"=> 10,
        "1,2,3"=> 11,
        "1,2,4"=> 12,
        "1,3,4"=> 13,
        "2,3,4"=> 14,
        "1,2,3,4"=> 15
    ],
    "added_time" => [
        1 => '48小时',
        2 => '72小时',
        3 => '7天',
        4 => '24小时'
    ],
    'added_service' => [1 => '取派人员进行核酸检测', 2 => '外包装核酸检测', 3 => '药品外包装检测', 4=>'取派件人员抗体检测'],
'filter_mobile_source'=>[1,2,8],
'keji_project' => [1711,2297,1710,1712,1665,2074,2267,2264,2422,2266,2268,2265,6339,6338,6340,6341,7986,7985,7984,9118,2257,2262,2259,2261,2263,2260,2281,2278,2280,2282,2279,4960,9119,4959,4968,4967,3596,2252,2271,2273,2253,2250,2254,2251,5771,5770,7922,7865,7837,7836,9634,9635,9633,9632,2181,6739,3184,3221,3223,5991],
    'drug_region_list' => [
        '110000' => [
            'start_co_name' => '北京药品库',
            'start_mobile_phone' => '010-67837532',
            'start_address' => '北京市大兴区科创十街16号院1号库三层',
        ],
        '310000' => [
            'start_co_name' => '上海药品库',
            'start_mobile_phone' => '021-54320195',
            'start_address' => '上海市闵行区纪丰路327号3号楼1楼',
        ],
        '440100' => [
            'start_co_name' => '广州药品库',
            'start_mobile_phone' => '020-31602581',
            'start_address' => '广州市黄埔区科学城光谱东路179号B栋101室',
        ],
    ],
'drug_region_list2' => [
    '110000' => [
        'start_region_id'=>'110000',
        'start_region_name'=>'北京市',
        'start_cu_name'=>'北生(北京)供应链管理有限公司',
        'start_co_name' => '北京药品库',
        'start_mobile_phone' => '010-67837532',
        'start_address' => '北京市大兴区科创十街16号院1号库三层',
'id' => 1,
    ],
    '310000' => [
        'start_region_id'=>'310000',
        'start_region_name'=>'上海市',
        'start_co_name' => '上海药品库',
        'start_cu_name'=>'上海生生物流有限公司',
        'start_mobile_phone' => '021-54320195',
        'start_address' => '上海市闵行区纪丰路327号3号楼1楼',
'id' => 2,
    ],
    '440100' => [
        'start_region_id'=>'440100',
        'start_region_name'=>'广州市',
        'start_co_name' => '广州药品库',
        'start_cu_name'=>'生生供应链管理(广州)有限公司',
        'start_mobile_phone' => '020-31602581',
        'start_address' => '广州市黄埔区科学城光谱东路179号B栋101室',
'id' => 3,
    ],
],
'cu_email_push'=>[20120010,201207741,202000110,201900710],

 'wechat_send_drug_order_check_message_switch' => 1,
    // 微信服务号创建订单开关，1打开、非1关闭
    'wechat_new_add_drug_order_switch' => 1,
    // 微信服务号修改订单开关，1打开、非1关闭
    'wechat_new_update_drug_order_switch' => 1,
    // oms后台修改订单开关，1打开、非1关闭
    'oms_admin_new_update_order_switch'  => 1,
    // oms后台创建订单开关，1打开、非1关闭
    'oms_admin_new_add_order_switch' => 1,
    'must_delivery_cu_list'=>[201900162,201207722],
// 客户端发送订单审核消息开关，1打开、非1关闭
    'customer_send_order_check_message_switch' => 1,
    // 客户端新增订单开关，1打开、非1关闭
    'customer_new_add_order_switch' => 1,
    // 客户端修改订单开关，1打开、非1关闭
    'customer_new_update_order_switch' => 1,
    // 微信服务号发送订单审核消息开关，1打开、非1关闭,
    'wechat_send_order_check_message_switch' => 1,
    'build_order_address_lon_lat_switch' => 0,
 //业务板块
     'cu_segment'=>[1=>'科研及临床样本及药品',2=>'商业成品药',3=>'体外诊断试剂(IVD)',4=>'特检普检样本',5=>'脐带血',6=>'免疫细胞',7=>'疫苗',8=>'其他',9=>'国际客户'],
'nuohe_push_temp_id'=>[
201206985=>115,
202102958=>119,
202101579=>119
],
 'nuohe_confirm_push'=>160,
'insure_push_id'=>141,
'no_deliver_temp'=>116,
      'hot_cate_id'=>13,
'order_tag_config' => [
        'rule1' => [
            [
                'key' => '注射液',
                'tag' => '3',
            ],
            [
                'key' => '切片',
                'tag' => '3',
            ],
            [
                'key' => '西林瓶',
                'tag' => '3',
            ],
            [
                'key' => '培养基',
                'tag' => '3',
            ],
            [
                'key' => '玻璃',
                'tag' => '3',
            ],
            [
                'key' => '易碎',
                'tag' => '3',
            ],
            [
                'key' => '切片',
                'tag' => '3',
            ],
            [
                'key' => '注射液',
                'tag' => '3',
            ],
            [
                'key' => '医疗器械',
                'tag' => '3',
            ],
            [
                'key' => '玻璃',
                'tag' => '3',
            ],
            [
                'key' => '玻片',
                'tag' => '3',
            ],
            [
                'key' => '培养基',
                'tag' => '3',
            ],
            [
                'key' => '玻璃瓶',
                'tag' => '3',
            ],
            [
                'key' => '西林瓶',
                'tag' => '3',
            ],
            [
                'key' => '安剖瓶',
                'tag' => '3',
            ],
            [
                'key' => '赫赛汀',
                'tag' => '3',
            ],
            [
                'key' => '人血白蛋白',
                'tag' => '3',
            ],
            [
                'key' => '易碎',
                'tag' => '3',
            ],
            [
                'key' => '针剂',
                'tag' => '3',
            ],
            [
                'key' => '试剂瓶',
                'tag' => '3',
            ],
            [
                'key' => '冻存管',
                'tag' => '3',
            ],
            [
                'key' => 'EP管',
                'tag' => '3',
            ],
            [
                'key' => '储液瓶',
                'tag' => '3',
            ],
            [
                'key' => '卡铂',
                'tag' => '3',
            ],
            [
                'key' => '顺铂',
                'tag' => '3',
            ],
            [
                'key' => '达托霉素',
                'tag' => '3',
            ],
            [
                'key' => '球囊导管',
                'tag' => '3',
            ],
            [
                'key' => '租借耗材',
                'tag' => '38',
            ],
        ]
    ],
      'new_address_cuid'=>[202000471,202102447],
      'file_push_config'  => [      
             'at_subtype' => [207001,207002, 207003, 207005, 207006, 207007, 207008, 207009, 207010, 207014],
       ],
    'to_hygrometer_range' =>[
        1=>'1%-100%',
        2=>'35%-75%',
    ],
  'qa_config' =>[
        'nuclein'=>14,
        'business'=>22,
        'oms_address'=>17,
        'address'=>16
    ],
      'order_verify_config' =>[
        'verify_email_config' => [
            'verify_email_source' => [1,2,3,9],
            'verify_email_pattern' => "/^[_a-zA-Z0-9-]+(\.[_a-zA-Z0-9-]+)*@[a-zA-Z0-9-]+(\.[a-zA-Z0-9-]+)*(\.[a-zA-Z]{2,})$/",//
            'verify_email_maxlength' => 60,
        ],
        'verify_phone_config' => [
            'verify_phone_source' => [1,2,3,9],
            'verify_phone_pattern' => "/(^((0\d{2,3})-)?(\d{5,8})(-(\d{3,8}))?$)|(^(400)-(\d{3})-(\d{4})(.)(\d{1,4})$)|(^(400)-(\d{3})-(\d{4}$))|^(13[0-9]|14[0-9]|15[0-9]|16[0-9]|17[0-9]|18[0-9]|19[0-9])\d{8}$/",//^[0-9][0-9-]{4,19}$
        ],
        'verify_city_config' => [
                 'verify_city_source' => [2,3,9],
        ],
        'verify_time_config' => [
              'verify_time_source' =>[1,2,3,9],
              'verify_time_days' => 30,
          ],
    ],
     'customer_effective_config' =>[
          'template_id' => 120,
          'is_send_message' => true,
          'is_send_person' => false,
          'person_template_id' => 122,
           'is_intercept'=> true,//是否拦截
           'is_allow_source' =>[1,2,3,7,8],
           'black_cu_list' => [],
           'white_list'=>false, //白名单客户是否拦截,
           'cg_status'=>true, //集团客户是否拦截
           'range'=> true,//服务范围是否拦截
           'jinyu_intercept' => true, // 金域客户是否拦截
      ],
      'element_conf'=>[
        '1'=>'customer_menu',  //新客户端菜单埋点
        '2'=>'customer_login_error',  //新客户new_login错误
        '3'=>'customer_login_timeout',  //新客户new_login超时
        '4'=>'customer_service_answer',  //
        '5'=>'customer_cate_question',  //
        '6'=>'customer_category',  //
        '7'=>'change_question',  //
        '8'=>'add_comment',  //
        '9'=>'hotquestion',  //
        '10'=>'drug_exp',  //
        '11'=>'gaosong1',  //
        '12'=>'gaosong2',  //
        '13'=>'minipdf',  //对账单
        '14'=>'customer_statement', //对账单提醒
        '15'=>'mini_pay',
        '16'=>'downinvoice',//电子发票下载
        '17'=>'confirm_statement',//确认对账单
        '18'=>'invoice_view',//开票详情页面
        '19'=>'statement_view',//对账单详情页面
        '20'=>'statement_list',//对账单列表页面
        '21'=>'diff_price',//小程序补差价列表
        '22'=>'temperature_curve',//小程序温度曲线
        '23'=>'logistics_records',//
       '24'=>'cex_add',//试验中心新增
       '25'=>'cex_update',//试验中心修改
       '26'=>'cex_del',//试验中心删除
       '27'=>'mini_order_plan_box',//小程序订单计划箱型
       '28'=>'oms_quick_search',//快捷搜索菜单
       '29'=>'add_source',//新下单入口埋点
        ],
  'diff_list' =>[['dis1'=>'4000000','dis2'=>'10000000','diff_s'=>'1300000'], 
                       ['dis1'=>'1000000','dis2'=>'4000000','diff_s'=>'800000'], 
                       ['dis1'=>'0','dis2'=>'1000000','diff_s'=>'120000']],
    // 解析药品订单发件地址 1老逻辑 其它为新逻辑
    'address_send_is_open' => 1, 
];