return [  
    'su_type' => [1=>'外协', 2=>'一般供应商', 3=>'承运商'],
    'co_type' => [1=>'外协', 2=>'一般供应商', 3=>'承运商', 4=>'客户'],
    'ur_type' => [5=>'员工', 1=>'外协', 2=>'一般供应商', 3=>'承运商', 4=>'客户'],
    // 账号管理页面去掉客户账号管理
    'ur_type1' => [5=>'员工', 1=>'外协', 2=>'一般供应商', 3=>'承运商'],
    'bi_type' => [5=>'员工', 1=>'外协', 2=>'一般供应商', 3=>'承运商', 4=>'客户'],
    //-----------------附件----------------------
    'at_type' => [201=>'客户', 202=>'项目', 203=>'供应商', 204=>'入库单', 205=>'出库单', 206=>'采购单', 207=>'运输订单', 208=>'调度单', 209=>'对账单',
    211=>'仓储设备',212=>'质控文件', 213=>'调拨文件','214'=>'温度文件','215'=>'移库文件',216=>'异常文件',217=>'外协文件',218=>'折扣修改申请附件',219=>'运营调拨单日志',220=>'样本入库单',221=>'样本出库单',227=>'月结承运商账单附件',228=>'月结承运商财务附件', '232' => '药品', '233' => '药品批次号','234' => '国际上传附件对接泛微',238=>'收款单',239 => '包材设计',240 => '包材生产', 249 => '生产方案',250=>'财务审核'],
    //运输附件
    'at_to_type' => [207=>'运输订单', 208=>'调度单'],
    //客户附件
    'at_type1' => [204=>'入库单', 205=>'出库单', 207=>'运输订单',],
    //客户附件子类型 
    'at_subtype1' => [201001 => '证照文件', 201002 => '合同文件', 201003 => '调查评审文件', 201004 => '报价文件','201005' => '仓储合同',201006=>'主合同',201007=>'补充协议',201008=>'报价单',201009=>'质量协议',201010=>'保险协议',201011=>'保密协议',201012=>'标书'],
    //项目附件子类型 
    'at_subtype2' => [202001 => '项目要求', 202002 => '项目操作SOP', 202003 => '其他附件',],
    //供应商附件子类型 
    'at_subtype3' => [203001 => '证照文件', 203002 => '合同文件', 203003 => '调查评审文件', 203004 => '其他附件',],
    //入库单附件子类型 
    'at_subtype4' => [204001 => '交接单', 204002 => '入库单', 204003 => '随货文件', 204004 => '货物拍照', 204005 => '其他附件','204006' => '温度数据','204007'=>'是否加急附件'],
     //入库单异常附件子类型 
    'at_subtype35' => [235001 => '验收异常附件',235002=>'清点异常附件',235003=>'清点复核异常附件',235004=>'验收异常处理附件',235005=>'清点异常处理附件',235006=>'清点复核异常处理附件'],
    //出库单异常附件子类型 
    'at_subtype36' => [236001 => '药品复核异常附件',236002=>'拣药异常附件',236003=>'拣药异常处理附件',236004=>'药品复核异常处理附件'],
    //销毁订单附件子类型
     'at_subtype37' => [237001 => '销毁申请单',237002=>'销毁证明'],
 
     //包材设计附件子类型
     'at_subtype39' => [239001 => '其他附件'],
     //包材生产附件子类型
     'at_subtype40' => [240001 => '其他附件'],   

    //出库单附件子类型 
    'at_subtype5' => [205001 => '交接单', 205002 => '出库单', 205003 => '随货文件', 205004 => '货物拍照', 205005 => '其他附件',],
    //采购单附件子类型 
    'at_subtype6' => [206001 => '货物交接单', 206002 => '采购合同', 206003 => '发票扫描', 206004 => '其他附件',],
    //订单附件子类型 
    'at_subtype7' => [207001 => '生生签收单据', 207002 => '取件现场拍照', 207003 => '温度数据',  207006 => '校准证书', 207007=>'交接单据', 207008=>'药检报告',207009=>'客户签收单据',207010=>'派件现场拍照', 207005 => '其他附件',207011=>'异常拍照',207012=>'外包装核酸检测报告',207013=>'申请表',207014 =>'客户上传附件',207015=>'购票凭证',207016=>'人员核酸检测报告',207017=>'人员抗体检测报告',207018=>'药品核酸检测报告',207019=>'车辆照片',207020=>'取件生生运单拍照',207021=>'保单',207022=>'取件现场货物照片',207023=>'派件现场货物照片',207024=>'暂存现场照片'],
    //调度单附件子类型 51
    'at_subtype8' => [208001 => '发货单据', 208002 => '提货单据', 208003 => '其他附件',],
    //对账单附件子类型
    'at_subtype9' => [209001 => '电子对账单', 209002 => '发票扫描件',209004 => '客户确认凭证',  209003 => '其他附件',209005=>'系统电子对账单',209006=>'微型客户电子对账单'],
    //设备检修附件子类型
    'at_subtype11' => [211001 => '现场拍照', 211002 => '检查记录', 211003 => '维修记录', 211004 => '其他附件',],
    //质控文件子附件
    'at_subtype12' => [212001 => '校准证书', 212002=>'温度计模板',212003=>'液氮罐验证'],
    //调拨文件子附件
    'at_subtype13' => [213001 => '调拨文件',],
    //温度文件
    'at_subtype14' => [214001 => '仓库温度文件',],
    'at_subtype15' => [215001 => '移库文件',215002=>'温度数据',215003 => '校准证书'],
    'at_subtype17' => [217001 => '外协身份证',],
    'at_subtype18' => [218001 => '供应商付款拍照',],
    'at_subtype19' => [219001 => '生生签收单据', 219002 => '现场拍照', 219003 => '温度数据', 219004 => '保险单据', 219006 => '校准证书', 219007=>'交接单据', 219008=>'药检报告', 219005 => '其他附件',],
     //入库单附件子类型
    'at_subtype20' => [220001 => '客户交接单', 220002 => '入库单', 220003 => '随货文件', 220004 => '货物拍照', 220005 => '其他附件',],
    //出库单附件子类型
    'at_subtype21' => [221001 => '客户交接单', 221002 => '出库单', 221003 => '随货文件', 221004 => '货物拍照', 221005 => '其他附件',],
    'at_subtype22' => [222001 => '移库文件',],
    //耗材入库单附件子类型
    'at_subtype23' => [223001 => '客户交接单', 223002 => '入库单', 223003 => '随货文件', 223004 => '货物拍照', 223005 => '其他附件',],
    //耗材出库单附件子类型
    'at_subtype24' => [224001 => '客户交接单', 224002 => '出库单', 224003 => '随货文件', 224004 => '货物拍照', 224005 => '其他附件',],
//资产调拨单121
    'at_subtype25' => [2225010 => '资产调拨单', 2225011  => '随货文件', 2225012 => '货物拍照', 2225013 => '其他附件'],

    //资产领用单
    'at_subtype26' => [2225021 => '资产领用单', 2225011  => '随货文件', 2225012 => '货物拍照', 2225013 => '其他附件'],
   //核酸检测附件
    'at_subtype27' => [226001 => '核酸检测报告', 226002 => '抗体检测报告' ],
   //月结承运商账单附件
    'at_subtype28' => [227001 => '发票',227002=>'账单明细',227003=>'预提凭证'],
   //月结承运商财务附件
    'at_subtype29' => [228001 => '财务明细'],
   //车辆领用照片
'at_subtype30' => [229001 => '车头照片',229002 => '车尾照片',229003 => '左侧照片',229004 => '右侧照片',229005 => '仪表盘照片',229006 => '车厢照片'],
   //app费用审批传输图片
'at_subtype31' => [230001 => '日常费用',230002 => '业务支出',230003 => '车辆维保',230004 => '差旅费照片',230005 => '团建费'],
    // 添加药品选择附件类型
    'at_subtype32' => [232001 => '药检报告', 232002 => '药品通关单', 232003 => '进口批件', 232004 => '其他'],
    // 药品批次号
    'at_subtype33' => [233001 => '药检报告', 233002 => '药品通关单', 233003 => '进口批件', 233004 => '其他'],
    // 国际上传附件对接泛微
    'at_subtype34' => [234001 => '国际上传附件'],
   //收款单附件子类型 
   'at_subtype38' => [238001 => '应收确认'],
   //校准返修附件
   'at_subtype41' => [241001 => '校准返修附件'],
   //财务审核附件
   'at_subtype50' => [250001 => '财务审核附件'],
    //-----------------备注日志---------------
    'remark_type' => [ 101 => '调度单', 102 => '运输订单', 103 => '入库单', 104 => '出库单',105 => '采购单', 106 =>'对账单' , 107 =>'开票单' , 108 => '收款' ,109 => '操作表',110 => '物资明细表',111 =>'路由管理', 112 => '客户管理', 113 => '移库单',114=>'耗材交接',115=>'报价单',116=>'客户合同',117=>'预警单',118=>'菜单管理',119=>'权限管理',120=>'角色权限',121=>'用户管理',122=>'药品入库单',123=>'药品出库单',130=>'药品台账','135'=>'药品盘点'],
       //菜单子类型
    'menu_subtype' => [118001 => '添加菜单', 118002 => '编辑菜单', 118003 => '删除菜单'],
    //权限子类型
    'auth_subtype' => [119001 => '添加权限', 119002 => '编辑权限', 119003 => '删除权限'],
    //角色子类型
    'role_subtype' => [120001 => '添加角色', 120002 => '编辑角色', 120003 => '删除角色', 120004 => '编辑角色权限',120005=>'权限角色批量更新'],
    //用户子类型
    'user_subtype' => [121001 => '添加用户', 121002 => '编辑用户', 121003 => '删除用户'],
    //调度单备注操作子类型
    'remark_subtype1' => [101001=>'生成调度单', 101002=>'修改调度单', 101003=>'指派调度单', 101004=>'修改调度单备注',
        101005=>'回退调度单', 101006=>'关闭调度单', 101007=>'取消调度单', 101008=>'调度单发货', 101009=>'调度单提货', 101010=>'二次调度',101012=>'提货成功',101011=>'踢出运单','101012'=>'调度单确认','101013'=>'修改发货单号','101014'=>'专线下发','101015'=>'专线撤回'],
    //订单备注操作子类型                 
    'remark_subtype2' => [102001 => '生成订单', 102002 => '修改订单', 102003 => '确认订单', 102004 => '指派订单',
        102005 => '取件备注', 102006 => '回退订单', 102007 => '关闭订单', 102008 => '取消订单',
        102009 => '预约取件', 102010 => '实际取件', 102011 => '修改耗材', 102012 => '实际派件',
        102013 => '上传附件', 102014 => '调度发货', 102015 => '签收反馈', 102016 => '费用结算',
        102017 => '拆分订单', 102018 => '订单绩效', 102019 => '修改客户备注',
        102020 => '提货成功', 102021 => '修改取派备注',102022 => '派件备注',
        102023 => "操作费用", 102024 => '数据反馈', 102025 =>'更新方案',
        102026 => '修改项目', 102027 => '耗材绑定', 102028 => '耗材归还', 102029 => '中转换冰排',
        102030 =>'创建工作单',102031 =>'指派组长', 102032=>'指派操作',102033=>'审核订单',
        102034=>'生成耗材调拨',102035=>'单号绑定',102036 =>'修改工作单',102037 =>'指派调度单',
        102038 => '打标签',102039=>'批量上传',102040=>'修改取件',102041=>'修改派件',102042=>'删除数据',
        102043 =>'工作单交接',102044=>'订单存货',102045=>'发货成功',102046=>'修改调度单',102047=>'删除调度',
        102048 =>'订单删除',102049=>'申请修改','102050'=>'申请取消','102051'=>'处理申请',102052=>'温度检查',102053=>'方案调拨',
        102054=>'订单打印',102055=>'批量结算',102056=>'辅助结算',102057=>'自动结算',102058=>'添加/修改运输成本',102059=>'添加异常',1020591=>'删除异常',
        102060=>'合并订单',102061=>'拆除订单',102062=>'确认到达',102063=>'时效换冰排',102064=>'暂存换冰排',102065=>'添加干冰',
        102066=>'删除编号',102067=>'生成预警单',102068=>'子单耗材解绑',102069=>'专人专车绩效补充',102070=>'取消工作单',
        102071=>'时效换冰排复核',102072=>'中转换冰排复核',102073=>'跳过换冰排',102074=>'暂存换冰排复核',102075=>'订单信息二次确认',102076 => '添加收费异常',102077 => '修改收费异常',
        102078=>'货物数量确认',102079=>'货物数量复核',102080=>'取消指派',102081=>'批量取件',102082=>'修改结算抬头',102083=>'修改结算',102084=>'批量派件',
        102085=>'系统自动确认',102086 => '生成出库单',102087 => '预约派件', 102088 => '自动上传',102089=>'鼎为异常备注',102090=>'绑定车辆',102091=>'解绑车辆',102092=>'消杀记录',102093=>'生成子血订单',102094=>'取消子血订单',102095=>'生成消杀文件',102096=>'提货异常',102097=>'计划与实际箱型不符',
102098=>'推送迈迪外包',102099=>'地址校验',102100=>'自动创建工作单',102101=>'工作单交接',102102=>'药品装箱',102103=>'鼎为远程开启',102104=>'批量创建工作单',102105=>'添加西门子订单信息',102106=>'修改西门子订单信息',102107=>'安排工作指令',102108=>'购买车票',102109=>'到达取件单位',102110=>'离开取件单位',102111=>'到达发货站点',102112=>'乘车',102113=>'车辆出发',102114=>'到达派件城市',102115=>'去往派件单位',
        102116=>'到达派件单位',102117=>'离开派件单位',102118=>'到达车站',102119=>'到达取件城市',102120=>'领取车辆',102121=>'车辆开往派件城市',
        102122=>'到达康德乐', 102123=>'离开康德乐',102124=>'去往DTP药房',102125=>'到达DTP药房',102126=>'药房签收',102127=>'离开DTP药房',102128=>'交接完毕',102129=>'到达中心',102130=>'离开中心',102131=>'核酸服务检测',102132=>'修改仓库审核状态',102133=>'计划箱型配置',102134=>'创建待激活工作单',
    102135=>'删除药品',102136=>'订单转交',102137=>'订单升级',102138=>'智能路由推荐',102139=>'计划箱型',102140=>'添加药品',102141=>'删除药品',102142=>'鼎为终端自解绑',102143=>'药品合单',102144=>'发货站点异常',102145=>'订单异常处理',102146=>'添加仓库工作单',102147=>'修改仓库工作单',102148=>'完成仓库工作单',102149=>'批量修改工作单',102150=>'车辆运输流程',102151=>'货物交接',102152=>'到达中转车站',102153=>'中转城市出发',102154=>'到达中转城市',102155=>'车辆开往中转城市',102156=>'前往取件城市',102157=>'到达取件城市',102158=>'到达取件单位',102159=>'完成退货交接',102160=>'派送签收完成',102161=>'完成CART操作节点',102162=>'暂存监控自动检查',102163=>'冷藏车监控编辑',102164=>'退回转寄',102165=>'暂存原因修改',102166=>'专车回程带货',102167=>'订单分级更新',102168=>'夜班工作单',102169=>'自动创建取派工作单',102170=>'发起财务审核',102171=>'财务审核通过',102172=>'财务审核拒绝'],
    //客户订单查询类型
    'search_subtype3'=>[102001=>'生成订单',102003=>'确认订单',102033=>'审核订单',102010=>'取件完成',102014=>'发货成功',102020=>'提货成功',102012=>'派件完成'],
    //客户物流信息
    'remark_custsubtype' => [
                            102001 => '生成订单', 102002 => '修改订单', 102003 => '确认订单', 102007 => '关闭订单', 102008 => '取消订单',
                            102010 => '取件完成', 102012 => '派件完成',
                            102014 => '调度发货', 102015 => '反馈信息', 102016 => '费用结算', 102019 => '修改备注',102020 => '提货成功',102024 => '反馈数据',102033 =>'审核订单',
                            102045 => '发货成功', 102049 => '申请修改', 102050 => '申请取消', 102051 => '处理申请'
                          ],
    //入库单备注操作子类型
    'remark_subtype3' => [103001 => '生成入库单', 103002 => '修改入库单', 103003 => '指派入库单', 103004 => '修改入库单备注',
                          103005 => '回退入库单', 103006 => '关闭入库单', 103007 => '取消入库单', 103008 => '实际入库',103009 => '附件上传',103010 => '附件删除',],
    //出库单备注操作子类型
    'remark_subtype4' => [104001 => '生成出库单', 104002 => '修改出库单', 104003 => '指派出库单', 104004 => '修改出库单备注',
        104005 => '回退出库单', 104006 => '关闭出库单', 104007 => '取消出库单', 104008 => '实际出库',104009 => '附件上传',104010 => '附件删除',104011=>'出库单拣药',104012=>'出库单核药',104013=>'出库单方案核对',],
    //采购单备注操作子类型
    'remark_subtype5' => [105001 => '生成采购单', 105002 => '修改采购单', 105003 => '审核采购单', 105004 => '指派采购单',    
                          105005 => '修改采购单备注', 105006 => '回退采购单', 105007 => '关闭采购单', 105008 => '取消采购单',
                          105009 => '供应商下单',105010 => '到货确认',105011 => '报账',105012 => '批量审批',105013 => '批量下单',105014 => '附件上传'],
    //对账单备注操作子类型
    'remark_subtype6' => [106001 => '生成对账单', 106002 => '修改对账单', 106003 => '指派对账单', 106004 => '修改备注', 106005 => '取消对账单', 106006 => '指派开票',106007=>'作废开票，状态回退',106008 => '踢出结算单',106009 => '获取不含税金额',106010 => '调整税率','106011'=>'发送对账单','106012'=>'确认对账单','106013'=>'发送在线对账单','106014'=>'在线对账客户确认','106015'=>'在线对账客户驳回','106017'=>'删除附件'],
    //开票单备注操作子类型
    'remark_subtype7' => [107001 => '生成开票单', 107002 => '修改开票单', 107003 => '指派开票单', 107004 => '备注开票单', 107005 => '取消开票单',107006 => '销账',107007 => '确认开票',107008 =>'作废开票',107009 =>'踢除对账单'],
    //收款记录备注子类型
    'remark_subtype8' => [108001 => '生成收款单' , 108002 => '修改收款', 108003 => '指派确认', 108004 => '备注收款', 108005 => '取消收款', 108006 => '清账',108007 =>'审核收款单'],
    //操作表备注子类型
    'remark_opntype' => [109001 => '费用录入' , 109002 => '费用审核', 109003 => '费用批准', 109004 => '费用复核', 109005 => '费用支付',109006 =>'审核不通过'],
    //物资明细操作类型
    'remark_subtype9' => [110001 => '物资录入' , 110002 => '证书上传', 110003 =>'证书删除'],

    //路由管理备注操作子类型
    'remark_subtype10' => [111001 => '录入路由' , 111002 => '审核路由', 111003 =>'修改路由',111004 => '关闭路由', 111005 => '批量启用', 111006 => '批量停运',111007=>'申请停运',111008=>'申请启用'],
    //客户管理备注操作子类型
    'remark_subtype11' => [112001 => '新增客户' , 112002 => '审核客户', 112003 =>'修改客户信息'],
    //移库单备注操作子类型
    'remark_subtype12' => [113001 => '生成移库单' , 113002 => '修改移库单', 113003 =>'移库', 113004 =>'修改备注', 113005 =>'取消移库单', 113006 =>'附件上传',113007 => '拣药出库完毕', 113008=>'填写出库台账',113009=>'药品入库完毕',113010=>'填写入库台账',113011=>'复核台账',113012=>'异常已处理'],

    //耗材交接
    'remark_subtype13' => [114001 => '耗材交接' ],
    // 调整单结算业务类型  1 物流 2 样本 3 仓储 4 耗材 5 其他',
  'ad_fee_type' => [ 1 =>'物流结算', 2 =>'样本结算', 3 =>'仓储结算', 4 =>'耗材结算', 5 =>'其他结算'],

    //报价管理子类型
    'remark_subtype14' => [115001 => '生成报价单',115002=>'修改报价单',115003=>'新增关联客户',115004=>'修改关联信息',115005=>'新增报价明细',115006=>'修改报价明细'],

    //客户合同子类型
    'remark_subtype15'=>[116001=>'添加合同',116002=>'修改合同',116003=>'审核合同'],
    //客户税率子类型
    'remark_subtype18'=>[118001=>'添加税率',118002=>'修改税率'],
    //药品入库子类型
    'remark_subtype22' => [122001 => '生成入库单', 122002 => '修改入库单', 122003 => '指派入库单', 122004 => '修改入库单备注',
        122005 => '回退入库单', 122006 => '关闭入库单', 122007 => '取消入库单', 122008 => '实际入库',122009 => '附件上传',122010 => '附件删除',122011=>'清点完毕',122012=>'选择入库货位',122013=>'修改入库货位',122014=>'填写台账',122015=>'复核台账',122016=>'台账异常已处理',122017=>'入库前检查',122018=>'清点复核',122019=>'清点复核异常处理',122020=>'质量放行',122021=>'质量放行异常处理',122022=>'提交收货信息',122023=>'添加药品信息',122024=>'删除药品',122025=>'修改药品信息',122026=>'清点完成',122027=>'选择客户',122028=>'清点异常处理',122029=>'入库单验收',122030=>'验收异常处理',122031=>'质量状态确认',122032=>'修改是否加急'],
     //入库单温控要求
     'temp_control' => [
          ['value' => 0,'text'=>'无温控要求','min'=>'','max'=>''],
            ['value' => 1,'text'=>'2~8˚C','min'=>'2','max'=>'8'],
            ['value' => 2,'text'=>'15~25˚C','min'=>'15','max'=>'25'],
            ['value' => 3,'text'=>'15~20˚C','min'=>'15','max'=>'20'],
            ['value' => 4,'text'=>'20~25˚C','min'=>'20','max'=>'25'],
            ['value' => 5,'text'=>'0~30˚C','min'=>'0','max'=>'30'],
            ['value' => 6,'text'=>'10~30˚C','min'=>'10','max'=>'30']
      ],
    //药品出库子类型
    'remark_subtype23' => [123001 => '生成出库单', 123002 => '修改出库单', 123003 => '指派出库单', 123004 => '修改出库单备注',
        123005 => '回退出库单', 123006 => '关闭出库单', 123007 => '取消出库单', 123008 => '实际出库',123009 => '附件上传',123010 => '附件删除',123011=>'出库单拣药',123012=>'出库单核药',123013 => '出库单方案核对',123014 => '拣药完毕',123015 => '添加台账',123016 => '出库复核',123017 => '复核-异常已处理',123018 => ' 质量放行完毕',123019 => '放行-异常已处理',123020=>'药品装箱',123021=>'放弃装箱',123022=>'装箱完成',123023=>'准备文件','123024'=>'消杀完成','123025'=>'消杀复核','123026'=>'装箱货位','123027'=>'出库单拣药完成','123028'=>'出库单拣药异常处理'],
    //订单备注操作子类型
    'remark_subtype24' => [124001 => '生成订单',124002 => '修改订单',124003 => '确认订单',124004 => '指派订单',124005 => '取件备注',
                            124007=>'关闭订单',124008=> '取消订单',124010 => '实际取件',124012 => '实际派件',124013 => '上传附件',
                          124014 => '调度发货',124019=> '修改客户备注',124021 => '修改取派备注',124022 => '派件备注',
                          124023=>'操作费用',124025=>'更新方案',124026 => '修改项目',124027 => '耗材绑定',124028=>'耗材归还', 124034=>'生成耗材调拨', 124035=> '调拨申请新增' , 124036 => '调拨申请编辑', 124037 => '调拨申请完成', 124038 => '调拨申请取消', 124039 => '调拨单新增',
    124040 => '调拨单编辑', 124041 => '调拨单完成', 124042 => '调拨单取消', 124043 => '调拨单打包', 124044 => '调拨单发货',
    124045 => '调拨单提货', 124046 => '调拨单收货',124047=>'调拨工作指派',124048=>'调拨工作交接',124049=>'调拨工作领取',124050=>'调拨单确认',124051=>'创建工作单',124052=>'扫码入库'],
    //样本入库子类型
    'remark_subtype25' => [125001 => '生成入库单', 125002 => '修改入库单', 125003 => '指派入库单', 125004 => '修改入库单备注',
        125005 => '回退入库单', 125006 => '关闭入库单', 125007 => '取消入库单', 125008 => '实际入库',125009 => '附件上传',125010 => '附件删除'],
    //样本出库子类型
    'remark_subtype26' => [126001 => '生成出库单', 126002 => '修改出库单', 126003 => '指派出库单', 126004 => '修改出库单备注',
        126005 => '回退出库单', 126006 => '关闭出库单', 126007 =>'取消出库单', 126008 => '实际出库',126009 => '附件上传',126010 => '附件删除',
        126011=>'出库单拣药',126012=>'出库单核药',126013 => '出库单方案核对'],
    //移库单备注操作子类型
    'remark_subtype27' => [127001 => '生成移库单' , 127002 => '修改移库单', 127003 =>'移库', 127004 =>'修改备注', 127005 =>'取消移库单', 127006 =>'附件上传'],
    //贴标订单
    'remark_subtype28' => [128001 =>'创建订单',128002=>'开始贴标',128003 =>'结束贴标',128004=>"取消订单",128005=>'上传附件',128006 =>'贴标入库',128007 => '贴标出库',128008 => '修改订单',128009 => '删除订单',128010 =>'结算',128011 =>'修改结算'],
    //车辆日志操作类型
        'remark_subtype29' =>  [170001 => '修改车辆' , 170002 => '添加车辆',170003=>'添加事故',170004=>'修改事故',170005=>'添加保险',170006=>'修改保险',170007=>'添加维修',170008=>'修改维修',170009=>'绑定温度计探头',170010=>'删除温度计探头',170011=>'启用温度计探头',170012=>'停用温度计探头'],
//资产领用操作日志
    'remark_subtype30' => [171001 => '生成领用单' , 171002  => '作废领用单', 171003 => '确认领用单',  171004=>'归还', 171005 => '取消领用'],
    //资产调拨单操作日志
    'remark_subtype31' => [172001 => '生成调拨单' , 172002  => '确认调拨单', 172003  => '修改调拨单',172004  => '取消调拨单', 172005=> '修改调拨单备注'],
     //药品台账操作
     'remark_subtype32' => [130001=> '添加台账' , 130002  => '修改台账', 130003  => '复核完毕',130004  => '作废台账'],
//计划箱型配置
'remark_subtype33' => [180001 => '计划箱型配置'],
//耗材外借操作
'remark_subtype34' => [133001=> '新增租售订单' , 133002  => '租售确认', 133003  => '修改租售信息',133004  => '修改归还信息',133005 => '修改状态',133006 => '归还信息',133007 => '租售转换',133008 => '结算',133010 =>'创建工作单',133011 =>'指派工作单',133012 =>'交接工作单', 133013 =>'取消工作单', 133014 =>'完成工作单', 133015=>'修改工作单'],
  'remark_subtype35' =>[181001=>'供应商扣款添加',181002=>'供应商扣款修改'],
    //干冰采购统计日志
'remark_subtype36' => [134001=> '新建' , 134002  => '对账' , 134003  => '修改' , 134004  => '提交审核' , 134005 => '暂估数' ,134006 => '详情修改 ', 134007 => '详情新建' , 134008 => '详情删除' , 134009 => '泛微审核',134010=>'上传付款单',134011=>'修改付款单',134012=>'入账确认',134013=>'批量提交暂估',134014=>'批量对账录入',134015=>'批量提交审核'],
    //物流供应商主体子类型
    'remark_subtype40' => [230001 => '添加主体',230002=>'修改主体'],
   //夜班调拨单
   'remark_subtype41' => [190001 => '新增调拨单',190002=>'删除调拨单',190003=>'确认操作',190004=>'新增运单',190005=>'删除运单',190006=>'调拨单更新'],
    //----------------订单配置-------------------204
    //订单类型
    'to_type' => [0 => '标准运输',1=>'耗材订单',2=>'脐血订单',3=>'石药订单',4=>'迈迪朗杰订单','5'=>'临检订单','6'=>'宴嘉订单'],
    //货物类型
//    'to_goodstype' => [1=>'血样', 2=>'样本' ,3=>'药品', 4=>'其他', ],
    'to_goodstype' => [1=>'临床样本',3=>'临床药品',5=>'商业成品药',6=>'脐带血',7=>'细胞CAR-T',8=>'IVD试剂（器械）',9=>'特检普检',10=>'科研样本',4=>'其他物品',2=>'回收药',11=>'样品',12=>'稀释液'],
    //订单来源
    'to_source' => [1=>'oms系统', 2=>'客户oms系统' ,3=>'微信服务号', 4=>'API接口', 5=>'国际系统',6=>'迈迪朗杰API',7 => 'oms系统批量导入', 8 => '机器人邮件自动下单',9=>'小程序订单',10=>'宴嘉api'],    //客户系统订单来源
    'to_source2' => [1=>'生生客服',2=>'客户系统' ,3=>'微信服务号', 4=>'第三方系统'],
    //运送时限
    'to_timelimit' => [1=>'当日达（12小时）', 2=>'次日达（24小时）', 3=>'36小时', 4=>'隔日达（48小时）', 6=>'3日达（72小时）',7=>'3日以上送达'],
    //签单返回状态
    'oi_status' => [1 => '未返回', 2 => '已返回',3 => '已接收',4 => '已签收',5 => '已删除',6=>'已超时'],
//运送时限
    'to_business_type' => [0=>'正常订单', 2=>'仓库发药'],
    //时效报警（营销监控）   必须与上面运输时限一致
    'to_timelimit_siren' => [1=>2, 2=>4, 3=>6, 4=>8, 6=>10,],
    //运送时限，用于预派时间计算
    'to_timelimitint' => [1=>12, 2=>24, 3=>36, 4=>48, 6=>72,],
    //订单等级
    'to_important' => [0=>'正常', 1=>'精益', 4=>'项目'],
    //运输要求
    //运输要求
    'to_address' => [1=>'绑定收发件地址'],
    'to_trequirement' => [0=>'正常', 2=>'专人(额外收费)', 3=>'专车(额外收费)', 4=>'冷藏车专车'],
    //订单单别
    'to_attributes' => [1=>'普通订单', 2=>'主单', 3=>'子单'],
    //订单类型
    'to_category' =>[1=>'正常订单',2=>'仓库发药',3=>'验证订单',4 =>'DTP/DFP订单'],
    //预取时间选择
    'ol_time_select'=>[
        1=>[0=>'08:00',1=>'10:00',2=>'08:00 ~ 10:00'],
        2=>[0=>'10:00',1=>'12:00',2=>'10:00 ~ 12:00'],
        3=>[0=>'12:00',1=>'14:00',2=>'12:00 ~ 14:00'],
        4=>[0=>'14:00',1=>'16:00',2=>'14:00 ~ 16:00'],
        5=>[0=>'16:00',1=>'18:00',2=>'16:00 ~ 18:00'],
        6=>[0=>'08:00',1=>'12:00',2=>'08:00 ~ 12:00'],
        7=>[0=>'12:00',1=>'18:00',2=>'12:00 ~ 18:00'],
        8=>[0=>'09:00',1=>'17:00',2 =>'09:00 ~ 17:00'],
        9=>[0=>'12:00',1=>'17:00',2 =>'12:00 ~ 17:00'],
        0=>[0=>'',1=>'',2=>'指定时间'],
    ],
    //运输单，运输温度
    //'to_temperature'=>[11=>'常温',12=>'常温2~20℃',21=>'恒温10~30℃',22=>'恒温15~25℃',23=>'恒温18~30℃',24=>'恒温20~25℃',25=>'恒温10~20℃',26=>'恒温15~30℃',31=>'蓝冰2~8℃',41=>'低温-15~-25℃',51=>'干冰-20~-100℃',51=>'干冰0~-10℃',61=>'超低温-60~-100℃',71=>'液氮-150~-200℃', 99=>'其他'],

    // 20190331温度范围变更后使用
    'to_temperature'=>[91=>'无温度要求',11=>'常温0~30℃',12=>'常温2~20℃',13=>'常温6~30℃',14=>'常温1~44℃', 15=>'常温',16=>'常温2-25℃',17=>'常温2-30℃',31=>'蓝冰2~8℃', 32=>'蓝冰2.0~7.9℃',25=>'恒温10~20℃', 21=>'恒温10~30℃',22=>'恒温15~25℃',23=>'恒温18~30℃',24=>'恒温20~25℃',28=>'恒温20~30℃',26=>'恒温4~25℃',27=>'恒温8~20℃',41=>'低温-15~-25℃',51=>'干冰-20~-100℃',42=>'低温-40~-60℃',43=>'低温-18~-80℃',61=>'超低温-60~-100℃',71=>'液氮-150~-200℃', 99=>'其他温度要求'],

    //'to_temperature'=>[11=>'常温0~30℃',12=>'常温2~20℃',21=>'恒温10~30℃',22=>'恒温15~25℃',23=>'恒温18~30℃',24=>'恒温20~25℃',25=>'恒温10~20℃',26=>'恒温15~30℃',31=>'蓝冰2~8℃',32=>'蓝冰0~5℃',41=>'低温-15~-25℃',42=>'低温-10~-30℃',51=>'干冰-20~-90℃',61=>'超低温-60~-90℃',71=>'液氮-90~-200℃', 0=>'其他'],
    //子仓库 仓储温度`to_id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT '运输单序号',
    //'subware_temperature' => [1=>'CW0-30', 2=>'HW15-25', 3=>'HW10-30', 4=>'LC2-8', 5=>'DW-25', 6=>'CDW-70', 7=>'YD-150'],
    //温度计
    'to_thermometer' => [1 => '无温度计', 2 => '生生温度计','10'=>'生生温湿度计', 3 => '客户记录仪', 4 => '客户和生生温度计', 5 => '生生+GPS温度计',6 => '生生国际专用温度计',7=>'迈迪朗杰专用温度计',8=>'生生国内+国际温度计',9=>'宴嘉冷链专用温度计',11=>'质量温度计',12=>'生生国内+质量温度计'],
    //湿度计
    'to_hygrometer' => [1 => '无湿度计', 2 => '生生湿度计', 3 => '客户湿度计', 4 => '客户和生生湿度计', ],
    //工作单打印 温度计简写
    'ow_ther' => [1 => '无', 2 => '生温', 3 => '客温', 4 => '生客', 5=>'生G',6=>'生国',7=>'迈迪朗杰',8=>'生+国',9=>'宴嘉',10=>'生湿',11=>'质量'],
    //运输单，运输单状态
    'to_status' => [0 => '待确认', 1 => '已确认', 2 => '已取件', 3 => '已发货', 4 => '已提货', 5 => '已派件', 6 => '已反馈', 7 => '已取消', 8 => '已关闭',9=>'已删除'],
    //客户审核状态
    'to_check_status' => [0 => '待审核',1 => '一审', 2 => '二审',5 => '终审'],
    'to_mt_status' => [1 => '已审核',2=>'已取件',3=>'已发货', 5 => '已派件',7 => '已取消', 8 => '已关闭',],
    //派件结存状态
    'to_inbox_status' => [0 => '未结存', 1 => '已结存',],
    //取件结存状态
    'to_outbox_status' => [0 => '未结存', 1 => '已结存',],
    //开票状态
    'to_invoice_status' => [0 => '未开票', 1 => '已开票',],
    //结算状态
    'to_settlement_status' => [0 => '未结算', 1 => '已结算',],
    //是否投保
    'to_insure' => [0 => '不投保', 1 => '投保', ],
    //付款方式 查询和展示
    'to_getcash' => [0 => '有协议月结', 4 => '扫码付现', 1 => '发货方现金', 2 => '收货方现金', 3=>'他方付款'],
    //付款方式 添加
    'to_getcash_2' => [0 => '有协议月结',4 => '扫码付现'],
    //是否开票
    'to_invoice' => [0 => '否', 1 => '是',],
    //温度数据附件状态
    'to_temprecord_status' => [0 => '未上传', 1 => '已上传', ],
    //运输单，核销状态
    'to_verification_status' => [ 0 => '未核销',1 => '核销中',2 => '已核销', ],
    //绩效状态
    'to_performance_status' => [0 => '未绩效', 1 => '异常', 2 => '投诉', 3 => '索赔', 4 => '奖励', ],
    //运输物流信息，货物状态
    'to_goods_status' => [0 => '货物完好',1 => '货物破损',2 => '货物丢失',3 => '货物超温',4 => '货物延时',5 =>'数量不符'],
    //货物类型
    'to_goods_type' => [1 => '临床药品', 2 => '生物样本', 3 => '器械试剂', 4 => '其他货物',],
    //附件上传状态
    'to_file_upload' => [0 => '未上传',1 => '已上传',2 => '签收单据未上传',3 => '温度数据未上传',4=>'校准证书未上传'],
    //仓储，存储温度
   'save_temperature' => [11=>'CW0-30',12=>'CW2-20',26=>'HW10-20',21=>'HW10-30',22=>'HW20-30',23=>'HW15-25',24=>'HW15-20',25=>'HW20-25',31=>'LB2-8',41=>'DW-20--30',42 =>'DW-15--25',61=>'CDW-60--90',72=>'CDW-70~-95',71=>'YD-90--200','43'=>'DW-20~-40℃',0=>'其他温度要求'],
    // 仓储, 冰箱温度
    'refrigerator_temperature' => [41 => 'DW-20~-30', 42 => 'DW-15~-25', '43' => 'DW-20~-40℃', 61 => 'CDW-60~-90', 72 => 'CDW-70~-95'],
    //'save_temperature' => [0=>'Others', 1=>'CW0-30', 2=>'HW10-30',3=>'HW15-25',4=>'LC2-8',5=>'DW-25',6=>'CDW-70',7=>'YD-150',],
    //运单取消原因
    'cancel_source' => [1 => '客户取消', 2 => '重复订单',],
    'to_receipt' => [1 => '本人签收', 2 => '他人代收'],
    'last_time' => [0 => '超时', 2 => '0-2小时', 4 => '2-4小时'],
    'cod_way' => [1 => '到付', 2 => '月付'],
    'to_category' => [1 => '正常订单', 2 => '仓库发药', 3 => '验证订单', 4 => 'DTP/DFP订单'],

    //-------------------采购配置---------------
    //采购类型
    'purchase_type' => [0 => '业务采购', 1 => '元廷采购', 2 => '办公采购', 3 =>'元廷办公采购'],
    //采购单状态
    'purchase_status' => [0 => '新建' , 1 => '已审核', 2 => '已取消', 3 => '已关闭', 4 => '已下单', 5 => '已到货', 6 => '已报账'],
    
    //-------------------出入库配置---------------
    //出入库状态
    'in_iostatus' => [0 => '新建' , 1 => '已取消', 2 =>'已完成'],
    'out_iostatus' => [0 => '新建' , 1 => '已取消', 2 =>'已关闭'],

    'transport_time' => [1 => '临时' , 2 => '24H' , 3 => '48H' , 4 => '超48H'],


    //出入库类型
    //药品出入库类型
    'in_subtype' => [2 => '常规入库', 4=> '其它入库',9=>'贴标入库',12=>'返药入库',13=>'包装&标签入库',16=>'回收药入库'],
//  'in_subtype' => [1 => '采购入库', 2 => '常规入库', 3 => '结存入库', 4=> '其它入库', 11=>'盘点入库', 9=>'调拨入库'],
//  'out_subtype' => [5 => '常规出库', 6 => '结存出库', 7 => '报损出库', 8 => '其它出库', 15=>'盘点出库', 10=>'调拨出库'],
    'out_subtype' => [5 => '常规出库', 8 => '其它出库',10=>'贴标出库',14=>'返药出库',15=>'包装&标签出库',20=>'销毁出库'],
    //入库前检查项
    'brforeInspect' => [
          '外包装件数是否与随货单据一致',
          '收货人信息是否与随货单据一致',
          '包装外观检查，外包装是否完好，无漏液、破损',
          '温度计工作正常、没有超温报警'
    ],
    //常规入库、返药入库、贴标入库检查项
    'inspectionItems1' => [
          '品名是否与单据一致',
          '数量是否与单据一致',
          '项目号是否与单据一致',
          '批号是否与单据一致',
          '药品规格/包装规格是否与单据一致',
          '剂型是否与单据一致',
          '有效期是否与单据一致',
          '制备单位 （生产厂家） 是否与单据一致（如适用）',
          '药物编码是否与单据一致（如适用）',
          '包装是否完整（是否破损、漏液，防拆封签是否完好）',
          '交接单据签字是否完整（拣药人、复核人、发货人等）'
      ],
      //包装&标签入库检查项
      'inspectionItems2' => [
          '数量与单据是否一致',
          '外观无破损/污染/杂质，裁切平滑',
          '印刷内容印刷是否清晰',
      ],


    //耗材出入库类型
    'material_in_subtype' => [1 => '采购入库', 3 => '领取入库', 4=> '其它入库',20=>'换码入库',22=>'盘盈入库',23=>'赠品入库',24=>'二次入库', 27=>'报损入库',29 => '维修入库'],
    'material_out_subtype' => [7 => '报损出库', 16=> '销售出库' , 17=>'盘亏出库',21=>'换码出库',8 => '其它出库',26=>'退货出库'],
    'yp_detail_subtype' => [ 2 => '常规入库', 4=> '其它入库', 5 => '常规出库',  8 => '其它出库',  9=>'贴标入库', 10=>'贴标出库',12=>'返药入库',13=>'包装&标签入库',14=>'返药出库',15=>'包装&标签出库',16=>'回收药入库',20=>'销毁出库',18=>'移出出库',19=>'移入入库'],

    'detail_subtype' => [1 => '采购入库', 2 => '常规入库', 3 => '领取入库', 4=> '其它入库', 5 => '常规出库', 6 => '领取出库', 7 => '报损出库', 8 => '其它出库',  9=>'调拨入库', 10=>'调拨出库', 11=>'盘点入库', 12=>'归还出库', 13=>'归还入库', 16=> '销售出库' , 17=>'盘亏出库','18'=>'移出出库','19'=>'移入入库','20'=>'换码入库','21'=>'换码出库',22=>'盘盈入库',23=>'赠品入库',24=>'二次入库', 25=>'领用出库',26=>'退货出库', 27=>'报损入库',29 => '维修入库'],

    // //其他费用列表的
    'ots_feetype' => [1 => '证件代办费', 2 => '仓储管理费', 3 => '设备耗材费',4 => '劳务支出费', 5 => '其他费用'],
    //------------------对账单配置------------------
    'monthly_statement_type' => [0 =>'未开票', 1 =>'已开票', 2 =>'取消'],
    'ourbank' => [1 => '工商银行', 2 =>'外币收入' , 3 =>'财务现金',4 =>'其他坏账',5 =>'招商银行',7 => '汇兑损益',8=>'支付宝',9=>'微信',10=>'上海生生医药冷链科技股份有限公司',11=>'宴嘉供应链管理（武汉）有限公司',12=>'湖南生生供应链管理有限公司',13=>'调整单',14=>'上海宴嘉农商行',15=>'北生（北京）供应链管理有限公司',16=>'国际回款调整',17=>'非应收回款调整',18=>'应付冲应收'],
    //回款调整单对应 客户id和开票id
    'adjust_id' => ['cu_id'=>20120478,'bi_id'=>182],

    //------------------工作单表表配置------------------
    'ow_type'=>[1=>'取件',2=>'发货',3=>'派件',4=>'提派',5=>'提发',6=>'取派',7=>'提货','8'=>'取存','9'=>'提存','10'=>'存货','11'=>'取发','12'=>'方案调拨'],
    //------------------操作表配置------------------
    'opn_type'=>[1=>'取件',2=>'派件',3=>'发货',4=>'提货'],
    'opn_status'=>[0=>'未录入',1=>'已录入',2=>'已审核',3=>'已批准',5=>'已支付',6=>'不通过',7=>'已删除'],
    'opn_order_type'=>[1=>'其它订单',2=>'脐血订单'],
    //----------------子仓类型配置----------------------

    'sub_type'=>[1=>'耗材仓',2=>'药品仓',5=>'样本仓' , 6=>'资产仓'],
    //运营仓类型配置
    'operate_sub_type'=>[1=>'耗材仓',6=>'资产仓'],
    //临床供应链仓类型配置
    'clinical_sub_type'=>[2=>'药品仓',5=>'样本仓'],

    //--------------------开票单配置-----------------------
    //开票单所属类型
    'realbill_type' => [0=>'普票', 1=>'专票',2=>'电子发票' ],
    //应收结转记录配置
    '_cdr_type' => [1=>'结算确认',2=>'回款确认'],
    //--------------------其他结算单配置-----------------------
    'ots_feetypes' => [ 1 =>'证件代办费',2 => '仓储管理费', 3 =>'设备耗材费', 4=> '劳务支出费',6=>'免单理赔费',7=>'折扣调整费', 8=>'贴标费用',9=>'验证费用', 10=>'销毁费用',11=>'年度折扣',  5=> '其他费用'],
    'ots_feetype' => [ 1 =>'证件代办费', 3 =>'设备耗材费', 4=> '劳务支出费',6=>'免单理赔费',7=>'折扣调整费', 8=>'贴标费用',9=>'验证费用',10=>'销毁费用',11=>'年度折扣',   5=> '其他费用'],
'ots_feetype_create' => [ 1 =>'证件代办费', 3 =>'设备耗材费', 4=> '劳务支出费',6=>'免单理赔费',7=>'折扣调整费', 8=>'贴标费用', 9=>'验证费用', 11=>'年度折扣', 5=> '其他费用',],
//--------------------结算调整单费用类型处理-----------------------
    'ai_feetypes' => [ 1 =>'证件代办费',3 =>'设备耗材费', 4=> '劳务支出费',6=>'免单理赔费',7=>'折扣调整费', 8=>'贴标费用',9=>'验证费用', 10=>'销毁费用',11=>'年度折扣', 5=> '其他费用',100=>'物流费用',2=>'药品费用',200=>'样本费用'],

    //--------------------税率配置-----------------------
    'tax_rate' => [ 1 =>0, 2 => 0.06, 3 =>0.1, 4 =>0.16, 5 =>0.13, 6 =>0.09],

    //--------------------开票服务类型-----------------------
     //百旺用开票服务
    'rb_type' => [ 1 =>'冷链科技物流服务', 2 => '医药冷链配送服务', 3 =>'仓储费' , 4 =>'租赁费' ,5 =>'销售', 6 => '国际冷链物流', 7 =>'冷链科技物流服务' ,8 =>'仓储费', 9 => '销售', 10 => '租赁费'],
    //管理用开票服务
    'rb_typeoms' => [ 1 =>'冷链科技物流服务 10%', 2 => '医药冷链配送服务 6%', 3 =>'仓储费 6%' , 4 =>'租赁费 16%' , 5 => '销售 16%' , 6 => '国际冷链物流 0%',7 =>'冷链科技物流服务 9%' ,8 =>'仓储费 13%', 9 => '销售 13%', 10 => '租赁费 13%'],
    //开票所用的快递名称
    'rb_express' => [ 1 =>'圆通', 2 => '顺丰'],
    //短信发送状态
    'sl_status' => [1 =>'发送成功', 2 => '发送失败'],
    //管理用申请开票税率
    'rb_rateoms' => [ 1 => 0.1, 2 => 0.06, 3 => 0.06 , 4 => 0.16 , 5 => 0.16, 6=>0, 7 => 0.09 ,8 => 0.13, 9=>0.13,10 => 0.13],

    //--------------------实开发票配置-----------------------
    //实开发票状态
    // 'invoice_status' => [ 1 =>'待开票', 2 => '已开票', 3 =>'预开票' , 4 =>'已作废' ,5 =>'已删除',6=>'已销账'],
    'invoice_status' => [ 1 =>'待开票', 2 => '已开票',  4 =>'已作废' ,5 =>'已删除',6=>'已销账', 7=>'待打印'],
    //开票方式
    'invoice_type' => [ 1 =>'金税开票', 2 => '冲预开票', 3 =>'不开票' ,4=>'电子开票', 5=>'百旺开票', 7=> '全电票',8=> '非预开票', 6=> '其他'],
    
    //--------------------质控文件管理配置-----------------------
    //  校准证书有效期配置
    'indate_type' => [ 1 =>'1个月', 2 => '3个月', 3 =>'6个月', 4=> '12个月', 5=> '24个月'],

    //--------------------客户微信账号配置-----------------------
    //  绑定状态
    'we_chat_stutas' => [ 1 =>'已绑定', 2 => '已解绑', 3 =>'待审核'],

        //--------------------外勤操作类型-----------------------
    //  操作类型
    // 'server_type' => [ 1 =>'电脑操作', 2 => 'm3操作', 3 =>'服务号',4 =>'操作号'],
    'server_type' => [ 1 =>'oms系统', 2 => 'm3', 3 =>'微信服务号',4 =>'微信操作号',5 =>'客户oms系统',6=>'API接口',7=>'操作端APP',8=>'邮件',9=>'小程序', 10 => '企业微信'],
    //外协设备
    'equipment'=>[1=>'冰箱',2=>'恒温箱',3=>'斯特林机',4=>'仓库',5=>'其他'],
    //--------------------用户账号状态-----------------------
    //  用户状态  
    'ur_status' => [ 0 =>'正常', 1 => '锁定'],

    //--------------------外协结算方式-----------------------
    //  外协结算方式
    'oper_type' => [ 0 =>'日结', 1 => '周结', 2 => '运满满',3=>'云南外包'],

    //--------------------办事处配置-----------------------
    'office_type' => [0 => '创建办事处支出',1=>'办事处支出审核',3=>'办事处支出修改',4=>'办事处支出删除',5=>'创建办事处收入',6=>'办事处收入修改',7=>'办事处收入删除',8=>'办事处结转'],

    //--------------------存货配置-----------------------
    'sto_type'=>[ 3010 =>'添加存货',3011=>"修改存货",3012=>'删除存货', 3013 => '添加批号', 3014 => '编辑批号', 3015 => '删除批号', 3016 => '人工锁定','3017'=>'人工解锁','3018'=>'存货审核'],

    //--------------------仓库配置原-----------------------
    'house_type'=>[4001=>'修改仓库',
        4002=>'创建一级子仓',4003=>'修改一级子仓',4004=>'冻结一级子仓',
        4005=>'创建二级子仓',4006=>'修改二级子仓',4007=>'冻结二级子仓',
        4008=>'创建三级子仓', 4009=>'修改三级子仓',4010=>'冻结三级子仓'
    ],
       //--------------------仓库配置新-----------------------
    'house_type2'=>[40011=>'修改仓库',
        4012=>'创建仓库',4013=>'修改仓库',4014=>'冻结仓库',
        4015=>'创建货架',4016=>'修改货架',4017=>'冻结货架',
        4018=>'创建货位', 4019=>'修改货位',4020=>'冻结货位',4028=>'冻结货位还原',
        4021=>'绑定温度计探头',4022=>'启用温度计探头',4023=>'停用温度计探头',4024=>'删除温度计探头',
        4025=>'修改温度',4026=>'温度质量确认',4027=>'绑定温度计探头添加备注',4028 => '创建冰箱', 4029 => '修改冰箱', 4030 => '冻结冰箱'
    ],
    //测试添加药品库存指定货架
    'add_yp_inventory_sw' => [
        'sw_id'   =>  25840,
        'sw_no'  => '0021231012' ,
    ],

    'cu_project_type'=>[
        1=>'临床',
        2=>'商业成品药',
        3=>'IVD试剂',
        4=>'脐带血',
        5=>'细胞',
        6=>'特检普检',
        //0为其他，数据库里并没有0类型，这个字段作为数据统计用，0:为订单cp_id=0项目序号为0使用统计
        0=>'其他',
        //新加项目类型
        7=>'其他1',
    ],

    //--------------------指派联系人权限范围-----------------------
    //角色对应关系  25 运营操作主管  13 运营操作专员 30 运营操作组长 36 运营站点操作专员 37 运营站点操作组长
    //  指派给组长角色范围
    'assign_dr_arr' => [25,30,37],
    //  指派给操作员角色范围  
    'assign_op_arr' => [ 13,25,30,36,37],
    
    // 营销项目角色
    'customer_emp_user' =>  [15,47,55],

    // 投保价值监控额度
    'insure_value'=>50000,
    //短信模板
    'sms' => [ array('title' => '送达通知', 'content' => '您好！[%s]您从%s城市发往%s城市的冷链货物已于%s由%s安全签收，生生物流4000-121-321。') ],

    //邮件模板
    'email' => [
        array('title' => '[%s]送达通知',
            'content' => '<p>尊敬的客户，您好！<br/> 您%s从%s发往%s的冷链货物已于%s由%s安全签收!<br/> [运输单号：%s]<br/>[项目编号：%s]</p>',
            'signname' => '<p>如您有任何疑问欢迎致电生生物流.<br/>祝：工作愉快！<br/>客服中心-[%s]<br/>上海生生物流有限公司<br/>客服电话：4000-121-321/021-54296788<br/>接单邮箱：cs@ashsh.cn<br/>服务生物医药，专注冷链物流</p>'
            ), 
    ],
    //邮件模板  
    'email2' => [
        array('title' => '[%s]温度数据',
            'content' => '<p>尊敬的客户，您好！<br/>[项目编号：%s]<br/> 您%s从%s发往%s的物流订单的温度数据如下：</p>',
            'signname' => '<p>如您有任何疑问欢迎致电生生物流.<br/>祝：工作愉快！<br/>客服中心-[%s]<br/>上海生生物流有限公司<br/>客服电话：4000-121-321/021-54296788<br/>接单邮箱：cs@ashsh.cn<br/>服务生物医药，专注冷链物流</p>'
            ), 
    ],
    'time_month'=>array(
        date("Ym")=>date("Ym"),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)+1,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)+1,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)+2,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)+2,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-1,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-1,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-2,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-2,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-3,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-3,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-4,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-4,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-5,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-5,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-6,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-6,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-7,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-7,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-8,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-8,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-9,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-9,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-10,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-10,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-11,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-11,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-12,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-12,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-13,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-13,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-14,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-14,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-15,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-15,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-16,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-16,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-17,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-17,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-18,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-18,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-19,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-19,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-20,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-20,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-21,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-21,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-22,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-22,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-23,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-23,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-24,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-24,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-25,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-25,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-26,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-26,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-27,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-27,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-28,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-28,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-29,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-29,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-30,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-30,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-31,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-31,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-32,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-32,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-33,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-33,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-34,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-34,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-35,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-35,1,substr(date("Ym"),0,4))),
        date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-36,1,substr(date("Ym"),0,4)))=>date("Ym",mktime(0,0,0,substr(date("Ym"),4,2)-36,1,substr(date("Ym"),0,4)))
    ),
    //校准机构类型
    'at_mechanism' => [1=>'生生内校',2=>'厂家校准',3=>'第三方校准-检测机构',4=>'第三方校准-计量院'],
    'relation_status' => [0=>'待确认',1=>'正常',2=>'锁定'],
    //客户领域
    'customer_area' => [1=>'科研',2=>'商业'],
    //城市类别
    'city_category' => [1=>'一类',2=>'二类',3=>'三类',4=>'四类',5=>'五类',6=>'特类',7=>'省内',8=>'同城'],
 
    //-------------------质控异常分类-------------------
    //一级异常
    'qc_one_ab' => [1 => '温度数据异常', 2 => '丢破异常', 3 => '出入库异常'],
    //二级异常
    'qc_two_ab' => [
        1 => [
             2 => '包装不规范', 3 => '换冰排不规范',  5 => '开启超温', 4 => '干冰波动大', 6 => '开启后超温', 10 => '取件不规范',
            11 => '未正常开启',8 => '派件不规范', 9 => '未正常关闭', 7 => '模板错误',   12 => '数据丢失',  13 => '温度计异常', 
            14 => '湿度超标',1 => 'SOP不合格', 15 => '其他'
        ],
        2 => [1 => '丢失', 2 => '破损'],
        3 => [1 => '出库', 2 => '入库']
    ],
    //三级异常
    'qc_thr_ab' => [
        1 => [
            2 =>  [1 => '前期超温', 2 => '后期超温', 3 => '全程超温', 4 =>'包装时开启温度计'],
            3 =>  [1 => '换冰排高温', 2 => '换冰排低温', 3 => '未换冰排'],
            4 =>  [1 => '取件波动', 2 => '路由波动', 3 => '派件波动'],
            5 =>  [1 => '开启高温', 2 => '开启低温'],
            6 =>  [1 => '药品',     2 => '样本'],
            7 =>  [1 => '温区',      2 => '记录间隔', 3 => '标题' , 4 => '时间'],
            9 =>  [1 => '早关',     2 => '晚关'],
            10 => [1 => '提前开温度计', 2 => '运单信息填写错误'],
            8 =>  [1 => '关闭超温', 2 => '运单信息填写错误'],
            11 => [1 => '未开',    2 => '晚开',     3 =>'开启后关闭'],
            13 => [1 => '序列号不符', 2 => '波动异常', 3 => '提前关闭ERR', 4 => '提前关闭无ERR', 5 => '白屏', 6 => '其他']
        ],
        2 => [
            1 => [1 => '药品', 2 => '样本', 3 => '客户文件']
        ],
    ],
    //异常操作日志
    'qc_log_type' => [101 => '异常', 101 => '理赔', 102 => '投诉'],
    'qc_log_subtype' => [
            101 => [ 1 => '创建异常', 2 => '异常调查', 3 => '责任部门', 4 => '质量中心', 5 => '修改调查', 6 => '数据上传', 7 => '关闭异常'],
    ],
    //客户级别
    'customer_level'=>[
        1=>'A重要',
        2=>'B普通',
        3=>'BA潜力',
    ],
    //客户结算类型
    'knot_type'=>[
        1=>'现结',
        2=>'月结',
        // 3=>'季结',
        // 4=>'其他',
    ],
    //合同类型
    'contract_type'=>[
        1=>'物流',
        2=>'仓储',
        3=>'销毁',
        5=>'冷链服务',
        6=>'补充协议',
        7=>'报价表',
        8=>'货运',
        9=>'保险',
        10=>'采购',
        11=>'保密协议',
        12=>'赔偿',
        13=>'租赁合同',
        14=>'质量',
        4=>'其他',
    ],
    //活动类型
    'activity_type'=>[
        1=>'展商参会',
        2=>'个人参会',
        3=>'网络广告营销',
    ],
    //活动状态
    'activity_status'=>[
        1=>'计划中',
        2=>'已购买',
        3=>'已结束',
        4=>'已取消',
    ],
    //工作类型
    'work_type'=>[
        1=>'开发新客户',
        2=>'开发老客户新项目',
        3=>'维护客情关系',
        4=>'维护对账回款',
        5=>'维护投诉协调',
        6=>'活动参加展会',
        7=>'其他事宜',
    ],
    //客户来源
    'customer_source'=>[
        1=>'自己开发',
        2=>'公司分配',
        3=>'一线反馈',
    ],
    //客户状态
    'customer_status'=>[
        1=>'需求确定',
        2=>'方案报价',
        3=>'谈判审核',
        4=>'已签合约',
        5=>'正常合作',
    ],
    //收费类型
    'charge_type'=>[
        1=>'温度记录',
        2=>'法定假日',
        3=>'操作空跑',
        4=>'超长等待',
        5=>'超远距离',
        6=>'签单返回',
    ],
    //温度记录类型货物类型
    'temperature_record_type'=>[
        1=>'2-8℃',
        2=>'10-15℃',
    ],
    //费用类型
    'cost_type'=>[
    1=>'普通(生生温度计)',
    2=>'特殊(客户和生生温度计,生生+GPS温度计)',
    8=>'生生国内+国际温度计',
    10=>'生生温湿度计',
    ],
    //鼎为温度计升级编号设定
    'ding_number'=>[
        'T21600E7','T215002E','T2150058','T2160017','T216010E','T0170039'
    ],
    //嘉和部门分类
    'ol_static_class'=>[
        1 => '上游工艺部（USP）',
        2 => '下游工艺部 （DSP）',
        3 => '质量控制部（QC）',
        4 => '分析与制剂开发部(ASF)',
        5 => '新药研发部（PR&D）',
        6 => '临床生产部（PR)',
        7 => '临床医学部'
    ],
    //计划箱型类型,1.VIP类 2 EP类  3.液氮类 4.其他
      'odplboxs'=>[
        '0'=>['sto_id'=>'200648','sto_name'=>'VIP6N保温箱','type'=>'1'],
        '1'=>['sto_id'=>'27','sto_name'=>'VIP12保温箱','type'=>'1'],
        '2'=>['sto_id'=>'25','sto_name'=>'VIP16保温箱','type'=>'1'],
        '3'=>['sto_id'=>'24','sto_name'=>'VIP28保温箱','type'=>'1'],
        '4'=>['sto_id'=>'200646','sto_name'=>'VIP36保温箱','type'=>'1'],
        '5'=>['sto_id'=>'20','sto_name'=>'VIP56保温箱','type'=>'1'],
        '6'=>['sto_id'=>'21','sto_name'=>'VIP96保温箱','type'=>'1'],
        '7'=>['sto_id'=>'201417','sto_name'=>'VIP100保温箱','type'=>'1'],
        '8'=>['sto_id'=>'201418','sto_name'=>'VIP168保温箱','type'=>'1'],
        '9'=>['sto_id'=>'205996','sto_name'=>'VIP28保温箱-套箱','type'=>'1'],
        '10'=>['sto_id'=>'205997','sto_name'=>'VIP56保温箱-套箱','type'=>'1'],
        '11'=>['sto_id'=>'205998','sto_name'=>'VIP96保温箱-套箱','type'=>'1'],
        '12'=>['sto_id'=>'205465','sto_name'=>'VIP6N保温箱-外显','type'=>'1'],
        '13'=>['sto_id'=>'205466','sto_name'=>'VIP16保温箱-外显','type'=>'1'],
        '14'=>['sto_id'=>'205467','sto_name'=>'VIP28保温箱-外显','type'=>'1'],
        '15'=>['sto_id'=>'205468','sto_name'=>'VIP36保温箱-外显','type'=>'1'],
        '16'=>['sto_id'=>'205469','sto_name'=>'VIP56保温箱-外显','type'=>'1'],
        '17'=>['sto_id'=>'205261','sto_name'=>'VIP96保温箱-外显','type'=>'1'],
        '18'=>['sto_id'=>'205262','sto_name'=>'VIP100保温箱-外显','type'=>'1'],
        '32'=>['sto_id'=>'208007','sto_name'=>'VIP58保温箱','type'=>'1'],
        '33'=>['sto_id'=>'209567','sto_name'=>'VIP6M+保温箱','type'=>'1'],
        '34'=>['sto_id'=>'209568','sto_name'=>'VIP16M+保温箱','type'=>'1'],
        '35'=>['sto_id'=>'209569','sto_name'=>'VIP36M+保温箱','type'=>'1'],
        '36'=>['sto_id'=>'209570','sto_name'=>'VIP56M+保温箱','type'=>'1'],
        '37'=>['sto_id'=>'210577','sto_name'=>'VIP168保温箱-外显','type'=>'1'],
        '38'=>['sto_id'=>'15','sto_name'=>'VIP4保温箱','type'=>'1'],
'39'=>['sto_id'=>'206882','sto_name'=>'VIP6S保温箱','type'=>'1'],
'40'=>['sto_id'=>'209105','sto_name'=>'VIP210保温箱','type'=>'1'],
'41'=>['sto_id'=>'209782','sto_name'=>'VIP500保温箱','type'=>'1'],
'42'=>['sto_id'=>'209787','sto_name'=>'VIP560保温箱','type'=>'1'],
'43'=>['sto_id'=>'209837','sto_name'=>'VIP380保温箱','type'=>'1'],
'44'=>['sto_id'=>'209838','sto_name'=>'VIP520保温箱','type'=>'1'],
'45'=>['sto_id'=>'209918','sto_name'=>'VIP4B背带箱','type'=>'1'],
'46'=>['sto_id'=>'211256','sto_name'=>'VIP6B背带箱','type'=>'1'],
'47'=>['sto_id'=>'211333','sto_name'=>'VIP16B背带箱','type'=>'1'],
'48'=>['sto_id'=>'211538','sto_name'=>'VIP255保温箱','type'=>'1'],
'49'=>['sto_id'=>'211595','sto_name'=>'VIP850保温箱','type'=>'1'],
        '19'=>['sto_id'=>'204956','sto_name'=>'EP6泡沫箱','type'=>'2'],
        '20'=>['sto_id'=>'204957','sto_name'=>'EP15泡沫箱','type'=>'2'],
        '21'=>['sto_id'=>'204958','sto_name'=>'EP25泡沫箱','type'=>'2'],
        '22'=>['sto_id'=>'205263','sto_name'=>'EP53泡沫箱','type'=>'2'],
        '23'=>['sto_id'=>'205264','sto_name'=>'EP133泡沫箱','type'=>'2'],
        '24'=>['sto_id'=>'202874','sto_name'=>'液氮罐','type'=>'3'],
        '25'=>['sto_id'=>'206112','sto_name'=>'脐血库专用','type'=>'4'],
        '26'=>['sto_id'=>'202758','sto_name'=>'客户包装','type'=>'4'],
        '30'=>['sto_id'=>'207378','sto_name'=>'客户包装-托盘','type'=>'4'],
        '31'=>['sto_id'=>'207379','sto_name'=>'客户包装-非托盘','type'=>'4'],
        '27'=>['sto_id'=>'206869','sto_name'=>'合件专用包装','type'=>'4'],
        '28'=>['sto_id'=>'206860','sto_name'=>'协和发酵专用套箱-大号','type'=>'5'],
        '29'=>['sto_id'=>'206861','sto_name'=>'协和发酵专用套箱-小号','type'=>'5'],
    ],
    //工单类型
    'work_order_type'=>[
        '6' => '特殊温度',
        '7' => '特殊要求',
        '8' => '易碎',
        '9' => '时效',
        '5' => '投保',
        '10'=> '风险外协',
        '11'=> '暂存管控',
        '12'=> '批量取派',
        '1' => '温度异常',
        '2' => '运输时效',
        '3' => '运输要求',
        '4' => '其他',
        '13' => '温度计故障',
        '14' => 'VIP保温箱异常'
    ],

    //城市规定时效
    'Prescribedtime' => [
        1=> ['name'=>'北京市','time'=>'48'],
        2=> ['name'=>'天津市','time'=>'48'],
        3=> ['name'=>'上海市','time'=>'72'],
        4=> ['name'=>'重庆市','time'=>'48'],
        5=> ['name'=>'安庆市','time'=>'96'],
        6=> ['name'=>'蚌埠市','time'=>'96'],
        7=> ['name'=>'亳州市','time'=>'96'],
        8=> ['name'=>'巢湖市','time'=>'96'],
        9=> ['name'=>'马鞍山市','time'=>'96'],
        10=> ['name'=>'池州市','time'=>'96'],
        11=> ['name'=>'滁州市','time'=>'96'],
        12=> ['name'=>'丹阳市','time'=>'96'],
        13=> ['name'=>'阜阳市','time'=>'96'],
        14=> ['name'=>'山南市','time'=>'96'],
        15=> ['name'=>'宿州市','time'=>'96'],
        16=> ['name'=>'太和市','time'=>'96'],
        17=> ['name'=>'合肥市','time'=>'96'],
        18=> ['name'=>'淮北市','time'=>'96'],
        19=> ['name'=>'淮南市','time'=>'96'],
        20=> ['name'=>'黄山市','time'=>'96'],
        21=> ['name'=>'铜陵市','time'=>'96'],
        22=> ['name'=>'芜湖市','time'=>'96'],
        23=> ['name'=>'界首市','time'=>'96'],
        24=> ['name'=>'六安市','time'=>'96'],
        25=> ['name'=>'宣城市','time'=>'96'],
      //  26=> ['name'=>'阜南县市','time'=>'96'],
       // 27=> ['name'=>'寿县市','time'=>'96'],
        28=> ['name'=>'龙岩市','time'=>'96'],
        29=> ['name'=>'南平市','time'=>'96'],
        30=> ['name'=>'宁德市','time'=>'96'],
        31=> ['name'=>'莆田市','time'=>'96'],
        32=> ['name'=>'福州市','time'=>'72'],
        33=> ['name'=>'泉州市','time'=>'96'],
        34=> ['name'=>'三明市','time'=>'96'],
        35=> ['name'=>'邵武市','time'=>'96'],
        36=> ['name'=>'厦门市','time'=>'72'],
        37=> ['name'=>'漳州市','time'=>'96'],
        38=> ['name'=>'建瓯市','time'=>'96'],
        39=> ['name'=>'古田市','time'=>'96'],
        40=> ['name'=>'白银市','time'=>'96'],
        41=> ['name'=>'陇南市','time'=>'96'],
        42=> ['name'=>'平凉市','time'=>'96'],
        43=> ['name'=>'定西市','time'=>'96'],
        44=> ['name'=>'甘南市','time'=>'96'],
        45=> ['name'=>'皋兰县市','time'=>'96'],
        46=> ['name'=>'嘉峪关市','time'=>'96'],
        47=> ['name'=>'天水市','time'=>'96'],
        48=> ['name'=>'武威市','time'=>'96'],
        49=> ['name'=>'庆阳市','time'=>'96'],
        50=> ['name'=>'金昌市','time'=>'96'],
        51=> ['name'=>'酒泉市','time'=>'96'],
        52=> ['name'=>'兰州市','time'=>'72'],
        53=> ['name'=>'临夏市','time'=>'96'],
        54=> ['name'=>'张掖市','time'=>'96'],
      //  55=> ['name'=>'榆中县市','time'=>'96'],
        56=> ['name'=>'潮州市','time'=>'72'],
        57=> ['name'=>'茂名市','time'=>'72'],
        58=> ['name'=>'梅州市','time'=>'96'],
        59=> ['name'=>'普宁市','time'=>'96'],
        60=> ['name'=>'清远市','time'=>'72'],
        61=> ['name'=>'东莞市','time'=>'72'],
        62=> ['name'=>'佛山市','time'=>'72'],
        63=> ['name'=>'汕头市','time'=>'96'],
        64=> ['name'=>'汕尾市','time'=>'96'],
        65=> ['name'=>'韶关市','time'=>'96'],
        66=> ['name'=>'深圳市','time'=>'72'],
        67=> ['name'=>'四会市','time'=>'72'],
        68=> ['name'=>'中山市','time'=>'72'],
        69=> ['name'=>'河源市','time'=>'96'],
        70=> ['name'=>'惠州市','time'=>'72'],
        71=> ['name'=>'珠海市','time'=>'72'],
        72=> ['name'=>'广州市','time'=>'72'],
        73=> ['name'=>'江门市','time'=>'72'],
        74=> ['name'=>'揭阳市','time'=>'96'],
        75=> ['name'=>'阳江市','time'=>'96'],
        76=> ['name'=>'云浮市','time'=>'96'],
        77=> ['name'=>'湛江市','time'=>'72'],
        78=> ['name'=>'肇庆市','time'=>'72'],
        79=> ['name'=>'增城市市','time'=>'72'],
        80=> ['name'=>'百色市','time'=>'96'],
        81=> ['name'=>'北海市','time'=>'96'],
        82=> ['name'=>'南宁市','time'=>'72'],
        83=> ['name'=>'钦州市','time'=>'96'],
        84=> ['name'=>'崇左市','time'=>'96'],
        85=> ['name'=>'防城港市','time'=>'96'],
        86=> ['name'=>'河池市','time'=>'96'],
        87=> ['name'=>'贺州市','time'=>'96'],
        88=> ['name'=>'梧州市','time'=>'96'],
        89=> ['name'=>'桂林市','time'=>'96'],
        90=> ['name'=>'贵港市','time'=>'96'],
        91=> ['name'=>'来宾市','time'=>'96'],
        92=> ['name'=>'玉林市','time'=>'96'],
        93=> ['name'=>'柳州市','time'=>'72'],
        94=> ['name'=>'宜春市','time'=>'96'],
       // 95=> ['name'=>'柳江县市','time'=>'96'],
        96=> ['name'=>'安顺市','time'=>'96'],
        97=> ['name'=>'毕节市','time'=>'96'],
        98=> ['name'=>'黔东南苗族侗族自治州','time'=>'96'],
        99=> ['name'=>'黔南布依族苗族自治州','time'=>'96'],
        //100=> ['name'=>'黔西南市','time'=>'96'],
        101=> ['name'=>'遵义市','time'=>'96'],
        102=> ['name'=>'贵阳市','time'=>'72'],
        103=> ['name'=>'铜仁市','time'=>'96'],
        104=> ['name'=>'六盘水市','time'=>'96'],
        105=> ['name'=>'白沙市','time'=>'96'],
        106=> ['name'=>'保亭市','time'=>'96'],
        107=> ['name'=>'儋州市','time'=>'96'],
        108=> ['name'=>'定安市','time'=>'96'],
        109=> ['name'=>'东方市','time'=>'96'],
        110=> ['name'=>'三亚市','time'=>'72'],
        111=> ['name'=>'澄迈市','time'=>'96'],
        112=> ['name'=>'海口市','time'=>'72'],
        113=> ['name'=>'屯昌市','time'=>'96'],
        114=> ['name'=>'万宁市','time'=>'96'],
        115=> ['name'=>'文昌市','time'=>'96'],
        116=> ['name'=>'乐东市','time'=>'96'],
        117=> ['name'=>'临高市','time'=>'96'],
        118=> ['name'=>'陵水市','time'=>'96'],
        119=> ['name'=>'琼中市','time'=>'96'],
        120=> ['name'=>'琼海市','time'=>'96'],
        121=> ['name'=>'保定市','time'=>'72'],
        122=> ['name'=>'沧州市','time'=>'72'],
        123=> ['name'=>'秦皇岛市','time'=>'72'],
        124=> ['name'=>'唐山市','time'=>'72'],
        125=> ['name'=>'承德市','time'=>'72'],
        126=> ['name'=>'任丘市','time'=>'72'],
        127=> ['name'=>'石家庄市','time'=>'72'],
       // 128=> ['name'=>'正定县市','time'=>'72'],
        129=> ['name'=>'邯郸市','time'=>'72'],
        130=> ['name'=>'衡水市','time'=>'72'],
        //131=> ['name'=>'望都县市','time'=>'96'],
        132=> ['name'=>'廊坊市','time'=>'72'],
        133=> ['name'=>'邢台市','time'=>'72'],
        134=> ['name'=>'张家口市','time'=>'72'],
        135=> ['name'=>'迁安市','time'=>'72'],
        136=> ['name'=>'衡水市','time'=>'72'],
        //137=> ['name'=>'宁晋县市','time'=>'72'],
        138=> ['name'=>'平乡市','time'=>'72'],
        139=> ['name'=>'安阳市','time'=>'96'],
        140=> ['name'=>'洛阳市','time'=>'96'],
        141=> ['name'=>'漯河市','time'=>'96'],
        142=> ['name'=>'南阳市','time'=>'96'],
        143=> ['name'=>'平顶山市','time'=>'96'],
        144=> ['name'=>'濮阳市','time'=>'96'],
        145=> ['name'=>'信阳市','time'=>'96'],
        146=> ['name'=>'周口市','time'=>'96'],
        147=> ['name'=>'郑州市','time'=>'72'],
        148=> ['name'=>'三门峡市','time'=>'96'],
        149=> ['name'=>'商丘市','time'=>'96'],
        150=> ['name'=>'鹤壁市','time'=>'96'],
        151=> ['name'=>'济源市','time'=>'96'],
        152=> ['name'=>'驻马店市','time'=>'96'],
        153=> ['name'=>'焦作市','time'=>'96'],
        154=> ['name'=>'开封市','time'=>'96'],
        155=> ['name'=>'许昌市','time'=>'96'],
        156=> ['name'=>'新乡市','time'=>'96'],
        157=> ['name'=>'牡丹江市','time'=>'48'],
        158=> ['name'=>'七台河市','time'=>'48'],
        159=> ['name'=>'齐齐哈尔市','time'=>'48'],
        160=> ['name'=>'大庆市','time'=>'48'],
        161=> ['name'=>'大兴安岭市','time'=>'72'],
        162=> ['name'=>'双鸭山市','time'=>'48'],
        163=> ['name'=>'绥化市','time'=>'48'],
        164=> ['name'=>'哈尔滨市','time'=>'24'],
        165=> ['name'=>'鹤岗市','time'=>'48'],
        166=> ['name'=>'黑河市','time'=>'48'],
        167=> ['name'=>'鸡西市','time'=>'48'],
        168=> ['name'=>'佳木斯市','time'=>'48'],
        169=> ['name'=>'伊春市','time'=>'48'],
        170=> ['name'=>'富锦市','time'=>'72'],
        171=> ['name'=>'潜江市','time'=>'96'],
        172=> ['name'=>'当阳市','time'=>'120'],
        173=> ['name'=>'鄂州市','time'=>'96'],
        174=> ['name'=>'恩施市','time'=>'120'],
        175=> ['name'=>'神农架市','time'=>'96'],
        176=> ['name'=>'十堰市','time'=>'96'],
        177=> ['name'=>'随州市','time'=>'96'],
        178=> ['name'=>'黄冈市','time'=>'96'],
        179=> ['name'=>'黄石市','time'=>'96'],
        180=> ['name'=>'天门市','time'=>'96'],
        181=> ['name'=>'武汉市','time'=>'72'],
        182=> ['name'=>'仙桃市','time'=>'96'],
        183=> ['name'=>'咸宁市','time'=>'96'],
        184=> ['name'=>'襄阳市','time'=>'96'],
        185=> ['name'=>'襄樊市','time'=>'96'],
        186=> ['name'=>'孝感市','time'=>'96'],
       // 187=> ['name'=>'京山县市','time'=>'120'],
        188=> ['name'=>'荆门市','time'=>'96'],
        189=> ['name'=>'荆州市','time'=>'96'],
        190=> ['name'=>'宜昌市','time'=>'72'],
        191=> ['name'=>'竹溪市','time'=>'120'],
        192=> ['name'=>'长沙市','time'=>'72'],
        193=> ['name'=>'常德市','time'=>'96'],
        194=> ['name'=>'娄底市','time'=>'96'],
        195=> ['name'=>'株洲市','time'=>'96'],
        196=> ['name'=>'郴州市','time'=>'96'],
        197=> ['name'=>'邵阳市','time'=>'96'],
        198=> ['name'=>'衡阳市','time'=>'96'],
        199=> ['name'=>'怀化市','time'=>'96'],
        200=> ['name'=>'湘潭市','time'=>'96'],
        201=> ['name'=>'湘西市','time'=>'96'],
        202=> ['name'=>'浏阳市','time'=>'96'],
        203=> ['name'=>'益阳市','time'=>'96'],
        204=> ['name'=>'永州市','time'=>'96'],
        205=> ['name'=>'岳阳市','time'=>'96'],
        206=> ['name'=>'张家界市','time'=>'96'],
        207=> ['name'=>'吉首市','time'=>'96'],
        208=> ['name'=>'白城市','time'=>'24'],
        209=> ['name'=>'白山市','time'=>'48'],
        210=> ['name'=>'长春市','time'=>'12'],
        211=> ['name'=>'四平市','time'=>'24'],
        212=> ['name'=>'松原市','time'=>'24'],
        213=> ['name'=>'吉林市','time'=>'24'],
        214=> ['name'=>'通化市','time'=>'48'],
        215=> ['name'=>'辽源市','time'=>'24'],
        216=> ['name'=>'延边市','time'=>'48'],
        217=> ['name'=>'梅河市','time'=>'48'],
        218=> ['name'=>'常州市','time'=>'72'],
        219=> ['name'=>'兴化市','time'=>'96'],
        220=> ['name'=>'泰州市','time'=>'96'],
        221=> ['name'=>'南京市','time'=>'48'],
        222=> ['name'=>'南通市','time'=>'72'],
        223=> ['name'=>'如皋市市','time'=>'96'],
       // 224=> ['name'=>'泗阳县市','time'=>'96'],
        225=> ['name'=>'苏州市','time'=>'72'],
        226=> ['name'=>'宿迁市','time'=>'96'],
        227=> ['name'=>'镇江市','time'=>'96'],
        228=> ['name'=>'淮安市','time'=>'96'],
        229=> ['name'=>'江阴市','time'=>'96'],
        230=> ['name'=>'无锡市','time'=>'96'],
        231=> ['name'=>'吴江市','time'=>'96'],
        232=> ['name'=>'响水市','time'=>'96'],
        233=> ['name'=>'金湖市','time'=>'96'],
        234=> ['name'=>'连云港市','time'=>'96'],
        235=> ['name'=>'溧阳市市','time'=>'96'],
        236=> ['name'=>'徐州市','time'=>'96'],
        237=> ['name'=>'盐城市','time'=>'72'],
        238=> ['name'=>'扬州市','time'=>'96'],
       // 239=> ['name'=>'扬州宝应县市','time'=>'96'],
        240=> ['name'=>'仪征市','time'=>'96'],
        241=> ['name'=>'太仓市','time'=>'96'],
        242=> ['name'=>'常熟市','time'=>'96'],
        243=> ['name'=>'沐阳县市','time'=>'96'],
        244=> ['name'=>'昌江市','time'=>'96'],
        245=> ['name'=>'新余市','time'=>'96'],
        246=> ['name'=>'南昌市','time'=>'72'],
        247=> ['name'=>'萍乡市','time'=>'96'],
        248=> ['name'=>'抚州市','time'=>'96'],
        249=> ['name'=>'赣州市','time'=>'96'],
        250=> ['name'=>'上饶市','time'=>'96'],
        251=> ['name'=>'吉安市','time'=>'96'],
        252=> ['name'=>'景德镇市','time'=>'96'],
        253=> ['name'=>'九江市','time'=>'96'],
        254=> ['name'=>'宜春市','time'=>'96'],
        255=> ['name'=>'鹰潭市','time'=>'96'],
        256=> ['name'=>'樟树市','time'=>'96'],
        257=> ['name'=>'德兴市','time'=>'96'],
        258=> ['name'=>'鞍山市','time'=>'48'],
        259=> ['name'=>'本溪市','time'=>'48'],
        260=> ['name'=>'朝阳市','time'=>'48'],
        261=> ['name'=>'盘锦市','time'=>'48'],
        262=> ['name'=>'大连市','time'=>'48'],
        263=> ['name'=>'丹东市','time'=>'48'],
        264=> ['name'=>'抚顺市','time'=>'48'],
        265=> ['name'=>'阜新市','time'=>'48'],
        266=> ['name'=>'沈阳市','time'=>'24'],
        267=> ['name'=>'葫芦岛市','time'=>'48'],
        268=> ['name'=>'铁岭市','time'=>'48'],
        269=> ['name'=>'锦州市','time'=>'48'],
        270=> ['name'=>'辽阳市','time'=>'48'],
        271=> ['name'=>'营口市','time'=>'48'],
        272=> ['name'=>'阿拉善盟','time'=>'96'],
        273=> ['name'=>'巴彦淖尔','time'=>'96'],
        274=> ['name'=>'包头市','time'=>'72'],
        275=> ['name'=>'赤峰市','time'=>'96'],
        276=> ['name'=>'鄂尔多斯市','time'=>'96'],
        277=> ['name'=>'海西蒙古族藏族自治州','time'=>'96'],
        278=> ['name'=>'呼和浩特市','time'=>'72'],
        279=> ['name'=>'呼伦贝尔市','time'=>'96'],
        280=> ['name'=>'通辽市','time'=>'72'],
        281=> ['name'=>'乌海市','time'=>'96'],
        282=> ['name'=>'乌兰察布市','time'=>'96'],
        283=> ['name'=>'锡林郭勒盟','time'=>'96'],
        284=> ['name'=>'兴安盟','time'=>'96'],
        285=> ['name'=>'伊犁哈萨克自治州','time'=>'96'],
        286=> ['name'=>'乌兰浩特市','time'=>'96'],
        287=> ['name'=>'固原市','time'=>'96'],
        288=> ['name'=>'中卫市','time'=>'96'],
        289=> ['name'=>'石嘴山市','time'=>'96'],
        290=> ['name'=>'吴忠市','time'=>'96'],
        291=> ['name'=>'银川市','time'=>'72'],
        292=> ['name'=>'格尔木市','time'=>'96'],
        293=> ['name'=>'果洛市','time'=>'96'],
        294=> ['name'=>'海北市','time'=>'96'],
        295=> ['name'=>'海东市','time'=>'96'],
        296=> ['name'=>'黄南市','time'=>'96'],
        297=> ['name'=>'西宁市','time'=>'72'],
        298=> ['name'=>'玉树市','time'=>'96'],
        299=> ['name'=>'滨州市','time'=>'72'],
        300=> ['name'=>'博州市','time'=>'72'],
        301=> ['name'=>'青岛市','time'=>'72'],
        302=> ['name'=>'泰安市','time'=>'72'],
        303=> ['name'=>'德州市','time'=>'72'],
        304=> ['name'=>'东营市','time'=>'72'],
        305=> ['name'=>'日照市','time'=>'72'],
        306=> ['name'=>'河泽市','time'=>'72'],
        307=> ['name'=>'济南市','time'=>'72'],
        308=> ['name'=>'济宁市','time'=>'72'],
        309=> ['name'=>'威海市','time'=>'72'],
        310=> ['name'=>'潍坊市','time'=>'72'],
        311=> ['name'=>'莱芜市','time'=>'72'],
        312=> ['name'=>'聊城市','time'=>'72'],
        313=> ['name'=>'临沂市','time'=>'72'],
        314=> ['name'=>'淄博市','time'=>'72'],
        315=> ['name'=>'烟台市','time'=>'72'],
        316=> ['name'=>'枣庄市','time'=>'72'],
        317=> ['name'=>'滕州市','time'=>'72'],
        318=> ['name'=>'长治市','time'=>'72'],
        319=> ['name'=>'吕梁市','time'=>'72'],
        320=> ['name'=>'大同市','time'=>'72'],
        321=> ['name'=>'朔州市','time'=>'72'],
        322=> ['name'=>'太原市','time'=>'48'],
        323=> ['name'=>'忻州市','time'=>'72'],
        324=> ['name'=>'晋城市','time'=>'72'],
        325=> ['name'=>'晋中市','time'=>'72'],
        326=> ['name'=>'临汾市','time'=>'72'],
        327=> ['name'=>'阳泉市','time'=>'72'],
        328=> ['name'=>'运城市','time'=>'72'],
        329=> ['name'=>'安康市','time'=>'96'],
        330=> ['name'=>'宝鸡市','time'=>'96'],
        331=> ['name'=>'商洛市','time'=>'96'],
        332=> ['name'=>'汉中市','time'=>'96'],
        333=> ['name'=>'铜川市','time'=>'96'],
        334=> ['name'=>'渭南市','time'=>'96'],
        335=> ['name'=>'西安市','time'=>'48'],
        336=> ['name'=>'咸阳市','time'=>'72'],
        337=> ['name'=>'延安市','time'=>'72'],
        338=> ['name'=>'杨凌市','time'=>'96'],
        339=> ['name'=>'榆林市','time'=>'96'],
        340=> ['name'=>'阿坝市','time'=>'96'],
        341=> ['name'=>'巴中市','time'=>'96'],
        342=> ['name'=>'巴州市','time'=>'96'],
        343=> ['name'=>'泸州市','time'=>'96'],
        344=> ['name'=>'眉山市','time'=>'96'],
        345=> ['name'=>'绵阳市','time'=>'72'],
        346=> ['name'=>'内江市','time'=>'96'],
        347=> ['name'=>'南充市','time'=>'96'],
        348=> ['name'=>'攀枝花市','time'=>'96'],
        349=> ['name'=>'自贡市','time'=>'96'],
        350=> ['name'=>'达州市','time'=>'96'],
        351=> ['name'=>'德阳市','time'=>'96'],
        352=> ['name'=>'甘孜市','time'=>'96'],
        353=> ['name'=>'广汉市','time'=>'96'],
        354=> ['name'=>'广安市','time'=>'96'],
        355=> ['name'=>'广元市','time'=>'96'],
        356=> ['name'=>'遂宁市','time'=>'96'],
        357=> ['name'=>'成都市','time'=>'48'],
        358=> ['name'=>'西昌市','time'=>'96'],
        359=> ['name'=>'乐山市','time'=>'96'],
        360=> ['name'=>'凉山市','time'=>'96'],
        361=> ['name'=>'资阳市','time'=>'96'],
        362=> ['name'=>'雅安市','time'=>'96'],
        363=> ['name'=>'宜宾市','time'=>'96'],
        364=> ['name'=>'阿里市','time'=>'96'],
        365=> ['name'=>'昌都市','time'=>'96'],
        366=> ['name'=>'那曲市','time'=>'96'],
        367=> ['name'=>'日喀则地区','time'=>'96'],
        368=> ['name'=>'拉萨市','time'=>'72'],
        369=> ['name'=>'林芝地区','time'=>'96'],
        370=> ['name'=>'阿克苏地区','time'=>'96'],
        371=> ['name'=>'阿拉尔市','time'=>'96'],
        372=> ['name'=>'阿勒泰地区','time'=>'96'],
        373=> ['name'=>'昌吉回族自治州','time'=>'96'],
        374=> ['name'=>'石河子市','time'=>'96'],
        375=> ['name'=>'塔城地区','time'=>'96'],
        376=> ['name'=>'哈密地区','time'=>'96'],
        377=> ['name'=>'和田地区','time'=>'96'],
        378=> ['name'=>'吐鲁番地区','time'=>'96'],
        379=> ['name'=>'乌鲁木齐市','time'=>'72'],
        380=> ['name'=>'喀什地区','time'=>'96'],
        381=> ['name'=>'库尔勒市','time'=>'96'],
        382=> ['name'=>'克拉玛依市','time'=>'96'],
        383=> ['name'=>'克孜勒苏柯尔克孜自治州','time'=>'96'],
        384=> ['name'=>'保山市','time'=>'96'],
        385=> ['name'=>'怒江傈僳族自治州','time'=>'96'],
        386=> ['name'=>'普洱市','time'=>'96'],
        387=> ['name'=>'楚雄彝族自治州','time'=>'96'],
        388=> ['name'=>'大理市','time'=>'96'],
       // 389=> ['name'=>'德宏州芒市','time'=>'96'],
        390=> ['name'=>'德宏傣族景颇族自治州','time'=>'96'],
        391=> ['name'=>'迪庆藏族自治州','time'=>'96'],
        392=> ['name'=>'红河哈尼族彝族自治州','time'=>'96'],
        393=> ['name'=>'文山壮族苗族自治州','time'=>'96'],
        394=> ['name'=>'西双版纳傣族自治州','time'=>'96'],
        395=> ['name'=>'昆明市','time'=>'72'],
        396=> ['name'=>'丽江市','time'=>'96'],
        397=> ['name'=>'临沧市','time'=>'96'],
        //398=> ['name'=>'砚山县市','time'=>'96'],
        399=> ['name'=>'玉溪市','time'=>'96'],
        400=> ['name'=>'昭通市','time'=>'96'],
        401=> ['name'=>'曲靖市','time'=>'96'],
        402=> ['name'=>'舟山市','time'=>'72'],
        403=> ['name'=>'宁波市','time'=>'72'],
        404=> ['name'=>'衢州市','time'=>'96'],
        405=> ['name'=>'瑞安市','time'=>'72'],
        406=> ['name'=>'绍兴市','time'=>'72'],
        407=> ['name'=>'台州市','time'=>'72'],
        408=> ['name'=>'杭州市','time'=>'72'],
        409=> ['name'=>'湖州市','time'=>'72'],
        410=> ['name'=>'嘉兴市','time'=>'72'],
        411=> ['name'=>'温州市','time'=>'72'],
        412=> ['name'=>'金华市','time'=>'72'],
        413=> ['name'=>'丽水市','time'=>'72'],
        414=> ['name'=>'临海市','time'=>'72'],
        415=> ['name'=>'永康市','time'=>'96'],
        416=> ['name'=>'慈溪市','time'=>'96'],
        417=> ['name'=>'东阳市','time'=>'72'],
        //418=> ['name'=>'义乌市','time'=>'72'],
        419=> ['name'=>'海盐县市','time'=>'96'],
        420=> ['name'=>'兰溪市','time'=>'96'],
        421=> ['name'=>'温岭市','time'=>'96'],
        422=> ['name'=>'诸暨市','time'=>'96'],
    ],
    //专人专车公里价格配置 4.专人 5.专车
     'zrcachievements'=>[
          '4'=>'0.05',
          '5'=>'0.1'
     ],
    'ac_type'=>['0'=>'取件','1'=>'发货','2'=>'提货','3'=>'派件','4'=>'专人','5'=>'专车','6'=>'方案调拨'],

    //客户配置
    'customer_config' => [
        1 => '签收自动反馈',
        2 => '温度自动反馈',
        3 => '客户货物标准化信息',
        4 => '自动发送催款短信',
        5 => '支持批量上传温度数据',
        6 => '项目订单',
        7 => '代签短信提醒',
        8 => '选择部门',
        9 => '客户端交接单据上传',
        10 => 'CRA、CRC下单，发件地址绑定医院地址'
    ],


    //校准证书-温度校准配置
    'temperature_calibration'=>[
        1=>'0℃,5℃,20℃,40℃',
        7=>'-15℃,-30℃,-80℃',
        2=>'-25℃,0℃,5℃,50℃',
        8=>'-30℃,0℃,5℃,20℃,40℃',
        5=>'-30℃,0℃,5℃,20℃,50℃',
       10=>'-30℃,0℃,5℃,20℃,60℃',
        9=>'-30℃,0℃,5℃,50℃',
        6=>'-80℃,-50℃,-30℃',
        3=>'-80℃,-50℃,-20℃,0℃',
        4=>'-196℃',
        11=>'-196℃,-80℃',
    ],
    //校准证书-湿度校准配置
    'humidity_calibration'=>[
        1=>'35%,75%',
        2=>'20%,80%',
        3=>'无'
    ],
    //异常收费
    'Abnormal_charges' => [
        1 => '干冰已买后取消',
        2 => '干冰已买且人已到现场后取消',
        3 => '耗材已调拨',
        4 => '耗材已调拨且人已到现场取消',
        5 => '人已到现场后取消',
        6 => '专人取消需要提供退票费用'
    ],

    //加急费
    'urgent'=> [
        1 => '客户要求限时达，加急收费',
        2 => '客户要求异地当日达，加急收费',
        3 => '客户要求直取直派，加急收费',
        4 => '耗材调拨,加急费'
    ],

    //租赁费
    'rent' => [
        1 => '客户租借包装',
        2 => '客户租借温度计'
    ],

    //物流供应商完成阶段
    'unfinished_phase' => [
        1 => '账单未收集',
        2 => '账单未核对',
        3 => '未通知开票',
        4 => '企业微信申请款项',
        5 => '未收到发票',
        6 => '未填写报销金额',
        7 => '出纳未确认交接',
        8 => '未付款完成'
    ],
    'exceptiongradelist'=>[
        1=>'一级异常',
        2=>'二级异常',
        3=>'三级异常'
    ],
        'company_list' => [
        1=>'上海生生物流有限公司',
        2=>'北生(北京)供应链管理有限公司',
        3=>'湖南生生供应链管理有限公司',
        4=>'吉林生生供应链管理有限公司',
        6=>'瑞生供应链管理(南京)有限公司',
        7=>'上海生生物流有限公司石家庄分公司',
        8=>'深圳晏嘉供应链管理有限公司',
        9=>'生生供应链管理(成都)有限公司',
        10=>'生生供应链管理(广州)有限公司',
        11=>'生生供应链管理(杭州)有限公司',
        12=>'生生供应链管理(济南)有限公司',
        13=>'生生供应链管理(天津)有限公司',
        14=>'苏州生生供应链管理有限公司',
        15=>'西安生生供应链管理有限公司',
        16=>'宴嘉供应链管理(武汉)有限公司',
        17=>'云南生生物流有限公司',
        18=>'郑州生生供应链管理有限公司',
        19=>'贵州生生供应链管理有限公司',
        20=>'南昌宴嘉供应链管理有限公司',
        21=>'瑞生供应链管理（南京）有限公司',
        22=>'厦门生生供应链管理有限公司',
        23=>'合肥宴佳瑞生供应链管理有限公司',
        24=>'晏嘉供应链管理（哈尔滨）有限公司',
    ],
    //更改取件时间费用
    'update_time_cost'=> [
        1 => '临时更改造成二次取件',
        2 => '更改时间造成耗材二次调拨',
        3 => '因客户原因，造成二次或二次以上派件'
    ],

    //合单配置项
    'to_identify_typeconfig'=>[
        //1.臻和合单模式  2.多温区合单模式
        //hcbanding 耗材绑定  1.需要绑定箱子 2.不需要绑定箱子
        //pneedhx 主单是否需要换冰排判断 1.需要  2.不需要
        //needfh  主单发货是否需要复核  1.臻和复核  2.输入数量数量比较箱子复核
        '1'=>['hcneedbox'=>'1','pneedhx'=>1,'needfh'=>'1'],
        '2'=>['hcneedbox'=>'2','pneedhx'=>2,'needfh'=>'2']
    ],
     'stt_type' => [1 => '药品', 2=> '耗材',3=>'设备',4=>'样本'],
     'wms_stt_type' => [1 => '药品', 4=>'样本'],
     //系统版本号配置
    'version_number'=>'V 2.4.1',
  //系统版本号配置
    'version_number'=>'V 2.4.1',
    //发货费费用类型
  "route_type"=>[
       "1"=>"航空",
       "2"=>"中铁",
       "3"=>"大巴",
       "4"=>"快递",
        "5"=>"生生专车",
        "6"=>"生生专人",
         "7"=>"专线",
          "8"=>"高铁",
          "9"=>"物流",
          "10"=>"京沪专线",
           "11"=>"沪皖专线",
           "12"=>"德邦",
    ],
//企业微信审批单状态
 "approve_status"=>[
             "1"=>"审批中",
              "2"=>"已通过",
             "3"=>"已驳回",
             "4"=>"已撤销",
             "6"=>"通过后撤销",
             "7"=>"已删除",
              "10"=>"已支付",
        ],
 //-------------------操作费用类型-------------------
  "fee_type"=>[
          1=>"发货费",2=>"提货费"
   ],
//发货费费用类型-小类
"fee_subtype"=>[
         1=>"发货费（航空）",
         2=>"发货费（中铁）",
         3=>"发货费（大巴）",
         4=>"发货费（快递）",
         5=>"发货费（大巴）",
         6=>"发货费（中铁）",
         7=>"发货费（大巴）",
         8=>"发货费（高铁）",
         9=>"发货费（快递）",
         10=>"发货费（大巴）",
         11=>"发货费（大巴）",
         12=>"发货费（快递）",
         13=>"发货费（大巴）"
  ],
 'tms_sup_taxrate' => [1=>'0.01', 2=>'0.06' ,3=>'0.09',4=>'0.03',5=>'0.00'],
 'yiliu_rubik_warehouse' => [1350, 1192], //易流魔方已关联的仓库id
//迈迪和生生外包关系
   'tosourcetype'=>[
        '1'=>'生生取件',
        '2'=>'生生派件',
        '3'=>'生生全包',
        '4'=>'迈迪取件',
        '5'=>'迈迪派件',
        '6'=>'迈迪全包'
    ],
      //耗材类型配置 0箱子 1 温度计 2.鼎为定位器
    "sttClassification"=>["0"=>"5,6,51,52,9","1"=>"4,36","2"=>"50"],
    //资产货存类型类目(顶级分类)
    'asset_stock_type_category' => [
        1 => '电子设备',
        2 => '库存商品',
        3 => '运输工具',
        4 => '低值易耗品',
        5 => '运营资产',
        6 => '运营包装耗材',
        7 => '包装耗材',
        8 => '基建资产',
        9 => '服务费用',
        10 => '其他',
        11 => '设备',
    ],
    //脐血库自动对账配置,自动对账项目ID
    'qixue_cp_id' => [2243,6480],
     //获取redis内城市信息类型
    'region_type' => ['GET_REGOIN_All' => 'GET_REGOIN_All'],
    //迈迪外包推送项目配置
    'mdoutsourcecpid'=>["201900337"=>"1","202100103"=>"1","201206985"=>"1"],
     //折扣管理折扣类型
     'dc_type' => [1=>'集团',2=>'客户',3=>'集团项目',4=>'客户项目'],
     //折扣管理折扣规则
     'dc_discount_type' => [1=>'按年',2=>'按月'],
 'user_info_storage_type' => 'redis',
    //核酸检测服务， 0:无需检测 1:人员核酸 2:外包装核酸 3:药品核酸  4:人员抗体检测
    'nucleicAcid' => ['无需检测','人员核酸','外包装核酸','药品核酸','人员抗体检测'],
    'nucleicAcidMap' => [0=>'0', 1=>'1', 2=>'2', 3=>'3', 4=>'4', 5=>'1,2', 6=>'1,3', 7=>'1,4', 8=>'2,3', 9=>'2,4', 10=>'3,4', 11=>'1,2,3', 12=>'1,2,4', 13=>'1,3,4', 14=>'2,3,4', 15=>'1,2,3,4'],
   "carBig" => [1 => "4.2米", 2 => "7.2米", 3 => "8.6米", 4 => "9.6米", 5 => "12.5米"],
   "carType" => [1 => "常温车", 2 => "冷藏车"],
    //EP泡沫箱配置--箱型取派件干冰回收提醒
    'ep_sto_id'=>[204956,204957,204958,205263,205264,212455,212456,212457,212458,212459,212460],
    //西门子订单温区数组
    "warmRange" =>[1=>'无',2=>"2~8℃",3=>"18~25℃",4=>"-25~-15℃",5=>"-20~-70℃"],
    //路由类型
    'routing_type' =>[1 => '铁路',2 => '航空',3 => '大巴',4 => '快递'],
    //承运商费率
    'carrier_rate' => [ 1 => 0,2 =>0.06,3=>0.01,4=>0.13,5=>0.09],
    'omsapi_is_mongo' => 1,
//药品盘点
     'remark_subtype_taking' => [135001=> '发起盘点计划' , 135002  => '下发盘点任务', 135003  => '删除盘点任务',135004  => '结束盘点任务'],
    'remark_subtype_yb_volume' => [136001=> '新增样本规格' , 136002  => '修改样本规格', 136003  => '删删除样本规格'],
//物流系统，客户项目特殊配置
     'tms_customer_conf' => [
         'tcc_dwt_shutdown_verify' => ['on' => 1, 'off' => 0, 'label' => '鼎为关机验证', 'span' => ''], //鼎为关机验证 1开启 0关闭
         'cu_piece_feedback' => ['on' => 1, 'off' => 2, 'label' => '签收自动反馈', 'span' => '（派件1小时后自动邮件签收反馈）'], 
         'cu_temperature_feedback' => ['on' => 1, 'off' => 2, 'label' => '温度自动反馈', 'span' => '（每晚8点自动邮件温度数据反馈）'],
         'cu_temperature_type' => ['on' => 1, 'off' => 2, 'label' => '支持批量上传温度数据', 'span' => '（默认客户支持批量上传温度数据）'],
         'cu_tengsen_trmperature' => ['on' => 1, 'off' => 2, 'label' => '不支持批量上传滕森温度数据', 'span' => '（默认客户支持上传）'],
         'cu_sign_feedback' => ['on' => 1, 'off' => 2, 'label' => '代签短信提醒', 'span' => ''],
         'cu_goods_print' => ['on' => 1, 'off' => 0, 'label' => '打印运单时将货物名称打印在运单上', 'span' => ''],
         'cu_send_message' => ['on' => 0, 'off' => 1, 'label' => '不发送取派短信', 'span' => '（配置后不给收发件人发送取派短信）'],
         'cu_print_express_remark' => ['on' => 1, 'off' => 0, 'label' => '客户单号打印到运单备注', 'span' => ''],
         'main_plural_thermometer' => ['on' => 1, 'off' => 0, 'label' => '支持主副温度计', 'span' => ' '],  
          'connect_verify' => ['on' => 1, 'off' => 0, 'label' => '上传客户交接单', 'span' => ' '],  
      
      ],
      'tms_project_conf' => [
    'pickup_collect_note_switch' => ['on' => 1, 'off' => 0, 'label' => '取件给收件方发送短信', 'span' => ' '],  
                'box_thermometer_switch' => ['on' => 1, 'off' => 0, 'label' => '双温度计（一箱2个温度计）', 'span' => ' '],
                 'note_code_switch' => ['on' => 1, 'off' => 0, 'label' => '派件验证码校验', 'span' => ' '], 
                 'pickup_client_mail_switch' => ['on' => 1, 'off' => 0, 'label' => '取件给客户发送邮件', 'span' => ' '], 
                 'cpc_send_message_add_customer' => ['on' => 1, 'off' => 0, 'label' => ' 取派短信发送项目人员信息', 'span' => ''],
                  'send_code_verify' => ['on' => 1, 'off' => 0, 'label' => '到达派件签收码校验', 'span' => ' '],  
                  'connect_verify' => ['on' => 1, 'off' => 0, 'label' => '上传客户交接单', 'span' => ' '],  
      ],
      'tms_city_conf' => [
                'warehouse_worksheet_switch' => ['on' => 1, 'off' => 0, 'label' => '仓库工作单配置', 'span' => ' '],
       ],
   //贴标
    'wms_marking_type' => [301=>'贴标前物料', 302=>'贴标后物料'],
   'wms_marking_type_detail' => [301001=>'贴标前物料', 302001=>'贴标后物料'],

 //基础地址经纬度配置
    'base_address_itude' => [
'北京市北京市北京经济技术开发区地盛东路1号院1号楼11'=>'114,39.79417274031742'
],  
    
    //贴标订单操作子类型
    'remark_subtype42' => [137001 => '添加贴标订单', 137002 => '产前培训', 137003 => '培训结束', 137004 => '药库核对',137005=>'质量核对',137006=>'产前清场',137007=>'产前清场复核',137008=>'新增过程',137009=>'新增流程',137010=>'修改流程',137011=>'删除流程',137012=>'提交ipc检查',137013=>'编辑ipc检查',137014=>'删除ipc检查',137015=>'生产完成',137016=>'留样结束',137017=>'产后清场确认',137018=>'产后清场复核',137019=>'物料平衡',137020=>'物料平衡药库核对',137021=>'物料平衡质量核对',137022=>'留样药库核对',137023=>'留样质量核对',137024=>'修改过程',137025=>'删除过程',137026=>'修改贴标订单',137027=>'取消贴标订单',137028=>'删除贴标订单','137029'=>'添加结算','137030'=>'修改结算',137031=>'留样修改',137032=>'编辑贴标流程',137033=>'新增步骤组合',137034=>'删除步骤组合',137035=>'编辑步骤组合',137036=>'贴标结束',137037=>'关闭订单','137038'=>'详情页附件修改','137039'=>'订单开始','137040'=>'订单结束',],   

    // 百度地图服务端ak配置
 'baidu_aks' => ['0UXR5HIHxsxQMubEMLf1qQU1oFedgssO', 'NdM9pdCTVYpjFucu28gSF5cpjezzyODC','GtQn7G6Qhk6Gs7quMdAWHbOeHN1bMP8w'],
 // 百度地图web端ak配置
 'baidu_web_client_ak' => 'CgMHoOvI5cDXrkrlhoHIiTv8AAWMREOX',
 'baidu_forward_domain' => 'http://baiduapi.ashsh.com.cn',

    //贴标生产方案
    'remark_subtype43' => [138001 => '添加贴标生产方案',138002 => '修改贴标生产方案',138003 => '作废贴标生产方案',138004 => '更新生产方案版本号'],   
 //生产方案及生产方案贴标订单
    'marking_order_file' => [302001 => '生产方案操作步骤图示',302002=> '下单文件',302003=> '其他', 302004 => '生产记录', 302005 => '合规性证明', 302006 => '生产方案'],
    
    //贴标步骤
    'marking_steps' => [
           1=>'拆原药盒',
            2=>'撕标签',
            3=>'剪板',
            4=>'折新包装',
            5=>'贴标签',
            6=>'组装药品盒',
            7=>'其他动作(塑封、按压标签)',
            8=>'排序',
            9=>'贴封口签',
            10=>'领料',
            11=>'产前清场',
            12=>'质量检查',
            13=>'物料平衡',
            14=>'产后清场',
            15=>'留样',
            16=>'分签',
            17=>'重复以上步骤',
    ],
    //贴标流程
    'marking_process'=> [
            1=>'领料',
            2=>'产前清场',
            3=>'生产过程',
            4=>'留样',
            5=>'物料平衡',
            6=>'产后清场',              
],

    //贴标仓库
    'marking_warehouse' => [
           '1350' => [
                 [
                    'sw_id'     => 1174,
                    'sw_no'     => '0010201',
                    'sw_name'   => '北京药品冷库1号库'
                ],
                [
                    'sw_id'     => 1221,
                    'sw_no'     => '0010202',
                    'sw_name'   => '北京药品冷库2号库'
                ],
            ],
            '1352' => [
               [
                    'sw_id'     => 1319,
                    'sw_no'     => '0021201',
                    'sw_name'   => '上海1号冷库'
                ],
                [
                    'sw_id'     => 1342,
                    'sw_no'     => '0021202',
                    'sw_name'   => '上海2号冷库'
                ],
                [
                    'sw_id'     => 1343,
                    'sw_no'     => '0021203',
                    'sw_name'   => '上海3号库'
                ],
                [
                    'sw_id'     => 1350,
                    'sw_no'     => '0021204',
                    'sw_name'   => '上海4号冷库'
                ],
            ],
            '1192' => [
                [
                    'sw_id'     => 7019,
                    'sw_no'     => '0020205',
                    'sw_name'   => '药品仓'
                ],
                [
                    'sw_id'     => 25981,
                    'sw_no'     => '0020503',
                    'sw_name'   => '广州药品测试'
                ]
            ]
    ],
 'market_root_list'=>[39,32298,10523],
 // 百度地图ak配置
 'baidu_aks' => ['0UXR5HIHxsxQMubEMLf1qQU1oFedgssO', 'NdM9pdCTVYpjFucu28gSF5cpjezzyODC'],

    //临床项目管理操作记录
   'wms_project_remark'=>[139001=>'新增项目',139002=>'编辑项目',139003=>'删除项目',139004=>'启动项目',139005=>'结束项目'],
    //销毁订单操作记录
   'wms_destory_remark'=>[140001=>'新增销毁订单',140002=>'编辑销毁订单',140003=>'删除销毁订单',140004=>'取消销毁订单',140005=>'开始销毁订单',140006=>'结束销毁订单',140007=>'上传附件',140008=>'删除附件',140009=>'填写车牌号'],

 //药品仓储楼层
 'sw_floor'=>[1=>'上海一层',2=>'上海四层',3=>'北京一层',4=>'广州一层'],
// month_dimensionality 维度考核要过滤的角色  month_evaluate 评价绩效要过滤的角色
'tms_performance_evaluate_conf'=>['month_dimensionality'=>['0097'],'month_evaluate'=>['0045','0062','0044']],
    //添加显示DTP的数据权限信息
    'dtpShowSg' => [25,37],

        //赛默飞 status配置
  'Tmo_status'=>[1 =>'Closed',2 =>'Cancel','3'=>'Pending'],
  //赛默飞 category 配置
  'Tmo_category'=>[ 1=>'In-house',2=>'Commercial',3=>'Test artical' ,4=>'others'],
       //新贴标订单项目负责人配置
  'cp_user'=>[11685=>'张晴晴',38186=>'董媛媛',70156=>'张诺',57790=>'林静' ,57798=>'赵梦瑶',18847=>'赵伟1',60926=>'贾春艳',47166=>'王鑫煜' ,60285=>'王梦园',1269=>'张彩慧',10086=>'孙在慧'],
//新贴标订单生产负责人配置
'new_marking_order_user'=>[11685=>'张晴晴',22369=>'曾鹏',552=>'张大伟',825=>'谷俊伸' ,968=>'肖志彬',1010=>'王鹏鹏',2350=>'柯运',6745=>'徐磊' ,18468=>'申彦梅',19930=>'丁雯丽',20532=>'王明超',23532=>'王邵波',24172=>'夏成建',24240=>'张楠' ,25266=>'吴冬松',26071=>'张春艳',27081=>'夏彬彬',37582=>'孙智强' ,40705=>'侯小龙',53816=>'王圆圆',55455=>'朱土华',57793=>'王亚兴',57797=>'胡进杰',59232=>'段文雪' ,63765=>'马梦宇',71311=>'吴盼',74917=>'郝志辉',77369=>'王超睿' ,78306=>'徐德龙',78688=>'候端歌',78689=>'张侠',78690=>陈卫丽],
       'order_cart_back_target_supplier' => 1148,
       'yan_jia_supplier_config' => 1319,
       //RFID异常识别码
       'rfid_yc_code'=>[ 'FFFFFF' ],
    //包材设计类型
    'packaging_steps' => [
           1=>'研究用药的标签和/或急救药物的标签',
            2=>'对照药物、联合用药和/或急救药物的标签',
            3=>'临床试验药品有效期更新',
            4=>'在临床试验药品上添加法规要求信息',
            5=>'其他',
            6=>'生生不参与生产',
    ],
     'wms_packaging_remark'=>[141001=>'创建包材设计单',141002=>'编辑包材设计单',141003=>'删除包材设计单',141004=>'启动项目',141005=>'结束项目'],

     //--------------------药品库存操作配置-----------------------
    'yp_inventory_remark'=>[142001=>'人工锁定',142002=>'人工解锁'],

   //--------------------出入库要求时间范围配置-----------------------
   'yp_iostorage_ask_frame' => [
         '08:00～10:00',
            '10:00～12:00',
            '12:00～14:00',
            '14:00～16:00',
            '16:00～18:00',
            '08:00～12:00',
            '12:00～18:00',
   ]
];