<?

20230208
1.跟进运营工作台测试
2.路由推荐应用2.0
	I.新增站点类型字段 1机场、2火车站、3汽车站、4仓库、5其他
	II.恢复承运商名称显示
	III.增加停运时间范围选择


20230227

1.小程序退款补差价  已上线
2.订单确认信息调整 已上线
3.结算箱型推送修改  已上线
4.外协管理增加结算方式筛选 

跟进外协冻结管理 财务接口对接



20230228

1.订单确认信息地址是否在城市标红 走异步查询
2.操作外协列表 增加日志 限制不可修改外协名称
3.后台发货异步消息异常 修复
4.路由时效展示大数据时效

外协冻结管理 财务接口对接




2023  2月 任务
1.路由推荐应用2.0  已上线
2.运营工作台需求变更 已上线
3.外协操作费用：冻结管理   测试中
4.订单确认信息调整  已上线
5.结算箱型推送修改  已上线
6.小程序退款补差价  已上线
7.物流系统校准证书附件同步临床供应链系统 已上线
8.外协操作费用新增财务删除逻辑状态同步  已上线


20230302

1.地址信息标红规则调整
2.路由列表未审核状态异步加载展示申请原因


20230309

1.备案管理 人员备案 
	I.上传备案附件
	II.查看附件
	III.锁定、解锁
2.修改数据申请的 取件人
3.导出停运的外协数据


20230310

路由审核优化













